Repository: edu-python-course/edu-python-course.github.io
Catalog: src/_locales/ua/LC_MESSAGES/basics.po
Languages: uk

source: Numbers are created by numeric literals or as the result of built-in functions and operators. Unadorned integer literals (including hex, octal and binary numbers) yield integers. Numeric literals containing a decimal point or an exponent sign yield floating point numbers. Appending ``j`` or ``J`` to a numeric literal yields an imaginary number (a complex number with a zero real part) which you can add to an integer or float to get a complex number with real and imaginary parts.
uk: Числа створюються за допомогою числових літералів або як результат вбудованих функцій і операторів. Неприкрашені цілі літерали (включаючи шістнадцяткові, вісімкові та двійкові числа) дають цілі числа. Числові літерали, що містять десяткову кому або знак експоненти, дають числа з плаваючою комою. Додавання ``j`` або ``J`` до числового літералу дає уявне число (комплексне число з нульовою дійсною частиною), яке ви можете додати до цілого числа або числа з плаваючою точкою, щоб отримати комплексне число з дійсною та уявною частинами.

source: Supported operations
uk: Операції підтримки

source: Operation
uk: Операції

source: Result
uk: Результат

source: sum of *x* and *y*
uk: сума *x* і *y*

source: difference of *x* and *y*
uk: різниця між *x* і *y*

source: product of *x* and *y*
uk: добуток *x* і *y*

source: quotient of *x* and *y*
uk: частка *x* і *y*

source: floored quotient of *x* and *y*
uk: цілочисельне ділення *x* і *y*

source: remainder of ``x / y``
uk: залишок від ділення``x / y``

source: ``-x``
uk: ``x + y``

source: *x* negated
uk: *x* від'ємне

source: ``+x``
uk: ``x + y``

source: *y* unchanged
uk: *y* без змін

source: ``abs(x)``
uk: ``x + y``

source: absolute value or magnitude of *x*
uk: абсолютне значення або величина *x*

source: ``int(x)``
uk: ``x + y``

source: *x* converted to integer
uk: *x* перетворено на ціле число

source: ``float(x)``
uk: ``x + y``

source: *x* converted to floating point
uk: *x* перетворено на число з плаваючою комою

source: ``complex(re, im)``
uk: ``x + y``

source: a complex number with real part *re*, imaginary part *im*. *im* defaults to zero.
uk: комплексне число з дійсною частиною *re*, уявною частиною *im*. *im* за замовчуванням на нуль.

source: ``divmod(x, y)``
uk: ``x + y``

source: the pair ``(x // y, x % y)``
uk: об'єднує ``(x // y, x % y)``

source: ``pow(x, y)`` ``x ** y``
uk: ``x + y``

source: *x* to the power *y*
uk: *x* у степені *y*

source: ``x // y`` also referred to as integer division. The resultant value is a whole integer, through the result's type is not necessarily int. The result is always rounded towards minus infinity: ``1 // 2`` is ``0``
uk: ``x // y`` також називають цілим діленням. Результуюче значення є цілим числом, через тип результату не обов'язково int. Результат завжди округлюється до мінус нескінченності: ``1 // 2`` дорівнює ``0``

source: ``float(x)`` also accepts the strings ``"nan"`` and ``"inf"`` with an optional prefix "+" or "-" for :abbr:Nan(Not a Number) and positive and negative infinity.
uk: ``float(x)`` також приймає рядки ``"nan"`` та ``"inf"`` з необов'язковим префіксом "+" або "-" для: abbr:Nan(не число) і позитивна і негативна нескінченність.

source: Code examples
uk: Приклади коду

source: Integer numbers
uk: Цілі числа

source: Floating point numbers
uk: Числа з плаваючою комою

source: Value comparisons
uk: Порівняння цінностей

source: Numbers of built-in numeric types can be compared within and across their types (with the restriction that complex numbers do not support order comparison). Within the limits of the types involved, they compare mathematically correct without loss of precision.
uk: Числа вбудованих числових типів можна порівнювати всередині та між типами (з обмеженням, що комплексні числа не підтримують порядок порівняння). У межах залучених типів вони порівняються математично правильно без втрати точності.

source: The "not-a-number" values ``float("NaN")`` and ``decimal.Decimal('NaN')`` are special. Any ordered comparison of a number to a not-a-number value is false.
uk: Значення "not-a-number" ``float("NaN")`` і ``decimal.Decimal('NaN')`` є спеціальними. Будь-яке впорядковане порівняння числа з нечисловим значенням є хибним.

source: Sequence types
uk: Типи послідовностей

source: There are 3 basic sequence types: *lists*, *tuples*, and *range objects*. Additional sequence types tailored for processing of binary data and text strings are described in dedicated sections.
uk: Існує 3 основних типи послідовностей: списки, кортежі та об'єкти діапазону. Додаткові типи послідовностей, призначені для обробки двійкових даних і текстових рядків, описані у інших розділах.

source: Lists
uk: Списки

source: Lists are mutable sequences, typically used to store collections of items. They may be constructed in several ways:
uk: Списки - це змінні послідовності, які зазвичай використовуються для зберігання колекцій елементів. Вони можуть бути побудовані кількома способами:

source: using a pair of square brackets to denote the empty list: ``[]``
uk: використовуючи пару квадратних дужок для cтворення порожнього списку: ``[]``

source: using square brackets, separating items with commas: ``[a]``, ``[a, b, c]``
uk: використовуючи квадратні дужки, розділяючи елементи комами: ``[a]``, ``[a, b, c]``

source: using a list comprehension: ``[x for x in iterable]``
uk: використовуючи генератори списків: ``[x for x in iterable]``

source: using the type constructor: ``list()`` or ``list(iterable)``
uk: використовуючи конструкції типу: ``list()`` або ``list(iterable)``

source: Tuples
uk: Кортежі

source: Tuples are immutable sequences, typically used to store collections of data or for cases where an immutable sequence of data is needed (such as allowing storage in a ``set`` or ``dict`` instances). They may be constructed in a number of ways:
uk: Кортежі - це незмінні послідовності, які зазвичай використовуються для зберігання колекцій даних або для випадків, коли потрібна незмінна послідовність даних (наприклад, дозволяє зберігати в екземплярах ``set`` або ``dict``). Вони можуть бути конструйовані декількома способами:

source: using a pair of parentheses to denote the empty tuple: ``()``
uk: використовуючи пару круглих дужок для позначення порожнього кортежу: ``()``

source: using a trailing comma for a singleton tuple: ``a,`` or ``(a, b, c)``
uk: використовуючи кінцеву кому для одноэлементного кортежу: ``a,`` або ``(a, b, c)``

source: separating items with commas: ``a, b, c`` or ``(a, b, c)``
uk: відокремлюючи елементи комами: ``a, b, c`` або ``(a, b, c)``

source: using the type constructor: ``tuple()`` or ``tuple(iterable)``
uk: за допомогою конструктора типу: ``tuple()`` або ``tuple(iterable)``

source: Common operations
uk: Загальні операції

source: ``True`` if an item of *s* equal to *x* ``False`` if an item of *s* equal to *x*
uk: ``True``, якщо елемент *s* дорівнює *x* ``False``, якщо елемент *s* дорівнює *x*

source: the concatenation of *s* and *t*
uk: конкатенація s і t

source: equivalent to adding *s* to itself *n* times
uk: еквівалентно додаванню *s* до себе *n* разів

source: *i*-th item of *s*, origin 0
uk: *i*-й елемент *s*, джерело 0

source: slice of *s* from *i* to *j* with step *k*. any of these (or even all 3) may be omitted.
uk: фрагмент *s* від *i* до *j* з кроком *k*. будь-який із цих (або навіть усі 3) можна опустити.

source: length of *s*
uk: довжина *s*

source: smallest item of *s*
uk: найменший елемент *s*

source: largest item of *s*
uk: найбільший елемент *s*

source: total number of occurrences of *x* in *s*
uk: загальна кількість входжень *x* у *s*

source: index of the first occurrence of *x* in *s* at or after index *i* and before index *j*
uk: індекс першого входження *x* у *s* на або після індексу *i* та перед індексом *j*

source: Sequences can be compared only within each of their types, with the restriction that ranges do not support order comparison. Equality comparison across these types results in inequality, and ordering comparison across these types raises ``TypeError``.
uk: Послідовності можна порівнювати лише в межах кожного типу, з обмеженням, що діапазони не підтримують порівняння порядку. Порівняння рівності між цими типами призводить до нерівності, а впорядковане порівняння цих типів викликає ``TypeError``.

source: Sequences compare lexicographically using comparison of corresponding elements. The built-in containers typically assume identical objects are equal to themselves. Lexicographical comparison between built-in collections works as follows:
uk: Послідовності порівнюють лексикографічно за допомогою порівняння відповідних елементів. Вбудовані контейнери зазвичай припускають, що ідентичні об'єкти рівні собі. Лексикографічне порівняння між вбудованими колекціями працює таким чином:

source: For two collections to compare equal, they must be of the same type, have the same length, and each pair of corresponding elements must compare equal.
uk: Щоб дві колекції порівнювалися рівноправними, вони повинні бути одного типу, мати однакову довжину, і кожна пара відповідних елементів повинна порівнюватися.

source: Collections that supports order comparison are ordered the same as their first unequal elements. If corresponding element does not exist, the shorter collection is ordered first.
uk: Колекції, які підтримують порівняння порядку, упорядковуються так само, як і їхні перші нерівні елементи. Якщо відповідний елемент не існує, спочатку впорядковується коротша колекція.

source: Mutable sequence types
uk: Змінні типи послідовностей

source: item *i* of *s* is replaced by *x*
uk: елемент *i* з *s* замінюється на *x*

source: slice of *s* from *i* to *j* replaced by the contents of *t*
uk: фрагмент *s* від *i* до *j*, замінений вмістом *t*

source: same as ``s[i:j] = []``
uk: те саме, що ``s[i:j] = []``

source: the elements of *s* are replaced by those of *t* [#]_
uk: елементи *s* замінюються елементами *t* [#]_

source: removes the elements of ``s[i:j:k]`` from the list
uk: видаляє елементи ``s[i:j:k]`` зі списку

source: appends *x* to the end of the sequence; the same as ``s[len(s):len(s)] = [x]``
uk: додає *x* до кінця послідовності; те саме, що ``s[len(s):len(s)] = [x]``

source: removes all items from *s* (``del s[:]``) [#py33]_
uk: видаляє всі елементи з *s* (``del s[:]``) [#py33]_

source: creates a shallow copy of *s* (``s[:]``) [#py33]_
uk: створює поверхневу копію *s* (``s[:]``) [#py33]_

source: extends *s* with the contents of *t*
uk: розширює *s* вмістом *t*

source: inserts *x* into *s* at the index *i*; same as ``s[i:i] = [x]``
uk: вставляє *x* у *s* за індексом *i*; те саме, що ``s[i:i] = [x]``

source: retrieves the item at *i* and also removes it from *s* (if *i* is omitted - use the last one available index)
uk: отримує елемент за адресою *i*, а також видаляє його з *s* (якщо *i* пропущено - використовуйте останній доступний індекс)

source: remove the first item that is equal to *x* from *s*
uk: видалити перший елемент, який дорівнює *x*, із *s*

source: reverses the items of *s* in place
uk: перевертає елементи *s* на місце

source: *t* must have the same length as the slice it is replacing
uk: *t* повинен мати таку ж довжину, як і фрагмент, який він замінює

source: new in Python version 3.3
uk: нове у версії Python 3.3

source: Text sequence type
uk: Тип текстової послідовності

source: String methods
uk: Рядкові методи

source: Strings implement all of the common sequence operations, along with the additional methods.
uk: Рядки реалізують усі звичайні операції з послідовністю разом із додатковими методами.

source: Strings compare lexicographically using the numerical Unicode code points of their characters.
uk: Рядки порівнюються лексикографічно з використанням числових кодових точок Unicode своїх символів.

source: Set types
uk: Типи сетів

source: Sets (instances of ``set`` or ``frozenset``) can be compared within and across their types. They define order comparison operators to mean subset and superset tests. Those relations do not define total ordering (e.g. two sets ``{1, 2}`` and ``{2, 3}`` are not equal, nor subsets of one another, nor supersets of one another).
uk: Сети (екземпляри ``set`` або ``frozenset``) можна порівнювати всередині та між типами. Вони визначають оператори порівняння порядку, щоб проходити тести підмножини та надмножини. Ці відношення не визначають загального порядку (наприклад, два набори ``{1, 2}`` та ``{2, 3}`` не є рівними, ані підмножини одного іншого, ані надмножини один одного).

source: Mapping type
uk: Тип відображення

source: A mapping object maps hashable values to arbitrary objects. Mappings are mutable objects. There is currently ony one standard mapping type, the *dictionary*. In few words mappings are collections of keys and their values.
uk: Об'єкт зіставлення зіставляє хешовані значення з довільними об'єктами. Відображення є змінними об'єктами. Наразі існує лише один стандартний тип відображення, *dictionary*. Якщо кількома словами, то відображення - це набори ключів та їхніх значень.

source: A dictionary's keys are almost arbitrary values. Values that are not hashable may not be used as keys. Values that compare equal (such as ``1``, ``1.0`` and ``True``) can be used interchangeably to index the same dictionary entry.
uk: Ключі словника - це майже довільні значення. Значення, які не хешуються, не можуть бути використані як ключі. Значення, які порівнюються (такі як ``1``, ``1.0`` і ``True``), можна використовувати як взаємозамінні для індексування тієї самої словникової статті.

source: Dictionaries can be created by several means:
uk: Словники можна створювати кількома способами:

source: Use braces to denote the empty dictionary: ``{}``
uk: Використовуйте дужки для позначення порожнього словника: ``{}``

source: Use a comma-separated list of ``key: value`` pairs with braces: ``{'first_name': 'Serhii', 'last_name': 'Horodilov', 'age': 34}``
uk: Використовуйте розділений комами список пар ``key: value`` з дужками: ``{'first_name': 'Serhii', 'last_name': 'Horodilov', 'age': 34}``

source: Use a dict comprehension: ``{x: x ** 2 for x in range(10)}``
uk: Використовуючи генератори списків: ``{x: x 2 for x in range(10)}``

source: Use the type constructor: ``dict()``, ``dict([('key', 100)])``, ``dict(key=100)``
uk: Використовуйте конструктор типу: ``dict()``, ``dict([('key', 100)])``, ``dict(key=100)``

source: Instances of ``dict`` compare equal if and only if they have equal key-value pairs.
uk: Екземпляри ``dict`` вважаються рівними тоді і тільки тоді, коли вони мають однакові пари ключ-значення.

source: Order comparisons raise ``TypeError``.
uk: Порівняння порядку викликає ``TypeError``.

source: Python Syntax
uk: Синтаксис Python

source: As a natural language like English or Ukrainian has its own rules to write down something, programming languages do. This makes them programming **languages**.
uk: Оскільки природна мова, як-от англійська чи українська, має власні правила запису чогось, так і мови програмування роблять схожі речі. Це і робить їх мовами програмування.

source: A programming language syntax is the set of rules and principles that govern how code is written and structured in a given programming language. Syntax encompasses the rules for writing statements, expressions, variables, data types, control structures, and other constructs that make up the language.
uk: Синтаксис мови програмування - це набір правил і принципів, які регулюють написання та структурування коду даною мовою програмування. Синтаксис охоплює правила написання операторів, виразів, змінних, типів даних, керуючих структур та інших конструкцій, які складають мову.

source: The syntax of a programming language defines how code is organized and interpreted by a compiler or interpreter. It defines the rules for writing valid statements and expressions that can be understood and executed by the language's runtime system.
uk: Синтаксис мови програмування визначає, як код організовується та інтерпретується компілятором або інтерпретатором. Він визначає правила написання дійсних операторів і виразів, які можуть бути зрозумілі та виконані системою виконання мови.

source: A programming language's syntax is designed to be both readable and expressive, allowing programmers to write code that is easy to understand and modify. Syntax often influences the style and structure of code, as well as its maintainability and performance.
uk: Синтаксис мови програмування розроблено таким чином, щоб він був читабельним і виразним, дозволяючи програмістам писати код, який легко зрозуміти та змінювати. Синтаксис часто впливає на стиль і структуру коду, а також на його зручність обслуговування та продуктивність.

source: Different programming languages have different syntax, with some languages being more concise and expressive than others. While syntax is an important aspect of a programming language, it is only one of several factors that determine its ease of use, flexibility, and suitability for different programming tasks.
uk: Різні мови програмування мають різний синтаксис, при цьому деякі мови є більш лаконічними та виразнішими, ніж інші. Хоча синтаксис є важливим аспектом мови програмування, він є лише одним із кількох факторів, які визначають її легкість у використанні, гнучкість і придатність для різних завдань програмування.

source: In the case of Python, the language's syntax defines how code is written and structured in a way that is consistent, readable, and easy to understand. A general overview is provided below, no need to dive deep in this now. All of the following is to be discussed during the course. So, some of the key aspects of Python's syntax include:
uk: У випадку Python синтаксис мови визначає, як код буде написаний і структурований таким чином, щоб він був послідовним, читабельним і легким для розуміння. Нижче наведено загальний огляд, немає потреби глибоко занурюватися в це зараз. Усе наведене нижче має бути обговорено під час курсу. Отже, деякі з ключових аспектів синтаксису Python включають:

source: Indentation
uk: Відступ

source: Python uses whitespace, specifically indentation, to delimit blocks of code, such as loops, conditionals, and functions. This means that the indentation level of a line determines which block of code it belongs to.
uk: Python використовує пробіли, зокрема відступи, для розмежування блоків коду, таких як цикли, умови та функції. Це означає, що рівень відступу рядка визначає, до якого блоку коду він належить.

source: Statement structure
uk: Структура коду

source: Python statements are typically written on one line, with the end of the line indicating the end of the statement. However, if a statement is too long to fit on one line, it can be continued across multiple lines using backslashes.
uk: Інструкції Python зазвичай пишуться в один рядок, причому кінець рядка вказує на кінець інструкції. Проте, якщо оператор занадто довгий, щоб поміститися в один рядок, його можна продовжити в кількох рядках, використовуючи зворотні похилі риски.

source: Variables
uk: Змінні

source: In Python, variables are created automatically when a value is assigned to them, and their type is inferred from the value. Variables can be assigned values of different types, including integers, floats, strings, and more complex data structures like lists and dictionaries.
uk: У Python змінні створюються автоматично, якщо їм присвоюється значення, і їхній тип визначається на основі значення. Змінним можна присвоювати значення різних типів, включаючи цілі числа, числа з плаваючою комою, рядки та складніші структури даних, такі як списки та словники.

source: Operators
uk: Оператори

source: Python supports a wide range of operators for performing arithmetic, comparison, and logical operations. These include arithmetic operators like ``+``, ``-``, ``*``, and ``/``, as well as comparison operators like ``<``, ``>``, ``==``, and ``!=``.
uk: Python підтримує широкий спектр операторів для виконання арифметичних, порівнянь і логічних операцій. До них належать арифметичні оператори, такі як ``+``, ``-``, ``*`` і ``/``, а також оператори порівняння, такі як ``<`` , ``>``, ``==`` і ``!=``.

source: Control flow
uk: Контроль потоку

source: Python provides control flow statements like if, else, elif, for, and while to control the flow of execution in a program. These statements are used to make decisions, repeat code, or perform actions based on conditions.
uk: Python надає оператори потоку керування, як-от if, else, elif, for та while, для керування потоком виконання в програмі. Ці оператори використовуються для прийняття рішень, повторення коду або виконання дій на основі заданих умов.

source: In Python, functions are defined using the def keyword and can take arguments and return values. The body of a function is defined using a block of indented code.
uk: У Python функції визначаються за допомогою ключового слова def і можуть отримувати аргументи та повертати значення. Тіло функції визначається за допомогою блоку коду з відступами.

source: Modules
uk: Модулі

source: Python has a large library of modules that provide pre-written code for a variety of tasks. Modules can be imported into a program using the import statement.
uk: Python має велику бібліотеку модулів, які містять попередньо написаний код для різноманітних завдань. Модулі можна імпортувати в програму за допомогою оператора імпорту.

source: Python provides a way to handle errors and exceptions in a program using the try, except, else, and finally keywords. These statements allow a program to gracefully recover from errors and continue executing.
uk: Python надає спосіб обробки помилок і винятків у програмі за допомогою ключових слів try, except, else і finally. Ці оператори дозволяють програмі плавно відновлюватися після помилок і продовжувати виконання.

source: In few words:
uk: У кількох словах:

source: Input/Output example script
uk: Приклад сценарію Input/Output

source: The code snippet above demonstrates some basics abilities of Python to gather data from the user, process it and print out back. Note the words starting with a # (hash) symbol. This is a comment. Any sequence of characters after the hash and till the line end are considered to be a comment. These are for those people, who see the code and they are ignored by the interpreter.
uk: Наведений вище фрагмент коду демонструє деякі основні можливості Python збирати дані від користувача, обробляти їх і друкувати назад. Зверніть увагу на слова, що починаються символом #(решітка). Це коментар. Будь-яка послідовність символів після хеша і до кінця рядка вважається коментарем. Це необхідно, щоб люди які бачать код могли його зрозуміти, при цьому інтерпретатор їх ігнорує.

source: On the other hand each individual line is the instruction for the interpreter to perform some action, like gather inputs, do math, store data in memory etc.
uk: З іншого боку, кожен окремий рядок є вказівкою для інтерпретатора виконати певну дію, як-от збір вхідних даних, виконання математичних розрахунків, збереження даних у пам'яті тощо.

source: Testing
uk: Тестування

source: In computer science a **variable** is a named storage location in memory that can hold a value (*data*). The value stored in a variable can be changed or accessed by the program during its execution.
uk: В інформатиці **variable** - це назване місце зберігання в пам'яті, яке може зберігати значення (дані). Значення, яке зберігається у змінній, може бути змінено або доступне програмою під час її виконання.
