Repository: edu-python-course/edu-python-course.github.io
Catalog: src/_locales/ua/LC_MESSAGES/basics.po
Languages: uk

source: Control Flow
uk: Керування виконанням

source: Decorators
uk: Декоратори

source: Decorators provide a simple syntax for calling higher-order functions :cite:`realpython:decorators`.
uk: Декоратори забезпечують простий синтаксис для виклику функцій вищого порядку :cite:`realpython:decorators`.

source: There is some kind of misunderstanding in definitions.
uk: Є деяке непорозуміння у визначеннях.

source: **Decorator** is a function returning another function, usually applied as a function transformation using the ``@wrapper`` syntax :cite:`docs-python:term-decorator`.
uk: **Декоратор** — це функція, яка повертає іншу функцію, зазвичай застосовується як перетворення функції за допомогою синтаксису ``@wrapper`` :cite:`docs-python:term-decorator`.

source: However, that's no quit enough to describe it. The more complete definition is:
uk: Однак цього недостатньо, щоб описати це. Більш повне визначення таке:

source: **Decorator** is a structural design pattern that lets you attach new behaviors to objects by placing these objects inside special wrapper objects that contain the behaviors :cite:`refactoring.guru:decorator`.
uk: **Декоратор** — це структурний шаблон проектування, який дає змогу додавати нову поведінку до об'єктів, розміщуючи ці об'єкти всередині спеціальних об'єктів-огорток, які містять поведінку :cite:`refactoring.guru:decorator`.

source: Before you understand decorators, you must first understand how functions work.
uk: Перш ніж зрозуміти декораторів, ви повинні спочатку зрозуміти, як працюють функції.

source: First-class objects
uk: Об'єкти першого класу

source: In Python functions are `first-class objects`_. Everything in Python is an object. Functions are objects too.
uk: У Python функції є `об'єктами першого класу`_. Усе в Python є об'єктом. Функції також є об'єктами.

source: Inner functions
uk: Внутрішні функції

source: Functions can be nested. This means it is possible to define functions inside other functions.
uk: Функції можуть бути вкладеними. Це означає, що можна визначати функції всередині інших функцій.

source: Nested functions example
uk: Приклад вкладених функцій

source: The order in which inner functions are defined no matters. The function definition does not execute the function body; this gets executed only when the function is called. Furthermore, the inner functions are not defined until the parent function is called. They are locally scoped to their parent. Trying to call ``heapify`` function outside of ``heap_sort`` will cause ``NameError`` exception.
uk: Порядок визначення внутрішніх функцій не має значення. Визначення функції не виконує тіло функції; це виконується лише під час виклику функції. Крім того, внутрішні функції не визначені, доки не буде викликана батьківська функція. Вони локально прив'язані до свого батьківського елемента. Спроба викликати функцію ``heapify`` поза межами ``heap_sort`` спричинить виняток ``NameError``.

source: Functions are objects
uk: Функції є об'єктами

source: This means functions can be passed around and used as arguments, just like any other object (e.g. *int*, *str* etc.).
uk: Це означає, що функції можна передавати й використовувати як аргументи, як і будь-який інший об'єкт (наприклад, *int*, *str* тощо).

source: Returning functions
uk: Повернення функцій

source: Since function can be passed as an argument, it may be returned from another function.
uk: Оскільки функцію можна передати як аргумент, її можна повернути з іншої функції.

source: ``parent`` returns functions themselves, there are no parentheses.
uk: ``parent`` повертає самі функції, тут нема дужок.

source: After running the code snippet above, ``first`` refers the ``first_child`` function from the inner ``parent`` scope. From now it can be used to call the target function it refers.
uk: Після виконання наведеного вище фрагмента коду ``first`` посилається на функцію ``first_child`` із внутрішньої області ``parent``. Відтепер його можна використовувати для виклику цільової функції, на яку він посилається.

source: Simple decorators
uk: Прості декоратори

source: Now you're ready to move on and see the magical beast that is the Python decorators. Let's start with a simple example:
uk: Тепер ви готові рухатися далі та побачити чарівного звіра, яким є декоратори Python. Почнемо з простого прикладу:

source: Running function:
uk: Запуск функцій:

source: The common way to use decorators is to replace the original function with a decorated one:
uk: Поширеним способом використання декораторів є заміна оригінальної функції на декоровану:

source: ``say_hello`` function is the reference to the ``decorator.<locals>.wrapper``, which itself is bound to the original ``say_hello`` function. There is a syntactic sugar to do this, called *pie-syntax*. The following example does exact the same things as the first decorator example:
uk: Функція ``say_hello`` є посиланням на ``decorator.<locals>.wrapper``, який сам прив'язаний до оригінальної функції ``say_hello``. Для цього існує синтаксичний цукор, який називається *pie-syntax*. Наступний приклад виконує ті самі речі, що й перший приклад декоратора:

source: There is no way to *undecorate* object in Python. Once something is bound to the decorator's wrapper - it is decorated forever.
uk: У Python немає способу *скасувати* об'єкт. Одного разу щось прив'язане до обгортки декоратора - воно прикрашене назавжди.

source: A decorated function still remains a **function**. So, it can be decorated once more time again, and again, and again...
uk: Декорована функція все ще залишається **функцією**. Отже, його можна прикрашати ще раз, і ще, і ще...

source: "Wrapper" is the alternative nickname for the Decorator pattern that clearly expresses the main idea of the pattern. A wrapper is an object that can be linked with some target object. The wrapper contains the same set of methods as the target and delegates to it all requests it receives. However, the wrapper may alter the result by doing something either before or after it passes the request to the target.
uk: "Обгортка" — альтернативне прізвисько візерунка "Декоратор", яке чітко виражає основну ідею візерунка. Обгортка — це об'єкт, який можна зв'язати з деяким цільовим об'єктом. Обгортка містить той самий набір методів, що й мета, і делегує їй усі отримані запити. Однак обгортка може змінити результат, зробивши щось до або після того, як вона передає запит цільовому об'єкту.

source: Passing arguments to the wrapper
uk: Передача аргументів до wrapper

source: Until now the examples use *simple* decorators. But what if the decorated function gets some arguments? This will cause ``TypeError`` exception that tell that "arguments are missed". This can be fixed with just passing arguments to the ``wrapper`` inner function.
uk: Досі приклади використовують *прості* декоратори. Але що, якщо декорована функція отримує деякі аргументи? Це спричинить виняток ``TypeError``, який повідомляє, що "аргументи пропущено". Це можна виправити, просто передавши аргументи внутрішній функції ``wrapper``.

source: If case you're trying to make a generic decorator, you may pass ``*args`` and ``**kwargs`` instead of exact arguments:
uk: Якщо ви намагаєтеся створити загальний декоратор, ви можете передати ``*args`` і ``**kwargs`` замість точних аргументів:

source: Passing arguments to decorator
uk: Передача аргументів декоратору

source: At last it's time to know how to pass arguments to the decorator. Here is a simple implementation of ``defer`` decorator which deferred the function execution for some time:
uk: Нарешті настав час знати, як передавати аргументи декоратору. Ось проста реалізація декоратора ``defer``, яка відкладає виконання функції на деякий час:

source: Class decorators
uk: Декоратори класів

source: There are some pre-defined decorators exists for usage together with classes. They are:
uk: Існують деякі попередньо визначені декоратори для використання разом із класами. Це:

source: If you develop an intuitive understanding for their differences you'll be able to write object-oriented Python that communicates its intent more clearly and will be easier to maintain in the long run :cite:`realpython:methods-demystified`.
uk: Якщо ви розвинете інтуїтивне розуміння їхніх відмінностей, ви зможете написати об'єктно-орієнтований Python, який чіткіше передає свої наміри та який буде легше підтримувати в довгостроковій перспективі :cite:`realpython:methods-demystified`.

source: Class methods
uk: Методи класу

source: Instead of accepting a ``self`` parameter, class methods take a ``cls`` parameter that points to the class — and not the object instance — when the method is called.
uk: Замість того, щоб приймати параметр self, під час виклику методу методи класу приймають параметр ``cls``, який вказує на клас, а не на екземпляр класу.

source: Because the class method only has access to this ``cls`` argument, it can't modify object instance state. That would require access to ``self``. However, class methods can still modify class state that applies across all instances of the class.
uk: Оскільки метод класу має доступ лише до цього аргументу ``cls``, він не може змінити стан екземпляра об'єкта. Це потребує доступу до ``self``. Однак методи класу все ще можуть змінювати стан класу, який застосовується до всіх екземплярів класу.

source: The common usage for ``classmethod`` is provide alternative initializers.
uk: Загальним використанням ``методи класу`` є надання альтернативних ініціалізаторів.

source: Static methods
uk: Статичні методи

source: This type of method takes neither a ``self`` nor a ``cls`` parameter (but of course it's free to accept an arbitrary number of other parameters).
uk: Цей тип методу не приймає ані ``self``, ані ``cls`` параметр (але, звичайно, він може приймати будь-яку кількість інших параметрів).

source: Therefore a static method can neither modify object state nor class state. Static methods are restricted in what data they can access - and they're primarily a way to namespace your methods.
uk: Тому статичний метод не може змінити ні стан об'єкта, ні стан класу. Статичні методи обмежені в тому, до яких даних вони можуть отримати доступ, і вони, перш за все, є способом простору імен ваших методів.

source: It's tricky to explain ``staticmethod`` usage. Almost always you can create a dedicated function instead of static method. But sometimes you need to bind some logic independent from class itself or its instances to a class - it common to encapsulate it with ``staticmethod``.
uk: Важко пояснити використання ``staticmethod``. Майже завжди ви можете створити спеціальну функцію замість статичного методу. Але іноді вам потрібно прив'язати до класу певну логіку, незалежну від самого класу або його екземплярів – зазвичай інкапсулювати її за допомогою ``staticmethod``.

source: Properties
uk: Властивості

source: It's a way to bind a method name to access it as an attribute. Properties are **read-only** by default. This means a value cannot be assigned to ``property member``.
uk: Це спосіб прив'язати назву методу для доступу до нього як до атрибута. За замовчуванням властивості доступні **лише для читання**. Це означає, що значення не можна призначити ``члену властивості``.

source: Some examples
uk: Деякі приклади

source: Errors and Exceptions
uk: Помилки та винятки

source: There are (at least) two distinguishable kinds of errors: *syntax errors* and *exceptions* :cite:`docs-python:errors`.
uk: Існує (принаймні) два типи помилок: *синтаксичні помилки* та *виключення* :cite:`docs-python:errors`.

source: Syntax errors
uk: Синтаксичні помилки

source: Syntax errors are also known as parsing errors.
uk: Синтаксичні помилки також відомі як помилки Python парсера.

source: The parser repeats the offending line and displays a little "arrow" pointing at the earliest point in the line where the error was detected. The error is caused by (or at least detected at) the token preceding the arrow.
uk: Синтаксичний аналізатор повторює неправильний рядок і відображає маленьку "стрілку", яка вказує на найперший символ рядка, де було виявлено помилку. Помилка спричинена (або принаймні виявлена) символом(а) перед стрілкою.

source: Exceptions
uk: Винятки

source: Even if a statement or expression is syntactically correct, it may cause an error when an attempt is made to execute it. Errors detected during execution are called exceptions and are not unconditionally fatal: you will soon learn how to handle them in Python programs.
uk: Навіть якщо оператор або вираз синтаксично правильний, це може спричинити помилку під час спроби його виконання. Помилки, виявлені під час виконання, називаються винятками і не є фатальними: незабаром ви дізнаєтеся, як їх обробляти в програмах на Python.

source: Exceptions come in different types, and the type is printed as part of the message.
uk: Винятки бувають різних типів, і тип друкується як частина повідомлення.

source: For example, the ``div`` function implemented as
uk: Наприклад, функція ``div``, реалізована як

source: may cause a ``ZeroDivisionError`` exception in case 0 is passed as ``y`` parameter.
uk: може викликати виняток ``ZeroDivisionError``, якщо 0 передається як параметр ``y``.

source: Standard exception names are built-in identifiers (not reserved keywords).
uk: Стандартні назви винятків є вбудованими ідентифікаторами (а не зарезервованими ключовими словами).

source: The list of `built-in exceptions`_
uk: Список `вбудованих винятків`_

source: Tracebacks
uk: Відстеження

source: "File" is replaced with a *dummy string* within the examples.
uk: У наведених прикладах "Файл" замінено на *фіктивний рядок*.

source: Let's assume the following modules structure:
uk: Припустимо наступну структуру модулів:

source: The **main** module imports a ``div`` function implemented above from the **func** module. The code in main is implemented as follows:
uk: Модуль **main** імпортує функцію ``div``, реалізовану вище, з модуля **func**. Основний код реалізовано наступним чином:

source: While running the code with correct inputs it will work fine. But there are at two exceptions for this script.
uk: Під час виконання коду з правильними введеннями він працюватиме нормально. Але для цього сценарію є два винятки.

source: The first one is related on type conversion. While running the main script there is case of invalid input.
uk: Перший пов'язаний з перетворенням типів. Під час виконання основного сценарію є випадок неправильного введення.

source: Note the **traceback** indicates the module and the exact line of code that causes the exception.
uk: Зауважте, що **traceback** вказує на модуль і точний рядок коду, який викликає виняток.

source: The second one exception occurs when a 0 is passed as the second parameter to ``div`` function. The traceback would look like:
uk: Другий виняток виникає, коли 0 передається як другий параметр функції ``div``. Трасування виглядатиме так:

source: The traceback indicates all calls (top to bottom) that cause an exception.
uk: Зворотне відстеження вказує на всі виклики (зверху вниз), які викликають виняток.

source: Exception handling
uk: Обробка винятків

source: It is possible to write programs that handle selected exceptions. The ``try`` statement is used to do that.
uk: Можна писати програми, які оброблятимуть вибрані винятки. Для цього використовується інструкція ``try``.

source: The try statement works as follows.
uk: Інструкція try працює наступним чином.

source: First, the try clause (the statement(s) between the try and except keywords) is executed.
uk: Спочатку виконується речення try (вираз(и) між ключовими словами try і except).

source: If no exception occurs, the except clause is skipped and execution of the try statement is finished.
uk: Якщо винятків не відбувається, пропозиція винятку пропускається, і виконання оператора try завершується.

source: If an exception occurs during execution of the try clause, the rest of the clause is skipped. Then, if its type matches the exception named after the except keyword, the except clause is executed, and then execution continues after the try/except block.
uk: Якщо під час виконання try виникає виняток, решта пропозиції пропускається. Потім, якщо його тип збігається з винятком, названим за ключовим словом osim, виконується пропозиція, а потім виконання продовжується після блоку try/except.

source: If an exception occurs which does not match the exception named in the except clause, it is passed on to outer try statements; if no handler is found, it is an unhandled exception and execution stops with a message as shown above.
uk: Якщо виникає виняток, який не збігається з винятком, названим у реченні винятку, він передається зовнішнім операторам try; якщо обробник не знайдено, це необроблена виняткова ситуація, і виконання зупиняється з повідомленням, як показано вище.

source: A try statement may have more than one except clause, to specify handlers for different exceptions.
uk: Інструкція try може мати більше однієї пропозиції, щоб вказати обробники для різних винятків.

source: Handling ALL exception
uk: Опрацювання усіх винятків

source: It's a bad practice to handle **all** exceptions.
uk: Обробляти **всі** винятки – це погана практика.

source: When indicating an ``except`` block without specifying an exception to catch it will work for any exception, that occurs in ``try`` block. The same is relevant for handling ``BaseException`` and ``Exception``. But you can never say what exact goes wrong.
uk: Якщо вказати блок ``except`` без визначення винятку для перехоплення, він працюватиме для будь-якого винятку, який виникає в блоці ``try``. Те саме стосується обробки ``BaseException`` і ``Exception``. Проте ніколи не можливо сказати, який саме виняток стався.

source: However, this scenario may work for logging an exception and raising it again to be handled on upper levels.
uk: Проте, такий сценарій може працювати для логування винятків, після чого вони підійматься заново, щоб бути опрацьованими на вищих рівнях програми.

source: All exceptions are inherited from ``Exception`` class, which is subclass of ``BaseException``. So, you can never know what exactly goes wrong with your code.
uk: Усі винятки успадковуються від класу ``Exception``, який є підкласом ``BaseException``. Отже, ви ніколи не можете знати, що саме пішло не так із вашим кодом.

source: ``finally`` statement
uk: Вираз ``finally``

source: The ``try`` statement cannot be used itself. This will cause ``SyntaxError``. Either ``except`` or ``finally`` block is required to be included.
uk: Оператор ``try`` не може бути використаний сам по собі. Це спричинить ``SyntaxError``. Необхідно включити блок ``except`` або ``finally``.

source: While the ``except`` block tries to catch the exceptions if any, the ``finally`` block will be always executed regardless of the exception occurs.
uk: У той час як блок ``except`` намагається перехопити винятки, якщо такі є, блок ``finally`` завжди виконуватиметься незалежно від виникнення винятку.

source: ``else`` statement
uk: Вираз ``else``

source: The ``try`` statement can also use ``else`` (which is optional). The statements within this block will be execute only in case there were no exceptions raised while running the ``try``.
uk: Оператор ``try`` також може використовувати ``else`` (який є необов'язковим). Інструкції в цьому блоці виконуватимуться лише у випадку, якщо під час виконання ``try`` не було викликано винятків.

source: Raising exceptions
uk: Винятки: raising

source: The ``raise`` statement allows the programmer to force a specified exception to occur. The sole argument to raise indicates the exception to be raised. This must be either an exception instance or an exception class (a class that derives from ``BaseException``, such as ``Exception`` or one of its subclasses). If an exception class is passed, it will be implicitly instantiated by calling its constructor with no arguments.
uk: Інструкція ``raise`` дозволяє програмісту примусово викликати певний виняток. Єдиний аргумент, який потрібно викликати, вказує на виняток, який потрібно викликати. Це має бути екземпляр винятку або клас винятку (клас, який походить від ``BaseException``, наприклад ``Exception`` або один із його підкласів). Якщо передано клас винятків, він буде неявно створений шляхом виклику його конструктора без аргументів.

source: ``raise`` statement itself will re-raise all the exceptions within the context. Also exceptions can be raised again from the ``except`` block. It's a common pattern to catch the exception for loggers and when re-raise it.
uk: Сам оператор ``raise`` повторно викличе всі винятки в контексті опрацювання. Крім того, винятки можуть бути викликані знову з блоку ``except``. Це загальний шаблон для перехоплення винятку для реєстрації повідомлення про виняткову ситуацію і повторного його підняття.

source: Creating custom exceptions
uk: Створення винятків

source: Programs may name their own exceptions by creating a new exception class. Exceptions should typically be derived from the Exception class, either directly or indirectly.
uk: Програми можуть називати власні винятки, створюючи новий клас винятків. Винятки зазвичай мають бути похідними від класу Exception, прямо чи опосередковано.

source: Exception classes can be defined which do anything any other class can do, but are usually kept simple, often only offering a number of attributes that allow information about the error to be extracted by handlers for the exception.
uk: Можна визначити класи винятків, які роблять усе, що може зробити будь-який інший клас, але зазвичай вони прості, часто пропонують лише ряд атрибутів, які дозволяють обробникам витягувати інформацію про помилку для винятку.

source: Most exceptions are defined with names that end in "Error", similar to the naming of the standard exceptions.
uk: Більшість винятків визначено з іменами, які закінчуються на "Error", подібно до назв стандартних винятків.

source: Many standard modules define their own exceptions to report errors that may occur in functions they define.
uk: Багато стандартних модулів визначають власні винятки, щоб повідомляти про помилки, які можуть виникнути у функціях, які вони визначають.

source: User-defined exception
uk: Виняток, визначений користувачем

source: Functions
uk: Функції

source: Python Basics
uk: Основи Python

source: Pythons Modules and Imports
uk: Модулі та імпорт Pythons

source: Style Guides: PEP8
uk: Керівництво по стилю: PEP8

source: Built-in Types
uk: Вбудовані типи

source: The principal built-in types are numerics, sequences, mappings, classes, instances and exceptions :cite:`docs-python:stdtypes`. This section covers only the most base of them. Others will be discussed in the future within their own topics.
uk: Основними вбудованими типами є числа, послідовності, відображення, класи, екземпляри та винятки :cite:`docs-python:stdtypes`. Цей розділ охоплює лише найпростіші з них. Інші будуть обговорюватися в майбутньому в рамках їхніх власних тем.

source: Numeric types
uk: Числові типи

source: There are 3 distinct numeric types: *integers*, *floating point numbers*, and *complex numbers*. In addition, Booleans are a subtype of integers. Integers have unlimited precision. Floating point numbers are usually implemented using ``double`` in C. Complex numbers have a real and imaginary part, which are each a floating point number.
uk: Існує 3 різних типи чисел: *integers*, *floating point numbers*, та *complex numbers*. Крім того, логічні значення є підтипом цілих чисел. Цілі числа мають необмежену точність. Числа з плаваючою комою зазвичай реалізуються через знак ``double`` у C. Комплексні числа мають дійсну та уявну частини, кожна з яких є числом з плаваючою комою.
