Repository: edu-python-course/edu-python-course.github.io
Catalog: src/_locales/ua/LC_MESSAGES/basics.po
Languages: uk

source: In Python, variables are created dynamically once a value is assigned to them. This makes Python a dynamically typed language, which means that the data type of a variable is inferred from the value assigned to it. So, you do not need to declare a variable before using it, as in statically typed languages.
uk: У Python змінні створюються динамічно після присвоєння їм значення. Це робить Python динамічно типізованою мовою, а це означає, що тип даних змінної виводиться з присвоєного їй значення. Отже, вам не потрібно оголошувати змінну перед її використанням, як у статично типізованих мовах.

source: The ability to create variables dynamically and infer their data type makes Python code more concise and easier to read. However, it also requires careful attention to variable naming and assignment to avoid unexpected behavior.
uk: Можливість динамічно створювати змінні та виводити їхні типи даних робить код Python більш лаконічним і легшим для читання. Однак це також вимагає пильної уваги до іменування та призначення змінних, щоб уникнути неочікуваної поведінки.

source: In Python ``=`` (assignment operator) is used to set a value to some variable, the portion on the left of the operator is a *variable name* and the portion on the right is a *value* to assign to a variable.
uk: У Python ``=`` (оператор присвоєння) використовується для встановлення значення деякої змінної, частина ліворуч від оператора - це ім'я змінної, а частина праворуч - це значення, яке призначається для неї.

source: Variable assignment in Python
uk: Присвоєння змінної в Python

source: Variable assignment in Java
uk: Присвоєння змінної в Java

source: Naming
uk: Присвоєння назви

source: In Python there are several rules that describe how to name your variables. Some of these are requirements and cannot be ignored, others are rather recommended than required and can be omitted. For now note, that a variable name **cannot**:
uk: У Python є кілька правил, які описують, як іменувати ваші змінні. Деякі з них є вимогами, і їх не можна ігнорувати, інші скоріше рекомендовані, ніж обов'язкові, і їх можна пропустити. Наразі зауважте, що ім'я змінної не може:

source: a language keyword (like ``pass``, ``def`` or ``class``)
uk: бути ключовим словом мови (наприклад, ``pass``, ``def`` або ``class``)

source: start with a number (e.g. ``123``, ``1_something``)
uk: починатися з числа (наприклад, ``123``, ``1_something``)

source: contain special operators in it (``+``, ``-``, ``=`` etc.)
uk: містити спеціальні оператори (``+``, ``-``, ``=`` тощо)

source: contain white spaces
uk: містити пробіли

source: Also here are some general recommendation on naming anything:
uk: Також ось деякі загальні рекомендації щодо іменування будь-чого:

source: do not use built-in functions as a variable name (e.g. ``len = 42``)
uk: не використовуйте вбудовані функції як назву змінної (наприклад, ``len = 42``)

source: keep names meaningful (``x = 10`` vs ``number_of_student = 100``)
uk: зберігайте значення імен (``x = 10`` проти ``number_of_student = 100``)
