Repository: edu-python-course/edu-python-course.github.io
Catalog: src/_locales/*/LC_MESSAGES/appx/pg_func_ops.po
Languages: uk

source: Comparison
uk: Порівняння

source: Comparison predicates
uk: Предикати порівняння

source: Test if a value is within the range endpoints (inclusive)
uk: Перевірка, чи знаходиться значення в межах кінцевих точок діапазону (включно)

source: Not between (the negation of BETWEEN).
uk: Не між (заперечення ПОМІЖ).

source: Between, after sorting the two endpoint values.
uk: Між, після сортування двох кінцевих значень.

source: Not between, after sorting the two endpoint values.
uk: Не між, після сортування двох кінцевих значень.

source: Not equal, treating null as a comparable value.
uk: Не дорівнює, розглядаючи нуль як порівнянне значення.

source: Equal, treating null as a comparable value.
uk: Дорівнює, розглядаючи нуль як порівнянне значення.

source: Test whether value is null.
uk: Перевірити, чи значення рівне нулю.

source: Test whether value is not null.
uk: Перевірити, чи значення не рівне нулю.

source: Test whether value is null (nonstandard syntax).
uk: Перевірити, чи значення рівне нулю (нестандартний синтаксис).

source: Test whether value is not null (nonstandard syntax).
uk: Перевірити, чи значення не є null (нестандартний синтаксис).

source: Test whether boolean expression yields true.
uk: Перевірте, чи дає булевий вираз значення true.

source: Test whether boolean expression yields false or unknown.
uk: Перевірте, чи дає булевий вираз значення false або невідоме.

source: Test whether boolean expression yields false.
uk: Перевірте, чи дає булевий вираз значення false.

source: Test whether boolean expression yields true or unknown.
uk: Перевірте, чи дає булевий вираз значення true або unknown.

source: Test whether boolean expression yields unknown.
uk: Перевірити, чи дає булевий вираз невідоме.

source: Test whether boolean expression yields true or false.
uk: Перевірте, чи дає булевий вираз значення true або false.

source: Comparison functions
uk: Функції порівняння

source: Returns the number of non-null arguments
uk: Повертає кількість ненульових аргументів

source: Returns the number of null arguments
uk: Повертає кількість нульових аргументів

source: Mathematical functions and operators
uk: Математичні функції та оператори

source: Addition
uk: Додавання

source: Unary plus (no operation)
uk: Унарний плюс (без операції)

source: Subtraction
uk: Віднімання

source: Negation
uk: Заперечення

source: Multiplication
uk: Множення

source: Division (for integral types, division truncates the result towards zero)
uk: Ділення (для інтегральних типів ділення усікає результат до нуля)

source: Modulo (remainder); available for smallint, integer, bigint, and numeric
uk: За модулем (залишок); доступний для smallint, integer, bigint та numeric

source: Exponentiation
uk: Піднесення до степеня

source: Unlike typical mathematical practice, multiple uses of ``^`` will associate left to right by default:
uk: На відміну від типової математичної практики, багаторазове використання ``^`` за замовчуванням асоціюється зліва направо:

source: Square root
uk: Квадратний корінь

source: Cube root
uk: Кубічний корінь

source: Absolute value
uk: Абсолютне значення

source: Bitwise AND
uk: Побітове І

source: Bitwise OR
uk: Порозрядне АБО

source: Bitwise exclusive OR
uk: Побітове виключне АБО

source: Bitwise NOT
uk: Побітове НІ

source: Bitwise shift left
uk: Порозрядний зсув вліво

source: Bitwise shift right
uk: Порозрядний зсув вправо
