Repository: edu-python-course/edu-python-course.github.io
Catalog: src/_locales/*/LC_MESSAGES/appx.po
Languages: uk

source: Each ``Genre`` can be associated with multiple ``Books``, and vice-versa. However a ``Book`` might not belong to any genre. This relationship between ``Genre`` and ``Book`` is still considered **many-to-many**, but with the possibility of zero genres for a book.
uk: Кожен ``Жанр`` може бути пов'язаний з декількома ``Книгами``, і навпаки. Однак ``Книга`` може не належати до жодного жанру. Цей зв'язок між ``Жанром`` і ``Книгою`` все ще вважається **багато-до-багатьох**, але з можливістю нульових жанрів для книги.

source: Book to borrow request
uk: Книга до запиту на позику

source: Each ``Book`` can be associated with multiple ``BorrowRequests``, but each ``BorrowRequest`` refers only one ``book``, forming a **many-to-one** relationship.
uk: Кожна ``Книга`` може бути пов'язана з декількома ``Запитами на позику``, але кожен ``Запит на позику`` посилається тільки на одну ``Книгу``, утворюючи зв'язок **багато-до-одного**.

source: User to borrow request
uk: Користувач до запиту на позику

source: Each ``User`` can make multiple ``BorrowRequests``, but each ``BorrowRequest`` refers to only one book, forming a **many-to-one** relationship.
uk: Кожен ``Користувач`` може зробити кілька ``Запитів на позику``, але кожен ``Запит на позику`` відноситься тільки до однієї книги, формуючи зв'язок ``багато до однієї``.

source: User to book (as a borrower)
uk: Користувач до книги (як запозичувач)

source: A ``Book`` may have been borrowed by a ``User``, but at any given time, each ``Book`` can be borrowed by one user only. This forms a **one-to-one** relationship.
uk: Книга" може бути позичена "Користувачем", але в будь-який момент часу кожна "Книга" може бути позичена тільки одним користувачем. Це формує відносини "один до одного".

source: Views and templates
uk: Подання та шаблони

source: Admin site
uk: Адмін-сайт

source: Admin site provides the full control over the entire system. Only admins are permitted to use admin site. Librarians should use their dedicated views to perform operations, except special cases.
uk: Адмін-сайт забезпечує повний контроль над всією системою. Тільки адміністратори мають право користуватися сайтом адміністратора. Бібліотекарі повинні використовувати свої виділені подання для виконання операцій, за винятком особливих випадків.

source: Authentication
uk: Автентифікація

source: Login
uk: Логін

source: A form with fields for entering a username and a password, and a submit button.
uk: Форма з полями для введення імені користувача та пароля, а також кнопкою "Надіслати".

source: Validate entered credentials and authenticate the user. In case of incorrect credentials, display an error message.
uk: Перевірити введені облікові дані та автентифікувати користувача. У разі неправильних облікових даних вивести повідомлення про помилку.

source: Registration
uk: Реєстрація

source: A form for new user registration. **Required** fields are:
uk: Форма для реєстрації нового користувача. **Обов'язковими** полями є:

source: Upon submission, the view should validate the provided data:
uk: Після відправлення, перегляд повинен підтвердити надані дані:

source: Check if username is already taken.
uk: Перевірте, чи не зайнято вже ім'я користувача.

source: Ensure that password and confirm password fields match.
uk: Переконайтеся, що поля "Пароль" і "Підтвердження пароля" збігаються.

source: Save the user's data if all validations pass. Otherwise, display appropriate error messages.
uk: Зберегти дані користувача, якщо всі перевірки пройдено. В іншому випадку, відобразити відповідні повідомлення про помилки.

source: When saving passwords in the database, always store them in a hashed format, never in plain text.
uk: Зберігаючи паролі в базі даних, завжди зберігайте їх у хешованому форматі, а не у вигляді простого тексту.

source: Django's built-in ``User`` model and authentication system handle password hashing by default, which is a big plus.
uk: Вбудована в Django модель ``User`` та система автентифікації за замовчуванням обробляє хешування паролів, що є великим плюсом.

source: Borrowing History
uk: Історія запозичень

source: This view is available only for authenticated users.
uk: Це подання доступне лише для авторизованих користувачів.

source: Users can see the list of **all** their borrows requests, regardless of approve/decline status.
uk: Користувачі можуть бачити список **всіх** своїх заявок на позики, незалежно від статусу схвалення/відхилення.

source: Authenticated users can see only their own borrow requests.
uk: Авторизовані користувачі можуть бачити лише власні заявки на позики.

source: Librarians and admins can access borrows requests list for any user, registered in the library system.
uk: Бібліотекарі та адміністратори мають доступ до списку запитів на позики для будь-якого користувача, зареєстрованого в бібліотечній системі.

source: Library collection
uk: Бібліотечний фонд

source: These views are generally available for all (including anonymous) users. The functionality for authenticated users include books borrowing.
uk: Ці перегляди загалом доступні для всіх (в тому числі анонімних) користувачів. Функціонал для аутентифікованих користувачів включає в себе можливість позичати книги.

source: Books list
uk: Список літератури

source: A list (or table) of books. Each book entry should provide information:
uk: Список (або таблиця) книг. Кожна позиція повинна містити інформацію про книгу:

source: author(s)
uk: автор(и)

source: summary (truncated if too long, 30 words or fewer)
uk: опис (скорочене, якщо занадто довге, до 30 слів або менше)

source: availability status (either **Available** or **Unavailable**)
uk: статус доступності (**Доступний** або **Не доступний**)

source: Querying the data
uk: Запит даних

source: Fetch **all** books from the database
uk: Отримати **усі** книги з бази даних

source: Checking availability status (visual mark)
uk: Перевірка статусу доступності (візуальна позначка)

source: For each book, determine its availability status. Check ``Book.available`` flag.
uk: Для кожної книги визначте її статус доступності. Встановіть прапорець ``Book.available``.

source: A user can still create a borrowing request, regardless of the book availability status. This is only the visual mark.
uk: Користувач все одно може створити запит на позику, незалежно від статусу доступності книги. Це лише візуальна позначка.

source: Detail view
uk: Детальний перегляд

source: The detailed view of a specific book, presenting comprehensive information:
uk: Детальний огляд конкретної книги, що містить вичерпну інформацію:

source: **Title**: Display the book's title prominently.
uk: **Назва**: Покажіть назву книги на видному місці.

source: **Genre(s)**: List all associated genres (if any).
uk: **Жанр(и)**: Перелічіть усі пов'язані жанри (якщо такі є).

source: **Author(s)**: List all associated authors.
uk: **Автор(и)**: Перерахуйте всіх асоційованих авторів.

source: **ISBN**: The International Standard Book Number.
uk: **ISBN**: Міжнародний стандартний номер книги.

source: **Published Date**: When the book was published.
uk: **Дата публікації**: Коли вийшла друком книга.

source: **Publisher**: The name of the entity or company responsible for publishing
uk: **Видавець**: Назва організації або компанії, відповідальної за публікацію

source: **Summary**: A full summary or description of the book. the book.
uk: **Коротка анотація**: Повне резюме або опис книги. книги.

source: **Action Buttons** (For authenticated users only):
uk: **Кнопки дій** (Тільки для авторизованих користувачів):

source: **Borrow Request Button**: If the user has no associated borrow request they can create a new one.
uk: **Кнопка запиту на позику**: Якщо користувач не має пов'язаного запиту на позику, він може створити новий.

source: **Gather Book Button**: If the user's borrow request for this book has been approved, allow the user to confirm they've picked up the book.
uk: **Кнопка Забрати книгу**: Якщо запит користувача на позику цієї книги було схвалено, дозвольте користувачеві підтвердити, що він забрав книгу.

source: **Fetching Book Details**:
uk: **Доступ до деталей книги**:

source: Use the book's identifier (usually a primary key) to fetch its details from the database.
uk: Використовуйте ідентифікатор книги (зазвичай первинний ключ), щоб отримати інформацію про неї з бази даних.

source: **Checking User Authentication**:
uk: **Перевірка автентичності користувача**:

source: Determine if a user is authenticated. If they are, display the appropriate action buttons based on the book's availability status and any existing borrow requests by the user.
uk: Визначити, чи користувач автентифікований. Якщо так, відобразити відповідні кнопки дій на основі статусу доступності книги та наявних запитів користувача на позику.

source: **Handling Borrow Requests**:
uk: **Обробка запитів на позику**:

source: If an authenticated user clicks on the "Borrow Request" button:
uk: Якщо авторизований користувач натискає кнопку "Запит на позику":

source: Create a new borrow request in the ``BorrowRequest`` model with status "pending".
uk: Створіть новий запит на позику в моделі ``BorrowRequest`` зі статусом "на розгляді".

source: Update the book's status to "Awaiting approval".
uk: Оновіть статус книги на "Очікує затвердження".

source: Redirect the user to a confirmation page or display a message indicating the request has been made.
uk: Перенаправлення користувача на сторінку підтвердження або відображення повідомлення про те, що запит було зроблено.

source: **Handling Book Gathering**:
uk: **Опрацювання Позики Книги**:

source: If an authenticated user has an approved borrow request and clicks the "Gather Book" button:
uk: Якщо авторизований користувач має схвалений запит на позику і натискає кнопку "Зібрати книгу":

source: Update the book's status to "Borrowed".
uk: Оновіть статус книги на "Позичена".

source: Update the borrow request's status to "complete".
uk: Оновіть статус запиту на позику до "завершено".

source: Redirect the user to a confirmation page or display a message indicating they've picked up the book.
uk: Перенаправляйте користувача на сторінку підтвердження або показуйте повідомлення про те, що він забрав книгу.

source: Always ensure the user's actions are authenticated and authorized. This prevents unauthorized borrow requests or gathering of books. Also, consider adding error handling to manage cases where the book's details cannot be fetched or any other unexpected issues.
uk: Завжди переконуйтеся, що дії користувача автентифіковані та санкціоновані. Це запобігає несанкціонованим запитам на позику або збору книг. Також подумайте про те, щоб додати обробку помилок для випадків, коли не вдається отримати дані про книгу, або будь-яких інших непередбачуваних проблем.

source: Books management
uk: Управління книгами

source: These views are available only for staff (librarians and admins).
uk: Ці перегляди доступні лише для персоналу (бібліотекарів та адміністраторів).

source: Authors and genres management
uk: Управління авторами та жанрами

source: Only librarians and admins can add, modify or delete authors and genres. No additional views for CRUD operations required (except admin site). Librarians are allowed to access authors and genres via admin site. Only admins can remove authors or genres.
uk: Тільки бібліотекарі та адміністратори можуть додавати, змінювати або видаляти авторів і жанри. Для виконання CRUD-операцій не потрібні додаткові перегляди (окрім адмін-сайту). Бібліотекарі мають доступ до авторів і жанрів через сайт адміністратора. Тільки адміністратори можуть видаляти авторів або жанри.

source: Book creation and update
uk: Створення та оновлення книг

source: The template should comprise a form with fields corresponding to the book's attributes. Here are the essential elements for the form:
uk: Шаблон повинен містити форму з полями, що відповідають атрибутам книги. Ось основні елементи форми:

source: A text input field.
uk: Поле для введення тексту.

source: A textarea for a brief description or synopsis.
uk: Текстова область для короткого опису або синопсису.

source: A text input field for the book's International Standard Book Number.
uk: Поле для введення міжнародного стандартного номера книги.

source: A checkbox indicating if a book is available. Defaults to ``True``.
uk: Прапорець, що вказує на наявність книги. За замовчуванням стоїть ``True``.

source: A date input field.
uk: Поле для введення дати.

source: Genres
uk: Жанри

source: A multi-select list of genres (e.g. dropdown, checkboxes etc.). This should fetch available genres from the database and allow users to select zero or more genres.
uk: Список жанрів з можливістю вибору (наприклад, випадаючий список, прапорці тощо). Він повинен отримувати доступні жанри з бази даних і дозволяти користувачам вибирати нуль або більше жанрів.

source: Authors
uk: Автори

source: A multi-select list of authors (e.g. dropdown, checkboxes etc.). This should fetch available authors from the database and allow users to select one or more authors.
uk: Список авторів з можливістю вибору (наприклад, випадаючий список, прапорці тощо). Він повинен отримувати доступних авторів з бази даних і дозволяти користувачам вибирати одного або декількох авторів.

source: If it's an *update* action, pre-populate the form fields with the existing details of the book fetched from the database.
uk: Якщо це дія *оновлення*, попередньо заповніть поля форми існуючими даними книги, отриманими з бази даних.

source: For *creation*, provide an empty form for the librarian to fill in.
uk: Для *створення* надайте бібліотекарю порожню форму для заповнення.

source: Ensure the published date is logical (e.g. not a future date).
uk: Переконайтеся, що опублікована дата є логічною (наприклад, не є датою майбутнього).

source: Validate required inputs, according to general ``Book`` model rules.
uk: Перевірити необхідні вхідні дані відповідно до загальних правил моделі ``Book``.

source: If validations pass: save changes to the database; otherwise, provide helpful error messages.
uk: Якщо перевірка пройшла успішно: збережіть зміни в базі даних; в іншому випадку надайте корисні повідомлення про помилки.

source: You MAY provide a mechanism (like modal or a quick entry form) to add a new genre or author without leaving the book form page.
uk: Ви МОЖЕТЕ надати механізм (наприклад, модальну форму або форму швидкого введення) для додавання нового жанру або автора, не виходячи зі сторінки форми книги.

source: Book deletion
uk: Видалення книги

source: Only librarians and administrators are permitted to perform this action.
uk: Тільки бібліотекарі та адміністратори мають право виконувати цю дію.

source: A confirm delete form with **Submit** and **Cancel** buttons.
uk: Форма підтвердження видалення з кнопками **Подати** та **Скасувати**.

source: Authorize user before deleting performing deletion.
uk: Авторизуйте користувача перед виконанням видалення.

source: If a form is submitted, a book should be removed from the library collection.
uk: Якщо формуляр подано, книга має бути вилучена з бібліотечної колекції.

source: If deletion is canceled view should redirect back to book detail view page.
uk: Якщо видалення скасовано, перегляд має бути перенаправлений назад на сторінку детального перегляду книги.

source: Borrow requests
uk: Запити на позики

source: This view facilitates the management of borrowing requests for librarians and admins, aiding in their prompt handling.
uk: Цей перегляд полегшує бібліотекарям і адміністраторам управління запитами на позики, допомагаючи оперативно їх обробляти.

source: Present a table showcasing the list of borrow requests. Each row embodies a borrow request and encompasses:
uk: Уявіть таблицю, що відображає список запитів на позики. Кожен рядок відображає один запит на позику і включає в себе всі запити:

source: **Book Title**: Title of the requested book.
uk: **Назва книги**: Назва запитуваної книги.

source: **User**: Identifier of the user who initiated the request.
uk: **Користувач**: Ідентифікатор користувача, який ініціював запит.

source: **Request Date**: Date of the request's inception.
uk: **Дата запиту**: Дата створення запиту.

source: **Due Date**: - Input field for librarians to set upon approval for new requests. - For approved ones, display the librarian-set date.
uk: **Дата виконання**: - Поле для введення бібліотекарями при затвердженні нових запитів. - Для затверджених запитів відображатиметься дата, встановлена бібліотекарем.

source: **Status**: Present state of the request (New, Approved, Completed, Declined).
uk: **Статус**: Поточний стан запиту (Новий, Затверджений, Завершений, Відхилений).

source: **Approve Button**: Visible for new requests. Toggles status to "Approved" and freezes the due date.
uk: **Кнопка "Затвердити"**: Відображається для нових запитів. Перемикає статус на "Затверджено" і заморожує дату виконання.

source: **Decline Button**: Appears for new requests. Sets status to "Declined" and can prompt for a decline reason.
uk: **Кнопка "Відхилити"**: З'являється для нових запитів. Встановлює статус "Відхилено" і може запитувати причину відхилення.

source: **Complete Button**: Displayed for approved requests. Marks the request as completed.
uk: **Кнопка "Завершити"**: Відображається для затверджених запитів. Позначає запит як завершений.

source: **Approve Borrow Request**: - Validate book availability. - Modify book status to "Borrowed". - Switch borrow request to "Approved". - Define the return due date as per librarian. - Inform the user about the approval and due date.
uk: **Схвалити запит на позику**: - Підтвердити наявність книги. - Змінити статус книги на "Позичена". - Переключіть запит на позику на "Затверджено". - Визначте дату повернення відповідно до побажань бібліотекаря. - Повідомте користувача про схвалення та дату повернення.

source: **Decline Borrow Request**: - Change borrow request status to "Declined". - Optionally, procure decline reason from librarian. - Notify user regarding the declination.
uk: **Відхилити запит на позику**: - Змінити статус запиту на "Відхилено". - За бажанням, запитайте причину відмови у бібліотекаря. - Повідомте користувача про відхилення.

source: **Complete Borrow Request**: - Ensure book's return. - Update book status to "Available". - Toggle borrow request status to "Completed". - If needed, record any notes or damages during return.
uk: **Завершити запит на позику**: - Переконайтеся, що книга повернулася. - Оновити статус книги до "Доступна". - Змінити статус запиту на "Виконано". - Якщо потрібно, запишіть будь-які примітки або пошкодження під час повернення.

source: Implementing reminders for near-due borrow requests can function as an alert system for both the librarian and the user.
uk: Впровадження нагадувань про прострочені запити може функціонувати як система оповіщення як для бібліотекаря, так і для користувача.

source: Operator precedence in Python
uk: Пріоритет операторів в Python

source: Operator Precedence
uk: Пріоритет Операторів

source: The following table summarizes the operator precedence in Python, from highest precedence (most binding) to lowest precedence (least binding) :cite:`docs-python:operator-precedence`. Operators in the same cell have the same precedence (use left-to-right precedence).
uk: У наведеній нижче таблиці підсумовано пріоритет операторів у Python від найвищого пріоритету (найбільш обов'язковий) до найнижчого пріоритету (найменший обов'язковий) :cite:`docs-python:operator-precedence`. Оператори в одній клітинці мають однаковий пріоритет (використовуйте пріоритет зліва направо).

source: Operator
uk: Оператор

source: Description
uk: Опис

source: Binding or parenthesized expression, list display, dictionary display, set display
uk: Прив'язка або вираз у дужках, відображення списку, відображення словника, відображення набору

source: Subscription, slicing, call, attribute reference
uk: Підписка, нарізка, виклик, посилання на атрибути

source: Await expression
uk: Вираз Await

source: Exponentiation [#]_
uk: Піднесення до степеня [#]_

source: Positive, negative, bitwise NOT
uk: Позитивне, негативне, побітове НІ

source: Multiplication, matrix multiplication, division, floor division, remainder [#]_
uk: Множення, матричне множення, ділення, поверхове ділення, залишок [#]_

source: Addition and subtraction
uk: Додавання і віднімання

source: Shifts
uk: Зсуви

source: Bitwise AND
uk: Побітове І

source: Bitwise XOR
uk: Побітове XOR

source: Bitwise OR
uk: Порозрядне АБО

source: Comparisons, including membership tests and identity tests
uk: Порівняння, включаючи тести на приналежність і тести на ідентифікацію

source: Boolean NOT
uk: Логічне НІ

source: Boolean AND
uk: Логічне І

source: Boolean OR
uk: Логічне АБО

source: Conditional expression (ternary ``if``)
uk: Умовний вираз (трійковий ``if``)

source: Lambda expression
uk: Lambda вирази

source: Assignment expression
uk: Оперетор присвоєння

source: the power operator binds less tightly than an arithmetic or bitwise unary operator on its right (``2 ** -1`` is ``0.5``).
uk: оператор степені прив'язує менш тісно, ніж арифметичний або порозрядний унарний оператор праворуч (``2 ** -1`` це ``0,5``).

source: the ``%`` operator is also used for string formatting; the same precedence applies.
uk: оператор ``%`` також використовується для форматування рядків; застосовується той самий пріоритет.

source: Formatted strings usage in Python
uk: Використання форматованих рядків в Python

source: ``printf-style`` String Formatting
uk: ``printf-style`` Форматування рядків

source: String objects have one unique built-in operation: the ``%`` operator (modulo). This is also known as the string *formatting* or *interpolation* operator :cite:`docs-python:printf-formatting`. Given ``format % values`` (where *format* is a string), ``%`` conversion specifications in *format* are replaced with zero or more elements of *values*. If *format* requires a single argument, *values* may be a single non-tuple object.
uk: Рядкові об'єкти мають одну унікальну вбудовану операцію: оператор ``%`` (по модулю). Це також відоме як оператор *форматування* рядка або *інтерполяції* :cite:`docs-python:printf-formatting`. Враховуючи ``формат % значень`` (де *format* є рядком), ``%`` специфікації перетворення у *format* замінюються нулем або більше елементами *значень*. Якщо для *format* потрібен один аргумент, *values* може бути одним некортежним об'єктом.

source: The conversion flag characters are:
uk: Символи перетворення:

source: Flag
uk: Символ

source: Meaning
uk: Значення

source: The value conversion will use the "alternative form"
uk: Перетворення значень використовуватиме "альтернативну форму"

source: The conversion will be zero padded for numeric values
uk: Перетворення буде доповнено нулем для числових значень

source: The converted value is left adjusted (override the ``'0'`` if both are given)
uk: Перетворене значення коригується зліва (замініть ``'0'``, якщо надано обидва)

source: (a space) A blank should be left before a positive number
uk: (пробіл) Перед додатним числом слід залишити пробіл

source: A sign character (``'+'`` or ``'-'``) will precede the conversion (overrides a "space" flag)
uk: Символ знака (``'+'`` або ``'-'``) передуватиме перетворенню (перевизначає прапор "пробіл")

source: The conversion types are:
uk: Типи перетворення:

source: Conversion
uk: Перетворення

source: Signed integer decimal
uk: Ціле десяткове число зі знаком

source: Signed octal value
uk: Вісімкове значення зі знаком

source: Obsolete type - it is identical to ``'d'``
uk: Застарілий тип - ідентичний ``'d``

source: Signed hexadecimal (lowercase)
uk: Шістнадцяткове число зі знаком (маленький регістр)

source: Signed hexadecimal (uppercase)
uk: Шістнадцяткове число зі знаком (верхній регістр)
