Repository: edu-python-course/edu-python-course.github.io
Catalog: src/_locales/*/LC_MESSAGES/appx.po
Languages: uk

source: How-to handle in assignments via GitHub pull request(s)
uk: Як працювати з призначеннями через GitHub pull request(и)

source: Handing in Homework Assignments
uk: Здача домашніх завдань

source: Repository content description
uk: Опис вмісту репозиторію

source: What to include
uk: Що потрібно включити

source: Code base
uk: Кодова база

source: Project dependencies (if applicable)
uk: Залежності проекту (якщо застосовно)

source: *(Optional)* Additional project information: README, CONTRIBUTING, LICENSE etc.
uk: *(Додаткова)* інформація про проєкт: README, CONTRIBUTING, LICENSE тощо.

source: Always start new repository from creating ``README`` and ``.gitignore`` files.
uk: Завжди починайте новий репозиторій зі створення файлів ``README`` та ``.gitignore``.

source: What to exclude
uk: Що потрібно виключити

source: Virtual environment, typically ``venv`` or ``env`` folder
uk: Віртуальне середовище, зазвичай папка ``venv`` або ``env``

source: Byte compiled Python code (``__pycache__``)
uk: Байтовий скомпільований код Python (``__pycache__``)

source: IDE configurations, typically ``.vscode`` or ``.idea`` folder
uk: Конфігурації IDE, зазвичай папка ``.vscode`` або ``.idea``

source: Database files, like ``db.sqlite3``
uk: Файли баз даних, такі як ``db.sqlite3``

source: Other stuff not related to the assignment directly
uk: Інші речі, не пов'язані з завданням безпосередньо

source: Set up **.gitignore** to exclude all name patterns from appending to the stage area. Common content of this file may look like:
uk: Налаштуйте **.gitignore**, щоб виключити всі шаблони назв з додавання до області сцени. Типовий вміст цього файлу може виглядати так:

source: Repository initialization
uk: Ініціалізація репозиторію

source: Create and activate virtual environment.
uk: Створіть та активуйте віртуальне середовище.

source: Create common repository files:
uk: Створіть загальні файли репозиторію:

source: requirements.txt *(if applicable)*
uk: requirements.txt *(якщо застосовно)*

source: *(Optional)* Create a code base draft. This can be an empty module like **main.py** or an empty :ref:`Django project <django_init>`.
uk: *(Додатково)* Створіть чорновий варіант кодової бази. Це може бути порожній модуль типу **main.py** або порожній :ref:`проект Django <django_init>`.

source: Initialize a new repository using ``git init`` command.
uk: Ініціалізуйте новий репозиторій за допомогою команди ``git init``.

source: Set up **.gitignore** name patterns.
uk: Налаштуйте шаблони імен **.gitignore**.

source: Stage your changes.
uk: Додайте зміни до stage-простору.

source: Commit your changes.
uk: Зафіксуйте зміни.

source: Set up remote repository.
uk: Налаштуйте віддалений репозиторій.

source: Push changes from local branch to remote.
uk: Перенесіть зміни з локальної гілки на віддалену.

source: Initializing new Django project
uk: Ініціалізація нового проекту Django

source: Base Django project may be added to the repository with the first commit. Initialize Django project in current repository root to avoid directories nesting.
uk: Базовий проект Django може бути доданий до сховища з першим коммітом. Ініціалізуйте проект Django у корені поточного сховища, щоб уникнути вкладеності каталогів.

source: Do not forget to create **requirements.txt**.
uk: Не забудьте створити **requirements.txt**.

source: After that, you may proceed with "staging" and "commit" steps.
uk: Після цього ви можете перейти до етапів "stage" та "commit".

source: Sharing project dependencies
uk: Спільний доступ до залежностей проекту

source: The **requirements.txt** file is a plain text file that lists all the Python packages required for a specific project. This file is used to specify dependencies in a version-controlled and easily shareable manner. It allows for a consistent environment across different team members' local setups.
uk: Файл **requirements.txt** -- це звичайний текстовий файл, який містить список усіх пакунків Python, необхідних для конкретного проекту. Цей файл використовується для вказівки залежностей у спосіб, що дозволяє контролювати версії та легко ділитися ними. Це дозволяє забезпечити узгодженість середовища в локальних налаштуваннях різних членів команди.

source: Where to place "requirements.txt" file
uk: Де розмістити файл "requirements.txt"

source: The **requirements.txt** file is generally placed in the root directory of the project.
uk: Файл **requirements.txt** зазвичай розміщується у кореневому каталозі проекту.

source: Creating "requirements.txt" file
uk: Створення файлу "requirements.txt"

source: To generate file use ``pip freeze`` command and place its output to a file:
uk: Щоб згенерувати файл, скористайтеся командою ``pip freeze`` і помістіть його вивід у файл:

source: This will create **requirements.txt** file. Its content may look like:
uk: В результаті буде створено файл **requirements.txt**. Його вміст може мати вигляд:

source: Installing dependencies from "requirements.txt" file
uk: Встановлення залежностей з файлу "requirements.txt"

source: Another team member may easily install all the requirements for the project by using ``pip install`` command:
uk: Інший член команди може легко встановити всі вимоги до проекту за допомогою команди ``pip install``:

source: Dealing with home tasks (challenges)
uk: Вирішення домашніх завдань (викликів)

source: Create a new topic branch
uk: Створити нову гілку завдання

source: Switch to a topic branch
uk: Перейдіть до гілки завдання

source: Do the work and commit changes
uk: Виконайте роботу та зафіксуйте зміни

source: You can create a new branch and immediately switch to it:
uk: Ви можете створити нову гілку і одразу перейти до неї:

source: Creating a pull request
uk: Створення запиту на злиття

source: Make sure your working branch is up-to-date with the default one. You can pull changes for the default branch and rebase your feature branch onto it.
uk: Переконайтеся, що ваша робоча гілка оновлена ​​до стандартної. Ви можете отримати зміни для гілки за замовчуванням і перебазувати свою гілку функції на неї.

source: Push feature branch to the remote repository. By default, the current active branch is pushed via ``git push`` command. You may need to set upstream branch if it isn't yet.
uk: Перенести гілку функції до віддаленого сховища. За замовчуванням, поточна активна гілка виштовхується командою ``git push``. Можливо, вам доведеться створити нову гілку, якщо вона ще не створена.

source: Navigate to your remote repository homepage on GitHub and switch to **Pull requests** tab.
uk: Перейдіть на головну сторінку вашого віддаленого сховища на GitHub і перейдіть на вкладку **Pull requests**.

source: Click **New pull request** button.
uk: Натисніть кнопку **New pull request**.

source: Select your default branch as *target* and your feature branch as *source*.
uk: Виберіть гілку за умовчанням як *ціль*, а робочу гілку як *джерело*.

source: Click **Create pull request** button.
uk: Натисніть кнопку **Create pull request**.

source: Provide meaningful title and a brief description for your pull request.
uk: Надайте змістовну назву та короткий опис вашого запиту.

source: Submit pull request creation.
uk: Підтвердіть створення запиту.

source: *(Optional)* Select reviewer(s) in **Reviewers** section.
uk: *(Необов'язково)* Виберіть рецензента(ів) у розділі **Reviewers**.

source: Wait until your pull request is reviewed.
uk: Зачекайте, поки ваш запит буде розглянуто.

source: Set up reviewers
uk: Налаштування рецензентів

source: You may share a link to pull request to a reviewer directly, but it's better to set reviewer(s) on the pull request's page. Before you can select reviewers, you need to add them as project contributors.
uk: Ви можете надіслати посилання на запит безпосередньо рецензенту, але краще вказати рецензента(ів) на сторінці запиту. Перш ніж ви зможете вибрати рецензентів, вам потрібно додати їх як учасників проекту.

source: Append collaborators
uk: Додавання співавторів

source: Reviews allow collaborators to comment on the changes proposed in pull requests, approve the changes, or request further changes before the pull request is merged. Repository administrators can require that pull requests are approved before being merged.
uk: Рецензії дозволяють учасникам коментувати зміни, запропоновані у запитах, затверджувати їх або вимагати подальших змін до того, як запит буде об'єднано. Адміністратори сховища можуть вимагати, щоб запити на вилучення були затверджені перед об'єднанням.

source: Navigate to your repository homepage on GitHub and switch to **Settings** tab.
uk: Перейдіть на головну сторінку вашого сховища на GitHub і перейдіть на вкладку **Налаштування**.

source: Select **Collaborators and teams** menu item.
uk: Виберіть пункт меню **Collaborators and teams**.

source: Under **Manage access** section click **Add people** button.
uk: У розділі **Manage access** натисніть кнопку ``Add people``.

source: In modal window start typing GitHub username.
uk: У модальному вікні почніть вводити ім'я користувача GitHub.

source: Select a contributor from the dropdown menu.
uk: Виберіть учасника зі спадного меню.

source: This will send a *contributing request* to a specified user.
uk: Це надішле *запит* вказаному користувачеві.

source: Merging changes
uk: Об'єднання змін

source: In case your pull request is **approved** - merge it to the trunk branch. Select one of the options available:
uk: Якщо ваш pull request буде **схвалено** - об'єднайте його в основну гілку. Виберіть один з доступних варіантів:

source: **Create a merge commit** suits in most of the cases.
uk: **Create a merge commit** підходить у більшості випадків.

source: Making changes
uk: Внесення змін

source: In case your pull request is **rejected** or has comments - you may need to provide some fixes.
uk: Якщо ваш pull request буде **відхилено** або він матиме зауваження - вам може знадобитися надати деякі виправлення.

source: Do the work in your local topic branch
uk: Виконайте роботу у вашій місцевій тематичній гілці

source: Push these changes to remote
uk: Надішліть їх до гілки віддаленого репозиторію

source: Re-request review (if applicable)
uk: Зробіть повторний запит на перегляд (за необхідності)

source: Wait until review is done
uk: Дочекайтеся завершення перевірки

source: Blog Project Specification
uk: Специфікація Проекту Блогу

source: The project aims to develop a robust and user-friendly web application using the Django framework. The primary objective is to create a blogging platform that allows users to publish and manage articles on various topics. The application will provide an intuitive interface for authors to compose and format their articles, while also offering a seamless reading experience for visitors.
uk: Проект має на меті розробку міцного та зручного у використанні веб-додатка за допомогою фреймворку Django. Основна мета полягає у створенні платформи для блогів, яка дозволить користувачам публікувати та керувати статтями на різні теми. Додаток надасть інтуїтивний інтерфейс авторам для створення та форматування своїх статей, а також забезпечить безперешкодний досвід читання для відвідувачів.

source: **Key Features**
uk: **Основні функції**

source: User Registration and Authentication
uk: Реєстрація та Аутентифікація Користувачів

source: The application will provide user registration and authentication functionality, allowing individuals to create accounts, log in, and manage their profile information. This feature will enable authors to have personalized accounts and maintain ownership of their published articles.
uk: Застосунок надасть функціональність реєстрації та аутентифікації користувачів, дозволяючи індивідуумам створювати облікові записи, входити в систему та керувати інформацією свого профілю. Ця функція дозволить авторам мати персоналізовані облікові записи та зберігати право власності на їхні опубліковані статті.

source: Article Management
uk: Керування Статтями

source: Authors will have the ability to create, edit, and delete articles within the application. The system will offer a user-friendly editor. Additionally, authors will be able to categorize articles by assigning relevant topics to them.
uk: Автори матимуть можливість створювати, редагувати та видаляти статті в рамках додатка. Система надасть зручний редактор. Крім того, автори зможуть категоризувати статті, присвоюючи їм відповідні теми.

source: Topic Subscription:
uk: Підписка на Теми:

source: The application will include a subscription feature that allows users to subscribe to topics of interest. By subscribing to specific topics, users will receive notifications or updates whenever new articles are published in those categories. This feature will enhance user engagement and ensure that readers stay informed about the topics they find most valuable.
uk: Автори матимуть можливість створювати, редагувати та видаляти статті в рамках додатка. Система надасть зручний редактор. Крім того, автори зможуть категоризувати статті, присвоюючи їм відповідні теми.

source: Overall, the project aims to deliver an efficient blogging platform that caters to both authors and readers. By providing a seamless user experience and incorporating essential functionalities such as user authentication, article management, and topic subscriptions, the application will empower users to create, share, and explore engaging content within a well-structured and organized platform.
uk: Застосунок буде містити функцію підписки, яка дозволить користувачам підписуватися на цікаві їм теми. Підписавшись на конкретні теми, користувачі отримуватимуть повідомлення або оновлення кожного разу, коли в цих категоріях будуть публікуватися нові статті. Ця функція покращить залученість користувачів та забезпечить, що читачі будуть інформовані про найцікавіші для них теми.

source: Here is a starter repository template, that may helps: `Starter template`_.
uk: Ось шаблон стартового репозиторію, який може допомогти: `Starter template`_.

source: Challenge: Functional views
uk: Виклик: Функціональні представлення

source: It's ok not to return **actual** content for now. Just ensure all the routes are available and provide correct data. Use anything you like to return within HTTP response.
uk: Зараз немає потреби повертати **фактичний** вміст. Просто переконайтеся, що всі маршрути доступні та надають правильні дані. Використовуйте будь-що, що ви хочете повернути в HTTP-відповіді.

source: ``/about/``: Provides a regular text for a user, describing the functionalities of the django site.
uk: ``/about/``: надає звичайний текст для користувача, що описує функції сайту django.

source: ``/``: A site's homepage. This will contain a list of blogs published via the django site.
uk: ``/``: Головна сторінка сайту. Тут буде перелік блогів, опублікованих через сайт Django.

source: ``/<article>/``: A single article detail view. The URL contains dynamic part in it. This will be used to fetch a single article from the database.
uk: ``/<article>/``: Представлення деталей однієї статті. URL містить динамічну частину. Вона буде використовуватися для отримання однієї статті з бази даних.

source: ``/<article>/comment/``: This view will be used to add comments to a article.
uk: ``/<article>/comment/``: Це представлення буде використовуватися для додавання коментарів до статті.

source: ``/create/``: A article creation form.
uk: ``/create/``: Форма створення статті.

source: ``/<article>/update/``: A view to update an existing article data.
uk: ``/<article>/update/``: Представлення для оновлення існуючих даних статті.

source: ``/<article>/delete/``: A view to confirm article deletion.
uk: ``/<article>/delete/``: Представлення для підтвердження видалення статті.

source: ``/topics/``: A list of topics available on the site.
uk: ``/topics/``: Перелік доступних тем на сайті.

source: ``/topics/<topic>/subscribe/``: A view to subscribe for a topic.
uk: ``/topics/<topic>/subscribe/``: Представлення для підписки на тему.

source: ``/topics/<topic>/unsubscribe/``: A view to unsubscribe from a topic.
uk: ``/topics/<topic>/unsubscribe/``: Представлення для відписки від теми.

source: ``/profile/<str:username>/``: A site user's personal page.
uk: ``/profile/<str:username>/``: Особиста сторінка користувача сайту.

source: ``/set-password/``: This route will be used to change users' credential data.
uk: ``/set-password/``: Цей маршрут буде використовуватися для зміни облікових даних користувачів.

source: ``/set-userdata/``: This route will be user to change users' data.
uk: ``/set-userdata/``: Цей маршрут буде використовуватися для зміни даних користувачів.

source: ``/deactivate/``: Account deactivation (deletion) view.
uk: ``/deactivate/``: Представлення для деактивації облікового запису (видалення).

source: ``/register/``: This view contains a user registration form.
uk: ``/register/``: Сторінка з формою для реєстрації нового користувача.

source: ``/login/``: This view contains a login form.
uk: ``/login/``: Сторінка з формою для логіна.

source: ``/logout/``: Logout page. This view should redirect user back to homepage.
uk: ``/logout/``: Логаут. Має перенаправляти користувача назад на домашню сторінку..

source: Optional task(s)
uk: Додаткові завдання

source: ``/archive/<int:year>/<int:month>/``: This view provides a list of articles published on a specified month of a specified year. This view should apply date validation and raise ``Http404`` for invalid paths. The valid date is a year's 4-digits form followed by 1 or 2 digits representing month. Month range should be limited as [1..12], leading zero may be omitted. Valid URLs are:
uk: ``/archive/<int:year>/<int:month>/``: Це представлення надає список статей, опублікованих у певному місяці певного року. Це представлення повинно застосовувати перевірку дати та викидати помилку ``Http404`` для неприпустимих шляхів. Припустимою датою є 4-значний формат року, за яким слідує 1 або 2 цифри, що представляють місяць. Діапазон місяця повинен бути обмежений [1..12], ведучий нуль може бути пропущений. Приклади правильних URL-адрес:

source: Challenge: Data models
uk: Завдання: моделі даних

source: Django admin may be used to create some dummy data. To gather access to admin section you need to create a superuser. The easiest way to do that is to use a django command:
uk: Для створення деяких фіктивних даних можна використовувати Django Admin. Щоб отримати доступ до адміністративного розділу, вам потрібно створити суперкористувача. Найпростіший спосіб зробити це - використовувати команду Django:

source: General
uk: Основне

source: Each model will be registered for admin site.
uk: Кожна модель буде зареєстрована на сторінці адміністрації сайту.

source: Article topic
uk: Тема статті

source: This is a simple model, that contains information about topic:
uk: Ось проста модель, що містить інформацію про тему:

source: topic title (unique value, 64 characters or fewer)
uk: назва теми (унікальне значення, не більше 64 символів)

source: topic short description (255 characters or fewer)
uk: короткий опис теми (не більше 255 символів)

source: Article
uk: Стаття

source: Article requires title (255 characters or fewer).
uk: Стаття вимагає наявності заголовка (не більше 255 символів).

source: Article requires content (at least 255 characters).
uk: Стаття вимагає наявності змісту (принаймні 255 символів).

source: Creation date should be autogenerated at article creation, and would never be updated.
uk: Дата створення буде автоматично генеруватися при створенні статті і не буде оновлюватися пізніше.

source: Updated date will be update at each article save.
uk: Дата оновлення буде оновлюватися при кожному збереженні статті.

source: Article comment
uk: Коментар до статті

source: Comment requires creation date (autogenerated).
uk: Коментар вимагає наявності дати створення (автоматично генерується).

source: Comment requires message text.
uk: Коментар вимагає наявності тексту повідомлення.

source: Relationships
uk: Відносини

source: Standard Django user model **will be** used for now. To apply model reference pass ``"auth.User"`` as related model. Users can be created via admin page. You can also refer the same model as shown below:
uk: Стандартна модель користувача Django **буде** використовуватися наразі. Для застосування посилання на модель передайте ``"auth.User"`` як пов'язану модель. Користувачі можуть бути створені через адміністративну сторінку. Ви також можете посилатися на ту саму модель, як показано нижче:

source: ``article`` and ``topics`` have *many-to-many* relationship.
uk: ``article`` та ``topics`` мають *багато-до-багатьох* відношення.

source: ``article`` and ``user`` have *one-to-many* relationship. A article can have **only one** author, but users can create as many articles as they want.
uk: ``article`` та ``user`` мають *один-до-багатьох* відношення. У статті може бути **лише один** автор, але користувачі можуть створювати стільки статей, скільки їм потрібно.

source: ``article`` and ``comment`` have *one-to-many* relationship. A article may be a container for many comments, but a comment is related to a single article.
uk: ``article`` та ``comment`` мають *один-до-багатьох* відношення. Стаття може бути контейнером для багатьох коментарів, але коментар пов'язаний лише з однією статтею.

source: ``comment`` and ``user`` have *one-to-many* relationship. It's similar to *article - user* relationship.
uk: ``comment`` та ``user`` мають *один-до-багатьох* відношення. Це схоже на відношення *стаття - користувач*.

source: ``topic`` and ``user`` use *many-to-many* relationship. A single user can prefer none or as many topics as needed and vice versa. This relationship represents topics preferred by a certain blog user. Also this provides an additional option to mark some of preferred topics with a **notify** flag, to receive newsletters about specified topics updates. The difference between *prefer* and *notify* is that *preferred* topics affect the articles list for a user, and *notify* is responsible for newsletters for the user.
uk: ``topic`` та ``user`` використовують відношення *багато-до-багатьох*. Один користувач може вибрати будь-яку кількість тем, і навпаки. Це відношення представляє теми, які вибрані певним користувачем блогу. Крім того, це надає додаткову опцію позначити деякі з вибраних тем прапорцем **notify**, щоб отримувати розсилки про оновлення зазначених тем. Відмінність між *prefer* (вибір) та *notify* (сповіщення) полягає в тому, що *prefer* впливає на список статей для користувача, а *notify* відповідає за розсилку новин для користувача.

source: UML diagram
uk: UML діаграми

source: Challenge: ORM
uk: Завдання: ORM

source: Update existing views to represent entities that are actually stored inside the project's database.
uk: Оновіть існуючі подання, щоб представити сутності, які фактично зберігаються в базі даних проекту.

source: ``/``: should represent a list of existing articles.
uk: ``/``: повинен представляти список існуючих статей.

source: ``/<article>/``: should represent a single existing article.
uk: ``/<article>/``: повинен представляти окрему існуючу статтю.

source: Detail view should obtain a list of article related comments.
uk: Вью для перегляду окремої статті повинен отримувати зв'язані коментарі.

source: ``/profile/<str:username>/``: should contain information about user and a list of articles authored by this user.
uk: ``/profile/<str:username>/``: повинен містити інформацію про користувача та список статей, написаних цим користувачем.

source: All views related to a single entity (*detail*, *update*, *delete*, *profile*) should raise ``Http404`` in case entity could not be fetched.
uk: Усі ресурси, пов'язані з окремою сутністю (*деталі*, *оновлення*, *видалення*, *профіль*) мають викликати ``Http404`` у випадку, якщо сутність не вдалося отримати.
