Repository: edu-python-course/edu-python-course.github.io
Catalog: src/_locales/*/LC_MESSAGES/appx.po
Languages: uk

source: It's common to store dedicated functions/classes that supports some specific business logic in a separate module called ``services.py`` or ``utils.py`` within an application directory.
uk: Звичайно, функції/класи, що підтримують певну специфічну бізнес-логіку, розумно зберігати в окремому модулі з назвою ``services.py`` або ``utils.py`` всередині директорії додатку.

source: Create a service to fetch articles, ordered by a specified user preferences. This means, topics preferred by a user affects articles orders. Queryset should be ordered in way, to have articles with most corresponding topics at the begging.
uk: Створіть сервіс для того, щоб отримувати статі у вигляді відсортованому згідно вподобань зазначеного користувача. Це означає, що чим більше тем зазначених у статті співпадає з вподобаннями користувача, тим ближче вона до початку видачі.

source: Challenge: Templates
uk: Завдання: Шаблони

source: Helpful link: `Bootstrap template`_
uk: Корисне посилання: `Bootstrap template`_

source: Links related to user data **may be** placeholders for now.
uk: Посилання, що стосуються даних користувача, **можуть бути** плейсхолдерами наразі.

source: **All** templates should be inherited from the ``base.html`` template.
uk: **Усі** шаблони повинні успадковувати ``base.html`` шаблон.

source: Each page has a descriptive title HTML tag, which included ``| Blog`` suffix, e.g. "Articles | Blogs", "Sample | Blog", "Login | Blog" etc.
uk: Кожна сторінка має описовий тег HTML заголовка, включаючи суфікс ``| Blog``, наприклад, "Articles | Blogs", "Sample | Blog", "Login | Blog" і т.д.

source: Each page should contain a link to homepage (``/`` URL route).
uk: Кожна сторінка повинна містити посилання на головну сторінку (шлях URL ``/``).

source: Each page contains a list of registered topics. Each view of this kind filters only articles of a relevant topic. This should be implemented with a custom template context processor.
uk: Кожна сторінка містить список зареєстрованих тем. Кожне представлення цього типу фільтрує лише статті відповідної теми. Це слід реалізувати за допомогою власного обробника контексту шаблону (template context processor).

source: Replace content block for *about* page with some static content.
uk: Замініть блок вмісту (content block) для сторінки *about* на деякий статичний вміст.

source: Application-level templates should be located within appropriate applications.
uk: Шаблони рівня застосунків розташовуватися у відповідних застосунках.

source: Each page should contain a list of links to archive views for the last year.
uk: Кожна сторінка має містити список посилань на перегляди архіву за останній рік.

source: Each page should contain an inclusion-block(s) with following links:
uk: Кожна сторінка повинна містити блок(и) включення з такими посиланнями:

source: ``/registration/``: new user registration form
uk: ``/register/``: форма реєстрації нового користувача

source: ``/login/``: user login form
uk: ``/login/``: форма логіна користувача

source: ``/create/``: article creation page
uk: ``/create/``: форма створення статті

source: Articles list
uk: Список статей

source: Main page contains a list of published articles.
uk: Головна сторінка містить список опублікованих статей.

source: Each article entity is rendered using a custom template tag.
uk: Кожен елемент статті відображається за допомогою власного шаблонного тегу.

source: ``article`` template tag renders information about a article object:
uk: Шаблонний тег ``article`` відображає інформацію про об'єкт статті:

source: article title
uk: заголовок статті

source: article content (trimmed to ~50 characters)
uk: зміст статті (обрізаний до ~50 символів)

source: article creation date
uk: дата створення статті

source: related topics (3 topics or fewer)
uk: пов'язані теми (3 або менше)

source: number of related comments
uk: кількість коментарів до статті

source: Article details
uk: Деталі статті

source: Article update and deletion views **would not** affect data for now.
uk: Оновлення та видалення статей **не будуть** впливати на дані наразі.

source: A article detail page contains links to **update** or **delete** current article.
uk: На сторінці деталей статті мають бути посилання на **оновлення** або **видалення** поточної статті.

source: Page provides information about article:
uk: Сторінка надає інформацію про статтю:

source: Article title
uk: Заголовок статті

source: Creation date
uk: Дата створення

source: Author name
uk: Ім'я автора

source: Related topics
uk: Пов'язані теми

source: Article content
uk: Вміст статті

source: Page contains a list of related comments.
uk: Сторінка містить список пов'язаних коментарів.

source: Each comment contains:
uk: Кожен коментар містить:

source: Comment creation time
uk: Час створення коментаря

source: Comment message
uk: Текст комментаря

source: Profile page
uk: Строніка профілю

source: Author page contains information about author:
uk: Сторінка автора містить інформацію про автора:

source: First name
uk: Ім'я

source: Last name
uk: Прізвище

source: Add more information, if needed.
uk: Додайте більше інформації за бажанням.

source: Author page contains a list of articles created by this author.
uk: Сторінка автора містить список статей, створених цим автором.

source: Author page contains buttons/links to change user data and password or deactivate a user's account.
uk: Сторінка автора містить кнопки/посилання для зміни користувача та пароля або деактивації облікового запису користувача.

source: Forms
uk: Форми

source: There is **no need** to add actual forms now. They will be generated by Django. This section describes the final view of these pages. It's ok just to create a dedicated templates for future use.
uk: Наразі **немає потреби** додавати фактичні форми. Вони будуть створені Django. Цей розділ описує кінцевий вигляд цих сторінок. Для майбутнього використання достатньо створити окремі шаблони.

source: ``/register/`` page contains a new user registration form. It should take inputs from the user:
uk: Сторінка ``/register/`` містить форму реєстрації нового користувача. Вона повинна отримувати введені дані від користувача:

source: ``/login/`` page contains a user login form. It should take the inputs from the user:
uk: Сторінка ``/login/`` містить форму входу користувача. Вона повинна отримувати введені дані від користувача:

source: ``/create/`` and ``/<article>/update/`` pages contain a form to collect a article's data:
uk: Сторінки ``/create/`` та ``/<article>/update/`` містять форму для збору даних статті:

source: relevant topics
uk: відповідні теми

source: ``/<article>/delete`` page contains a simple delete confirmation form.
uk: Сторінка ``/<article>/delete`` містить просту форму для підтвердження видалення.

source: Change password form has two fields:
uk: Форма зміни пароля має два поля:

source: Change user's data form collects all information, that can be changed, e.g. ``username``, ``first name``, ``last name`` etc.
uk: Форма зміни даних користувача збирає всю інформацію, яка може бути змінена, наприклад, ``username``, ``first name``, ``last name`` та інше.

source: User preferences page contains a list of available topics. User can mark some topics as preferred. Also for preferred topics an option to *subscribe* for the newsletters becomes available.
uk: Сторінка налаштувань користувача містить список доступних тем. Користувач може відмітити деякі теми як пріоритетні (переваги). Також для пріоритетних тем стає доступною опція *підписки* на розсилку новинних листів.

source: Challenge: Articles' slugs
uk: Виклик: Slug-и статей

source: This is an optional challenge in addition to:
uk: Це додатковий виклик у додаток до:

source: Update ``Article`` model with ``slug`` field. The slug value is:
uk: Оновіть модель ``Article``, додавши поле ``slug``. Значення slug поля є:

source: required for each article
uk: обов'язкове для кожної статті

source: unique for each article
uk: унікальне для кожної статті

source: Create a data migration to provide slugs for existing articles.
uk: Створіть міграцію даних для надання slug-ів існуючим статтям.

source: ``slug`` should be auto-generated on article save. The pattern is ``article.title-article.created_date``, e.g. "Sample article" created at "03/24/2023" should receive slug: ``sample-blog-article-2023-03-23``.
uk: Поле ``slug`` повинно автоматично генеруватися при збереженні статті. Шаблон для генерації поля ``slug``: ``назва-статті-дата-створення-статті``, наприклад, стаття з назвою "Прикладна стаття", створена "24/03/2023", отримає slug: ``sample-blog-article-2023-03-23``.

source: Update detail view URL path with article slug as dynamic portion.
uk: Оновіть шлях URL для представлення деталей статті з динамічною частиною, якою буде slug статті.

source: Challenge: Auth forms
uk: Завдання: форми авторизації

source: Create form for new users registration with required fields:
uk: Створити форму для реєстрації нових користувачів із обов'язковими полями:

source: ``username`` value should be validated against existing values.
uk: Значення ``username`` повинно перевірятися на відповідність існуючим значенням.

source: ``password`` and ``confirm password`` values should match.
uk: Значення ``password`` і ``confirm password`` мають збігатися.

source: Create form for existing users login.
uk: Створити форму для входу існуючих користувачів.

source: Validations errors are to be rendered on the template.
uk: Помилки перевірки повинні відображатися на шаблоні.

source: Challenge: Authentication
uk: Завдання: Автентифікація

source: For anonymous users ``/register/`` and ``/login/`` links should be visible in navbar.
uk: Для анонімних користувачів посилання ``/register/`` і ``/login/`` мають бути видимими на панелі навігації.

source: For authenticated users ``/logout/`` and ``/create/`` links should be visible in navbar.
uk: Для автентифікованих користувачів посилання ``/logout/`` і ``/create/`` мають бути видимими на панелі навігації.

source: If authenticated user is admin or stuff they should see a link to admin page.
uk: Якщо автентифікований користувач є адміністратором або іншим, він має побачити посилання на сторінку адміністратора.

source: ``/register/``: Users should provide all required information about them: desired username and email. Name data (both first and last) is optional. After user creation they should be redirected to login page to perform authentication process. Invalid form should provide information about error(s).
uk: ``/register/``: користувачі повинні надати всю необхідну інформацію про себе: бажане ім'я користувача та електронну адресу. Дані імені (ім'я та прізвище) необов'язкові. Після створення користувача вони повинні бути перенаправлені на сторінку входу для виконання процесу автентифікації. Недійсна форма повинна надавати інформацію про помилку(и).

source: ``/login/``: Users should provide their credentials to login. In case login is successful they should be redirected to their profile (if no ``?next=url`` query string available).
uk: ``/login/``: користувачі повинні надати свої облікові дані для входу. У разі успішного входу вони повинні бути перенаправлені до свого профілю (якщо немає рядка запиту ``?next=url``).

source: ``/create/``: Only authenticated users should be able to visit this page. In case anonymous user is trying to request this view they should be redirected to the login view first, and after successful authentication get back to article creation. Then a article is created, it should be authored by the currently authenticated user.
uk: ``/create/``: Лише аутентифіковані користувачі повинні мати доступ до цієї сторінки. Якщо анонімний користувач намагається отримати доступ до цього представлення, його повинно перенаправити спочатку на сторінку входу, а після успішної аутентифікації повернути на сторінку створення статті. При створенні статті вона повинна мати автором поточного аутентифікованого користувача.

source: ``/<article>/comment/``: Currently authenticated user should be referenced as a comment's author.
uk: ``/<article>/comment/``: У коментарі поточного аутентифікованого користувача повинна бути зазначена його ідентифікація як автора.

source: Articles may be modified or deleted only by their authors from the detail article page. However, admins can still performs articles actions from the admin page.
uk: Змінювати або видаляти статті можуть тільки їх автори на сторінці деталей статті. Однак адміністратори все ще можуть виконувати дії зі статтями через адміністративну сторінку.

source: User related paths are restricted for non-authorized users.
uk: Шляхи, пов'язані з користувачем, обмежені для неаутентифікованих користувачів.

source: ``POST`` request ``/deactivate/`` should mark current authenticated user as *deleted* and log them user.
uk: Запит ``POST`` на ``/deactivate/`` повинен позначати поточного аутентифікованого користувача як *видаленого* і виходити з системи для цього користувача.

source: Adjust the order of article list according to authenticated user preferences. For anonymous users keep default ordering.
uk: Призначте зміну порядку списку статей відповідно до вподобань аутентифікованого користувача. Для анонімних користувачів залиште типове сортування за замовчуванням.

source: Implement account reactivation behavior. The exact workflow does not mater. The sample scenario is to collect email for the user and check it for existing in the database. After that create a request for admin to activate an account and send a confirmation email, when all is done.
uk: Реалізуйте поведінку щодо відновлення облікового запису. Точний порядок дій не має значення. Один зі зразків сценаріїв може полягати у зборі електронної пошти користувача та перевірки наявності цієї адреси в базі даних. Після цього створіть запит для адміністратора на активацію облікового запису та надішліть підтверджувальний лист електронною поштою, коли все буде готово.

source: Challenge: Article related forms
uk: Виклик: Форми пов'язані зі статтями

source: Implement a article form. This form will be used to create new articles and to update existing ones.
uk: Реалізуйте форму статті. Ця форма буде використовуватися для створення нових статей та оновлення існуючих.

source: Each created article should have at least one related topic.
uk: Кожна створена стаття повинна мати принаймні одну пов'язану тему.

source: Implement a comment form to gather a comment from a user.
uk: Реалізуйте форму коментаря, щоб збирати коментарі від користувача.

source: Only ``POST`` requests to ``/<article>/comment/`` are allowed from this moment.
uk: З даного моменту дозволені лише запити типу ``POST`` до ``/<article>/comment/``.

source: Implement functionality:
uk: Реалізуйте функціональність:

source: article creation
uk: створення статті

source: article update
uk: оновлення статті

source: article comment (create a related comment)
uk: коментування статті (створення коментаря)

source: article deletion
uk: видалення статті

source: Only authenticated users can create articles.
uk: Лише аутентифіковані користувачі можуть створювати статі.

source: Article can be edited only by its author.
uk: Стаття може редагуватись лише її автором.

source: Article can be deleted only by its author.
uk: Стаття може видалятись лише її автором.

source: Only authenticated users can comment articles.
uk: Лише аутентифіковані користувачі можуть коментувати статті.

source: Challenge: Class-Based Views
uk: Завдання: Class-Based Views

source: Replace **all** existing views via ``CBV``.
uk: Замінити **всі** існуючі перегляди через ``CBV``.

source: Existing functionality should not be corrupted.
uk: Існуюча функціональність не повинна бути пошкоджена.

source: It's ok to use built-in Django CBV if needed.
uk: Якщо потрібно, можна використовувати вбудовані класи відображення у Django (CBV).

source: Challenge: Serializers
uk: Завдання: Серіалізатори

source: Topic serializer is for read-only purposes only. Topics can be created via admin page only.
uk: Серіалізатор для теми призначений лише для операцій читання (read-only). Теми можна створювати лише через адміністративну сторінку.

source: Serialized data should contain all available data, e.g. ``pk``, ``title``, ``description``.
uk: Серіалізовані дані повинні містити всю доступну інформацію, наприклад, ``pk``, ``title``, ``description``.

source: article comment serializer can perform both reading and writing operations. But it can't be used to *update* or *delete* comment.
uk: серіалізатор коментаря статті може виконувати як операції читання, так і операції запису. Проте він не може використовуватися для оновлення або видалення коментаря.

source: Random, or pre-defined user may be used as comment's author for now. This will be fixed in the future.
uk: Наразі можна використовувати випадкового або попередньо визначеного користувача як автора коментаря. Це буде виправлено у майбутньому.

source: article serializer provides full access to articles. All operations are available: list, retrieve, create, update and destroy.
uk: серіалізатор статей надає повний доступ до статей. Доступні всі операції: отримання списку, отримання окремої статті, створення нової статті, оновлення та видалення.

source: User
uk: Користувач

source: User serializer provides full access to site users data. All operations are available for now: list, retrieve, create, update and destroy. This behavior will be fixed in the future, to prevent unauthorized data modifications.
uk: Серіалізатор користувача надає повний доступ до даних користувачів сайту. Усі операції доступні наразі: отримання списку користувачів, отримання окремого користувача, створення нового користувача, оновлення та видалення. Однак, ця поведінка буде виправлена у майбутньому для запобігання несанкціонованим змінам даних.

source: Challenge: API views
uk: Завдання: API views

source: All blog-site functionality are to be reflected via REST API.
uk: Вся функціональність блог-сайту повинна бути відображена за допомогою REST API.

source: It's ok to pass *pre-defined* user as argument in request's body. This will be fixed in the next challenge.
uk: Наразі дозволяється передавати *наперед визначеного* користувача у тілі запиту. Це буде виправлено у наступному розділі.

source: Challenge: Authentication and Permissions
uk: Завдання: Автентифікація та Дозволи

source: Implement authentication system for REST API.
uk: Реалізуйте систему аутентифікації для REST API.

source: For non-authenticated users it is possible to create a new account
uk: Для неаутентифікованих користувачів можлива створення нового облікового запису

source: For non-authenticated users it is possible to obtain authentication data.
uk: Для неаутентифікованих користувачів можлива отримання даних аутентифікації.

source: Access to user data is restricted. Authorized users can manipulate only their own data (e.g. ``retrieve``, ``update``).
uk: Доступ до даних користувача обмежений. Авторизовані користувачі можуть маніпулювати лише своїми власними даними (наприклад, ``retrieve``, ``update``).

source: Admins can retrieve all users data (``list``), but can't change them via REST API. However, it is still possible via admin page.
uk: Адміністратори можуть отримати дані всіх користувачів (``list``), але не можуть змінювати їх через REST API. Однак це все ще можливо через адміністративну сторінку.

source: Authorized users can ``create`` articles or ``update`` and ``delete`` articles created by them.
uk: Авторизовані користувачі можуть ``create`` статті або ``update`` та ``delete`` статті, створені ними.

source: Authorized users can add comments to a specified article.
uk: Авторизовані користувачі можуть додавати коментарі до вказаної статті.

source: Code editors and IDEs for Python
uk: Редактори коду та IDE для Python

source: Page is under construction
uk: Сторінка в розробці

source: Code Editors
uk: Редактори Коду

source: Writing Python using IDLE or the Python Shell is great for simple things, but those tools quickly turn larger programming projects into frustrating pits of despair. Using an IDE, or even just a good dedicated code editor, makes coding fun — but which one is best for you? :cite:`realpython:code-edit`
uk: Написання на Python за допомогою IDLE або оболонки Python чудово підходить для простих речей, але ці інструменти швидко перетворюють великі проекти програмування на розчаровуючу яму відчаю. Використання IDE або навіть просто хорошого спеціального редактора коду робить кодування цікавим — але який з них найкращий для вас? :cite:`realpython:code-edit`

source: Convenience store challenge
uk: Завдання: продуктовий магазин

source: The local store is struggling with their payment registry system. The owner asked you to take a look at it and to propose some ideas about the upgrade. While looking on a wooden frames with rows of beads you think that this will be a challenging task to bring a modern approach into this place and reorganize the processes. Fortunately, you are a Python developer who knows how to work with various data incomes and outcomes. After some time the scope of works and timelines were discussed and wrote some notes to split the entire project into individual pieces to implement step-by-step.
uk: Місцевий магазин має проблеми з системою реєстрації платежів. Власник попросив вас поглянути на нього та запропонувати деякі ідеї щодо оновлення. Дивлячись на дерев'яні рами з рядами намистин, ви думаєте, це буде складним завданням застосувати сучасний підхід до цього місця та реорганізувати процеси. На щастя, ви розробник Python, який знає, як працювати з різними доходами та результатами даних. Через деякий час обговорювалися обсяги робіт і часові рамки та були написані деякі примітки, щоб розділити весь проект на окремі частини для поетапної реалізації.

source: Your notes are here,
uk: Ваші нотатки ось,

source: Products and Carts
uk: Товари та кошик

source: It's a good idea to start with basics - the objects you're going to work with. At stage one the main goal is to implement data models - classes to work around data in the future.
uk: Бажано почати з основ - об'єктів, з якими ви збираєтеся працювати. На першому етапі головною метою є впровадження моделей даних - класів для роботи з даними в майбутньому.

source: Product
uk: Товар

source: This class represents goods available to purchase in the store.
uk: Цей клас представляє товари, які можна придбати в магазині.

source: Each product instance should have next attributes:
uk: Кожен екземпляр продукту повинен мати такі атрибути:

source: ``name`` - a product title (e.g. "apple", "juice")
uk: ``name`` - назва товару (прик. "apple", "juice")

source: ``price`` - a price for a single product unit (e.g. 3655, 500, 12999)
uk: ``price`` - ціна за одну одиницю товару (прик. 3655, 500, 12999)

source: ``unit`` - a size of a single product's unit (e.g. 1, 0.500, 12)
uk: ``unit`` - розмір одиниці окремого товару (прик. 1, 0.500, 12)

source: For example: **apple** costs 1059 for each 0.1 kg. This means ``name`` will store ``"apple"``, ``price`` is ``1059`` and ``unit`` is equal to ``0.1``.
uk: Наприклад: **яблуко** коштує 1059 за кожні 0,1 кг. Це означає, що ``name`` зберігає ``"apple"``, ``price`` є ``1059`` і `` unit`` дорівнює ``0,1``.
