Repository: edu-python-course/edu-python-course.github.io
Catalog: src/_locales/*/LC_MESSAGES/appx.po
Languages: uk

source: Floating point exponential format (lowercase)
uk: Експоненціальний формат із плаваючою комою (нижній регістр)

source: Floating point exponential format (uppercase)
uk: Експоненціальний формат із плаваючою комою (верхній регістр)

source: Floating point decimal format
uk: Десятковий формат із плаваючою комою

source: Floating point format. Uses lowercase exponential format if exponent is less that -4 or not less than precision, decimal format otherwise.
uk: Формат з плаваючою комою. Використовує нижній регістр експоненціального формату, якщо показник степеня менший за -4 або не менший за точність, десятковий формат інакше.

source: Single character (accepts integer or single character string)
uk: Один символ (приймає ціле число або рядок з одним символом)

source: Converts any Python object using ``repr()``
uk: Перетворює будь-який об'єкт Python за допомогою ``repr()``

source: Converts any Python object using ``str()``
uk: Перетворює будь-який об'єкт Python за допомогою ``str()``

source: Converts any Python object using ``ascii()``
uk: Перетворює будь-який об'єкт Python за допомогою ``ascii()``

source: No arguments is converted, results in a ``'%'`` character in the result.
uk: Жодні аргументи не перетворюються, результатом є символ ``'%'``.

source: Useful software list
uk: Список корисного програмного забезпечення

source: Software List
uk: Список Програмного Забезпечення

source: **7-Zip** is **free software** with **open source**.
uk: **7-Zip** — це **вільне програмне забезпечення** з **відкритим кодом**.

source: High compression ratio in `7z format <https://7-zip.org/7z.html>`__ with **LZMA** and **LZMA2** compression
uk: Високий ступінь стиснення у `7z format <https://7-zip.org/7z.html>`__ зі стисненням **LZMA** і **LZMA2**

source: Supported formats:
uk: Підтримувані формати:

source: Packing / unpacking: 7z, XZ, BZIP2, GZIP, TAR, ZIP and WIM
uk: Пакування / розпакування: 7z, XZ, BZIP2, GZIP, TAR, ZIP і WIM

source: Unpacking only: APFS, AR, ARJ, CAB, CHM, CPIO, CramFS, DMG, EXT, FAT, GPT, HFS, IHEX, ISO, LZH, LZMA, MBR, MSI, NSIS, NTFS, QCOW2, RAR, RPM, SquashFS, UDF, UEFI, VDI, VHD, VHDX, VMDK, XAR and Z.
uk: Лише розпакування: APFS, AR, ARJ, CAB, CHM, CPIO, CramFS, DMG, EXT, FAT, GPT, HFS, IHEX, ISO, LZH, LZMA, MBR, MSI, NSIS, NTFS, QCOW2, RAR, RPM, SquashFS , UDF, UEFI, VDI, VHD, VHDX, VMDK, XAR і Z.

source: Self-extracting capability for 7z format
uk: Можливість саморозпакування для формату 7z

source: Integration with Windows Shell
uk: Інтеграція з Windows Shell

source: It is a large collection of GNU and Open Source tools which provide functionality similar to a `Linux distribution <https://en.wikipedia.org/wiki/Linux_distribution>`__ on Windows and a DLL (cygwin1.dll) which provides substantial POSIX API functionality.
uk: Це велика колекція інструментів GNU та Open Source, які забезпечують функціональність, подібну до `дистрибутива Linux <https://en.wikipedia.org/wiki/Linux_distribution>`__ у Windows та DLL (cygwin1.dll), яка забезпечує значний POSIX Функціонал API.

source: **Cygwin is not**:
uk: **Сygwin це не**:

source: a way to run native Linux apps on Windows. You must rebuild your application *from source* if you want it to run on Windows.
uk: спосіб запуску рідних програм Linux у Windows. Ви повинні перебудувати свою програму *з вихідного коду*, якщо ви хочете, щоб вона запускалася в Windows.

source: a way to magically make native Windows apps aware of UNIX® functionality like ``signals``, ``ptys`` etc. Again, you need to build your apps *from source* if you want to take advantage of Cygwin functionality.
uk: спосіб чарівним чином зробити рідні програми Windows відомими функціональності UNIX®, як-от `signals`, `ptys` тощо. Знову ж таки, вам потрібно створити свої програми *з джерела*, якщо ви хочете скористатися перевагами функціональності Cygwin.

source: Git is a `free and open source <https://git-scm.com/about/free-and-open-source>`__ distributed version control system designed to handle everything from small to very large projects with speed and efficiency.
uk: Git — це `безкоштовна система з відкритим вихідним кодом <https://git-scm.com/about/free-and-open-source>`__ розподілена система контролю версій, призначена для швидкого та ефективного керування всіма проектами, від малих до дуже великих.

source: The most-loved Tool in Stack Overflow’s 2022 Developer Survey.
uk: Найулюбленіший інструмент в опитуванні розробників Stack Overflow за 2022 рік.

source: Docker helps developers bring their ideas to life by conquering the complexity of app development. We simplify and accelerate development workflows with an integrated dev pipeline and through the consolidation of application components. Actively used by millions of developers around the world, Docker Desktop and Docker Hub provide unmatched simplicity, agility and choice.
uk: Docker допомагає розробникам втілювати свої ідеї в життя, долаючи складність розробки програм. Ми спрощуємо та прискорюємо робочі процеси розробки за допомогою інтегрованого конвеєра розробників і консолідації компонентів програми. Активно використовувані мільйонами розробників у всьому світі Docker Desktop і Docker Hub забезпечують неперевершену простоту, гнучкість і вибір.

source: PostgreSQL is a powerful, open source object-relational database system with over 35 years of active development that has earned it a strong reputation for reliability, feature robustness, and performance.
uk: PostgreSQL — це потужна об'єктно-реляційна база даних з відкритим вихідним кодом, активна розробка якої триває понад 35 років, завдяки чому вона заслужила міцну репутацію надійності, надійності функцій і продуктивності.

source: A terminal-based front-end to PostgreSQL. It enables you to type in queries interactively, issue them to PostgreSQL, and see the query results. Alternatively, input can be from a file or from command line arguments. In addition, psql provides a number of meta-commands and various shell-like features to facilitate writing scripts and automating a wide variety of tasks.
uk: Термінальний інтерфейс для PostgreSQL. Це дозволяє вводити запити в інтерактивному режимі, надсилати їх у PostgreSQL і переглядати результати запиту. Крім того, введення може бути з файлу або з аргументів командного рядка. Крім того, psql надає низку мета-команд і різноманітних функцій, подібних до оболонки, для полегшення написання сценаріїв і автоматизації різноманітних завдань.

source: On Windows it will be installed within PostgreSQL RDBMS. For macOS and Linux look for ``postgresql-client`` package.
uk: У Windows його буде встановлено в СУБД PostgreSQL. Для macOS і Linux знайдіть пакет ``postgresql-client``.

source: pgAdmin is the most popular and feature rich Open Source administration and development platform for PostgreSQL, the most advanced Open Source database in the world.
uk: pgAdmin — це найпопулярніша та багатофункціональна платформа адміністрування та розробки з відкритим кодом для PostgreSQL, найдосконалішої бази даних з відкритим кодом у світі.

source: It is a PostgreSQL client (like a ``psql``), but with web based GUI.
uk: Це клієнт PostgreSQL (як ``psql``), але з графічним інтерфейсом на основі веб-інтерфейсу.

source: SQLite is a C-language library that implements a `small <https://sqlite.org/footprint.html>`__, `fast <https://sqlite.org/fasterthanfs.html>`__, `self-contained <https://sqlite.org/selfcontained.html>`__, `high-reliability <https://sqlite.org/hirely.html>`__, `full-featured <https://sqlite.org/fullsql.html>`__, SQL database engine.
uk: SQLite — це бібліотека мовою C, яка реалізує `маленьку <https://sqlite.org/footprint.html>`__, `швидку <https://sqlite.org/fasterthanfs.html>`__, `самодостатню <https://sqlite.org/selfcontained.html>`__, `висока надійність <https://sqlite.org/hirely.html>`__, `повнофункціональний <https://sqlite.org/fullsql.html>`__, двигун бази даних SQL.

source: available for installation as a cygwin package
uk: доступно для встановлення як пакет cygwin

source: Knights, thieves and wizards game project
uk: Проект гри рицарі, злодії та чарівники

source: Wizards, Thieves and Knights
uk: Чарівники, Злодії та Рицарі

source: "Wizards, Thieves and Knights" (:abbr:`WTK (Wizards, Thieves and Knights)`) game is a "Paper, Rock and Scissors" clone but in a fantasy setting. It comes with a simple command line interface where the use must type in his or her choice. The enemy is controlled by the script. The player's goal is to gain as many score points, as it possible.
uk: Гра "Чарівники, Злодії та Рицарі" (:abbr:`WTK (Wizards, Thieves and Knights)`) — це клон "Камень, ножиці, бумага", але у фентезійному сеттингу. Вона має простий інтерфейс командного рядка, де користувач повинен ввести свій вибір. Ворогом керує скрипт. Мета гравця - набрати якомога більше очок.

source: Code organization
uk: Організація коду

source: Use separate modules to maintain your code base. For example:
uk: Використовуйте окремі модулі для підтримки вашої кодової бази. Наприклад:

source: General playground description
uk: Загальний опис ігрового процесу

source: The game process is divided into rounds. Each round consists of **attack** and **defence** stages. Rounds are repeated, until player is defeated.
uk: Процес гри поділено на раунди. Кожен раунд складається з етапів атаки та захисту. Раунди повторюються, поки гравець не буде переможений.

source: Fight rules
uk: Правила боротьби

source: It's simple...
uk: Це просто...

source: **Wizard** beats **Knight**
uk: **Чарівник** перемагає **Рицаря**

source: **Thief** beats **Wizard**
uk: **Злодій** перемагає **Чарівника**

source: **Knight** beats **Thief**
uk: **Рицар** перемагає **Злодія**

source: Attack stage
uk: Стадія атаки

source: Player selects the choice to attack from **wizard**, **thief** or **knight**, enemy selects the choice for defence from the same options by random. If the attack is successful:
uk: Гравець обирає для атаки **чарівника**, **злодія** або **лицаря**, ворог обирає захист з тих самих варіантів випадковим чином. Якщо атака успішна:

source: enemy health is decreased
uk: здоров'я ворога зменшено

source: player gains score points
uk: гравець отримує очки

source: In case enemy is defeated:
uk: Якщо ворог переможений:

source: a new enemy instance is initialized using higher level
uk: новий екземпляр ворога ініціалізовано з використанням вищого рівня

source: player gains some extra score points
uk: гравець отримує додаткові очки

source: next defence stage is skipped, and player attacks again
uk: наступний етап захисту пропущено, і гравець атакує знову

source: Defence stage
uk: Стадія захисту

source: Player selects the choice to defend from **wizard**, **thief** or **knight**, enemy selects the choice to attack from the same options by random. If the attack is successful:
uk: Гравець вибір для захисту **чарівника**, **злодія** або **рицаря**, ворог обирає для атаки з тих же варіантів випадковим чином. Якщо атака успішна:

source: player health is decreased
uk: здоров'я гравця знижено

source: If player is defeated:
uk: Якщо гравець переможений:

source: report the message about gained score points to the terminal
uk: повідомляти повідомлення про набрані бали на термінал

source: write down player's name and score points to "scores.txt" file
uk: запишіть ім'я гравця та наберіть очки до файлу "scores.txt"

source: Exceptions
uk: Винятки

source: Enemy down
uk: Ворога переможено

source: This is an exceptional scenario when enemy is defeated. A custom exception ``EnemyDown`` should be used to track these cases. Exception should provide the details on the enemy's instance, especially its level.
uk: Це винятковий сценарій, коли ворог зазнає поразки. Щоб відстежувати ці випадки, слід використовувати налаштований виняток ``EnemyDown``. Виняток повинен надавати деталі про екземпляр ворога, особливо його рівень.

source: Raised when an enemy is defeated
uk: Виникає, коли ворог переможений

source: Game over
uk: Гра завершена

source: This is an exceptional scenario when player is defeated. A custom exception ``GameOver`` should be used to track these cases. Exception should provide the details on the player's instance, especially its score points.
uk: Це винятковий сценарій, коли гравець зазнає поразки. Щоб відстежувати ці випадки, слід використовувати спеціальний виняток ``GameOver``. Виняток повинен надавати деталі про екземпляр гравця, особливо його результати бали.

source: Raised when a player is defeated
uk: Виникає, коли гравця переможено

source: Enemy
uk: Ворог

source: Enemy model
uk: Модель супротивника

source: enemy's level value
uk: значення рівня противника

source: enemy's instance health points
uk: очки здоров'я ворога

source: Represents the playing enemy-bot.
uk: Представляє граючого ворога-бота.

source: Initialize instance
uk: Ініціалізувати екземпляр

source: an enemy's level indicator
uk: індикатор рівня противника

source: Health value is equal to the level value.
uk: Значення здоров'я дорівнює значенню рівня.

source: Decrease health points
uk: Зменшує очоки здоров'я

source: This method decreases the health meter value. When it comes to be less than 1 (one) an ``EnemyDown`` exception is raised.
uk: Цей метод зменшує значення індикатора працездатності. Коли значення менше 1 (одного), виникає виняток ``EnemyDown``.

source: Return a random fight choice
uk: Повертає випадковий варіант для бою

source: a fight choice
uk: варіант для бою

source: Choices made by an enemy are random.
uk: Вибори, зроблені супротивником, випадкові.

source: You are free to implement other methods you like, if needed.
uk: Ви можете використовувати інші методи, які вам подобаються, якщо потрібно.

source: Player
uk: Гравець

source: Player model
uk: Модель гравця

source: player's name
uk: ім'я гравця

source: player's instance health points
uk: очки здоров'я гравця

source: player's instance gained score points
uk: очки, зароблені гравцем

source: This model is controlled by the player.
uk: Ця модель керується гравцем.

source: a player's name
uk: ім'я гравця

source: This method performs player instance initialization. It set instance name, initial score points value and health.
uk: Цей метод виконує ініціалізацію примірника програвача. Він встановлює назву екземпляра, значення початкових балів і здоров'я.

source: Attack an enemy
uk: Атакує ворога

source: Perform attack on an enemy instance. This method takes an enemy instance as an argument. After that, it takes attack choice from the player model and the defence choice from an enemy model. After fight result calculation required operation are to be performed (decrease enemy health, assign score points etc.). Based on fight result should print out a message:
uk: Виконати атаку на екземпляр противника. Цей метод приймає екземпляр противника як аргумент. Після цього він приймає вибір атаки з моделі гравця та вибір захисту з моделі противника. Після результату битви потрібно виконати обчислення, необхідні операції (зменшити здоров'я ворога, призначити очки тощо). На основі результату бою має видрукувати" "повідомлення:

source: This method decreases the health meter value. When it comes to be less than 1 (one) an ``GameOver`` exception is raised.
uk: Цей метод зменшує значення індикатора працездатності. Коли значення менше 1 (одного), виникає виняток ``GameOver``.

source: Defend from an enemy's attack
uk: Захист від атаки супротивника

source: Perform defence from an enemy attack. This method takes an enemy instance as an argument. After that, it takes defence choice from the player model and the attack choice from an enemy model. After fight result calculation required operation are to be performed (decrease player health). Based on fight result should print out a message:
uk: Виконайте захист від атаки ворога. Цей метод приймає екземпляр ворога як аргумент. Після цього він приймає вибір захисту від моделі гравця та вибір атаки від моделі ворога. Після результату бою необхідно виконати операцію обчислення (зменшити здоров'я гравця). За результатами бою повинно вийти повідомлення:

source: Fight result calculation interface
uk: Інтерфейс для вирахування результатів двобою

source: The method calculates the fight result based on the game rules:
uk: Метод розраховує результат бою за правилами гри:

source: **wizard** beats **knight**
uk: **чарівник** перемагає **рицаря**

source: **thief** beats **wizard**
uk: **злодій** перемагає **чарівника**

source: **knight** beats **thief**
uk: **рицар** перемагає **злодія**

source: Return fight choice from the user's prompt
uk: Повертає варіант для поєдинку з вводу користувача

source: The player is asked to make their decision for the upcoming fight. The chosen value is validated and if it is invalid the question is repeated.
uk: Гравця просять прийняти рішення щодо майбутнього бою. Вибране значення перевіряється, і якщо воно недійсне, запитання повторюється.

source: Settings
uk: Налаштування

source: Settings module contains constants values for the game.
uk: Модуль налаштувань містить значення констант для гри.

source: For example,
uk: Наприклад,

source: Initial player health value
uk: Початкове значення здоров'я гравця

source: Initial enemy level value
uk: Початкове значення рівня ворога

source: Score points value to assign when player's attack is successful
uk: Вартість очок, які призначаються, коли атака гравця успішна

source: Score points value to assign when enemy is defeated
uk: Вартість очок, які призначаються, коли ворог переможений

source: You may also define messages with this module, for example:
uk: Ви також можете визначити повідомлення за допомогою цього модуля, наприклад:

source: Successful attack message
uk: Повідомлення про успішну атаку

source: Successful defence message
uk: Повідомлення про успішний захист

source: Failed attack message
uk: Повідомлення про невдалу атаку

source: Failed defence message
uk: Повідомлення про невдалий захист

source: Draw fight message
uk: Повідомлення про нічию

source: Engine
uk: Ігровий рушій

source: Engine module should provide two functions:
uk: Модуль двигуна має забезпечувати дві функції:

source: Player name getter
uk: Отримання імені гравця

source: Asks the user to type in his or her name and return it back. Leading and trailing whitespaces are to be trimmed. Name should contain at least one character.
uk: Просить користувача ввести своє ім'я та повернути його назад. Пробіли на початку та в кінці мають бути вирізані. Ім'я має містити принаймні один символ.

source: Return a player's name from the user prompt
uk: Повертає ім'я гравця з вводу користувача

source: a player defined name
uk: ім'я визначене гравцем

source: A validation process is performed as well. The player name cannot be an empty string.
uk: Також виконується процес перевірки. Ім'я гравця не може бути порожнім рядком.

source: Play
uk: Гра

source: This function initializes player and enemy instance. It processes game rounds inside of an endless loop stage by stage. If an enemy is defeated - a new one should be initialized with level increased by 1 (one). This case should be reported to the terminal. If a player is defeated - the "Game Over" message should be reported to the terminal. ``KeyboardInterrupt`` should be handled as well - it's behavior is similar to "Game Over" event, but "game over" message should be omitted.
uk: Ця функція ініціалізує екземпляр гравця та ворога. Вона обробляє ігрові раунди в нескінченному циклі поетапно. Якщо ворога переможено - нового слід ініціалізувати з рівнем, збільшеним на 1 (один). Про цей випадок слід повідомити на термінал. Якщо гравець зазнає поразки - повідомлення "Game Over" має бути повідомлено на термінал. ``KeyboardInterrupt`` також слід обробити - це поведінка подібно до події "Game Over", але повідомлення "Game Over" має бути пропущено.

source: Run the game
uk: Запускає гру

source: The function initializes player and enemy instances. After that it runs the game process in an endless loop. Once the player is defeated - it stops the execution.
uk: Функція ініціалізує екземпляри гравця та ворога. Після цього він запускає ігровий процес у нескінченному циклі. Як тільки гравець переможений - це зупиняє виконання.

source: Optional Enhancements
uk: Додаткові Вдосконалення

source: Add scores processor to show top-10 scores from a record table.
uk: Додайте процесор оцінок, щоб показати 10 найкращих результатів із таблиці записів.

source: Create game menu, for example: ::
uk: Створити меню гри, наприклад: ::

source: Store score table to the database instead of using text file.
uk: Зберігайте таблицю балів у базі даних замість використання текстового файлу.
