Repository: edu-python-course/edu-python-course.github.io
Catalog: src/_locales/*/LC_MESSAGES/appx.po
Languages: uk

source: ``Product`` class should implement ``get_total`` method to calculate a total price for a specified quantity of a product to purchase. Desired quantity will be passed as an optional argument of a numeric type (``int`` or ``float``). In case quantity argument is omitted - just use ``unit`` attribute value instead.
uk: Клас ``Product`` повинен реалізовувати метод ``get_total`` для обчислення загальної ціни на вказану кількість товару для покупки. Бажану кількість буде передано як необов'язковий аргумент числового типу (``int`` або ``float``). Якщо аргумент кількості пропущено, просто використовуйте значення атрибута ``unit``.

source: Code explanation
uk: Пояснення коду

source: Product model implementation
uk: Реалізація моделі товару

source: Variables
uk: Змінні

source: the name of a product
uk: назва товару

source: the price for a single product unit
uk: вартість однієї одиниці товару (прик. 3655, 500, 12999)

source: the size of a single product unit
uk: розмір одиниці окремого товару (прик. 1, 0.500, 12)

source: Instances of this class represent a product available for purchase.
uk: Цей клас представляє товари, які можна придбати в магазині.

source: Return the total price for a specified amount of a product
uk: Повертає загальну ціну за вказану кількість товару

source: Parameters
uk: Параметри

source: a quantity to purchase, defaults to None
uk: кількість для покупки, за замовчуванням None

source: Returns
uk: Повертає

source: total price for a specified amount of a product
uk: вартість вказаної кількості товару

source: Return type
uk: Тип повернення

source: If the quantity argument is omitted, unit attribute value should be used instead.
uk: Якщо аргумент кількості пропущено, замість нього слід використовувати значення атрибута одиниці.

source: Test cases
uk: Тестові приклади

source: Shopping Cart
uk: Кошик для покупок

source: This class represents the container for the products. It's main responsibility is to store information about the purchases and their amount (quantities).
uk: Цей клас представляє контейнер для продуктів. Його основна відповідальність - зберігати інформацію про покупки та їх кількість.

source: Each cart instance should store data about ``Product`` objects in it and corresponding quantity value for each individual product.
uk: Кожен екземпляр кошика повинен зберігати дані про об'єкти ``Продукт`` у ньому та відповідне значення кількості для кожного окремого продукту.

source: ``ShoppingCart`` should implement ``add_product`` method to put a specified quantity into a cart. ``quantity`` argument is optional, if omitted just uses ``Product.unit`` value instead.
uk: ``ShoppingCart`` має реалізувати метод ``add_product``, щоб помістити вказану кількість у кошик. Аргумент ``quantity`` є необов'язковим, якщо пропущено, просто використовує натомість значення ``Product.unit``.

source: ``ShoppingCart`` should implement ``get_total`` method to calculate the total price for the entire cart contents.
uk: ``ShoppingCart`` має застосувати метод ``get_total`` для обчислення загальної ціни всього вмісту кошика.

source: Shopping cart model implementation
uk: Реалізація моделі кошика

source: product appended to the shopping cart instance
uk: товар, доданий до екземпляра кошика

source: corresponding quantities for each product in cart
uk: відповідна кількість для товару у кошику

source: In general shopping cart is a container for products. Instances of this class handle product and corresponding quantity for each item inside a shopping cart instance.
uk: Загалом кошик для покупок – це контейнер для продуктів. Екземпляри цього класу обробляють продукт і відповідну кількість для кожного товару в екземплярі кошика для покупок.

source: Add product to the shopping cart
uk: Додає товар до кошика

source: a product instance to add to cart
uk: екземпляр товару, щоб додати до кошика

source: a quantity of a product to add. Defaults to the product unit value.
uk: кількість продукту для додавання. За замовчуванням значення одиниці продукту.

source: This method adds a product instance and corresponding quantity value to the cart.
uk: Цей метод додає екземпляр продукту та відповідне значення кількості до кошика.

source: Return the total price for all the product in the cart
uk: Повертає загальну вартість усіх товарів у кошику

source: total cart price
uk: загальна вартість кошика

source: Initialization, Representation and Type Casting
uk: Ініціалізація, представлення та приведення типів

source: It's difficult to set properties one-by-one, also it's not informative to get default objects string representations. It's time to fix this.
uk: Важко встановлювати властивості одну за одною, також неінформативноотримувати представлення рядків об'єктів за замовчуванням. Настав час це виправити.

source: ``Product`` should be initialized with all required data, no defaults.
uk: ``Product`` має бути ініціалізований усіма необхідними даними, без значень за замовчуванням.

source: Apply ``ShoppingCart.__init__`` to separate products and quantities between different carts.
uk: Застосуйте ``ShoppingCart.__init__``, щоб розділити продукти та кількість між різними візками.

source: Provide a human readable representations. For example:
uk: Надайте представлення, зрозумілі людині. Наприклад:

source: While casting product instance to ``str`` type it should be equal to its ``name`` attribute value.
uk: Під час приведення екземпляра продукту до типу ``str`` він повинен дорівнювати значенню атрибута ``name``.

source: While casting product instance to ``float`` type it should be equal to its ``price`` attribute value.
uk: Під час приведення екземпляра продукту до типу ``float`` він має дорівнювати значенню його атрибута ``price``.

source: While casting shopping cart instance to ``float`` type it should be equal to its total price value.
uk: Під час приведення екземпляра кошика для покупок до типу ``float`` він має дорівнювати загальному значенню ціни.

source: While casting shopping cart instance to ``bool`` consider it ``True`` if at least one product is attach to current cart.
uk: Під час трансляції екземпляра кошика для покупок до ``bool`` вважайте його ``True``, якщо принаймні один продукт приєднаний до поточного кошика.

source: Implement equality operator support for your objects:
uk: Запровадити підтримку оператора рівності для ваших об'єктів:

source: consider products equal if all their properties are the same
uk: вважати продукти рівними, якщо всі їхні властивості однакові

source: consider carts equal if products and corresponding quantities are the same
uk: вважати кошики рівними, якщо продукти та відповідна кількість однакові

source: Payment Processors
uk: Опрацювання платежів

source: The owner asked you to implement a flexible payment system. Purchasing the shopping card consists of several steps:
uk: Власник попросив вас запровадити гнучку платіжну систему. Придбання картки покупок складається з кількох кроків:

source: cart validation - it should not be empty or already purchased
uk: перевірка кошика - він не повинен бути порожнім або вже придбаним

source: payment validation - various payment types requires various validations
uk: підтвердження платежу - різні типи платежу вимагають різних перевірок

source: purchasing the cart
uk: купівля кошика

source: For now there are two payment types available in the store: cash and credit card, but they maybe extended at any time.
uk: Наразі в магазині доступні два типи оплати: готівка та кредитна картка, але їх можна продовжити в будь-який час.

source: Update the ``ShoppingCart`` class to handle ``purchased`` state. Make this property *protected*, since it should not be accessed outside the card instance.
uk: Оновіть клас ``ShoppingCart`` для обробки стану ``purchased``. Зробіть цю властивість *protected*, оскільки до неї не слід звертатися поза екземпляром картки.

source: Implement ``PaymentValidator`` class with ``is_valid`` that takes no arguments and return a value of a boolean type. This is an abstract class for the future usage.
uk: Реалізуйте клас ``PaymentValidator`` з ``is_valid``, який не приймає аргументів і повертає значення логічного типу. Це абстрактний клас для майбутнього використання.

source: Implement ``PaymentProcessor`` class with ``purchase`` method that takes a ``ShoppingCart`` object and returns nothing. This is an abstract class for the future usage.
uk: Реалізуйте клас ``PaymentProcessor`` з методом ``purchase``, який бере об'єкт ``ShoppingCart`` і нічого не повертає. Це абстрактний клас для майбутнього використання.

source: Inherit ``CashPaymentValidator`` from the base validator. The instances of this class are considered to be always valid.
uk: Успадкувати ``CashPaymentValidator`` від базового валідатора. Екземпляри цього класу вважаються завжди дійсними.

source: Inherit ``CodeValidator`` from the base validator.
uk: Успадкувати ``CodeValidator`` від основного валідатора.

source: The instances of this class are created with ``security_code`` argument.
uk: Екземпляри цього класу створено за допомогою аргументу ``security_code``.

source: ``is_valid`` method should ask a customer for a security code and check it against the stored value. In case codes are equal payment considered to be valid.
uk: Метод ``is_valid`` має запитати у клієнта код безпеки та перевірити його зі збереженим значенням. Якщо коди однакові, оплата вважається дійсною.

source: Create ``CashPaymentProcessor`` that combines ``CashValidator`` and ``PaymentProcessor`` behaviors. While purchasing the cart the messages "Processing cash payment..." and "Cart bill: {float total}" should be printed out.
uk: Створіть ``CashPaymentProcessor``, який поєднує поведінку ``CashValidator`` і ``PaymentProcessor``. Під час купівлі в кошику з'являються повідомлення "Обробка готівкового платежу..." і "Рахунок у кошику : {float total}" слід роздрукувати.

source: Create ``CardPaymentProcessor`` that combines ``CodeValidator`` and ``PaymentProcessor`` behaviors. While purchasing the cart the messages "Processing card payment..." and "Security code: {code}" should be printed out.
uk: Створіть ``CardPaymentProcessor``, який поєднує поведінку ``CodeValidator`` і ``PaymentProcessor``. Під час купівлі кошику слід роздрукувати повідомлення "Обробка платежу карткою..." і "Код безпеки : {code}".

source: More Enhancements for Shopping Carts
uk: Більше покращень для кошиків для покупок

source: Make your ``ShoppingCart`` an actual container
uk: Зробіть ваш ``ShoppingCart`` справжнім контейнером

source: Implement ``len(cart_obj)`` and make it return the number of products in the cart.
uk: Реалізуйте ``len(cart_obj)`` і змусьте його повертати кількість продуктів у кошику.

source: Implement ``cart[...]`` behavior to take a ``tuple`` containing product and corresponding quantity (type hint: ``Tuple[Product, Union[int, float]]``).
uk: Реалізуйте поведінку ``cart[...]``, щоб повертати ``tuple``, що містить товар та відповідну кількість (type hint: ``Tuple[Product, Union[int, float]]``).

source: Make your ``ShoppingCart`` iterable - let it provide the product instance and corresponding quantity for each iteration.
uk: Зробіть ваш ``ShoppingCart`` повторюваним - дозвольте йому надавати примірник продукту та відповідну кількість для кожної ітерації.

source: Avoid products duplication. In case someone tries to put the product into a cart and this product already is present there, do not it for the second time - adjust corresponding quantity value instead.
uk: Уникайте дублювання продуктів. Якщо хтось намагається покласти продукт у кошик, і цей продукт уже там присутній, не робіть цього вдруге - змініть натомість відповідне значення кількості.

source: Implement ``remove_product`` method to completely remove some product from the cart.
uk: Застосуйте метод ``remove_product``, щоб повністю видалити деякі продукти з кошика.

source: Implement ``sub_product`` to decrease some product quantity. If quantity is equal to 0 (zero) or less - remove product from the cart.
uk: Застосуйте ``sub_product``, щоб зменшити кількість продукту. Якщо кількість дорівнює 0 (нуль) або менше - вилучіть продукт із кошика.

source: Testing Software
uk: Тестування програмного забезпечення

source: Add autotests for ``ShoppingCart`` and ``Product`` models.
uk: Додати автотести для моделей ``ShoppingCart`` і ``Product``.

source: Tests should be located inside of "tests" directory.
uk: Тести мають бути розташовані всередині каталогу "tests".

source: ``pytest`` and ``coverage`` libraries will be used for testing.
uk: Для тестування використовуватимуться бібліотеки ``pytest`` і ``coverage``.

source: Project dependencies are to be updated.
uk: Залежності проекту потрібно оновити.

source: Setting up environment variables
uk: Встановлення змінних середовища

source: Issue - System Environment PATH
uk: Проблема - System Environment PATH

source: Library Management System - Specification
uk: Система Керування Бібліотекою - Специфікація

source: The Library Management System is a Django-based web application that offers a digital platform for managing and interacting with a library's collection. It streamlines the processes of book lending, returns, and inventory management, while ensuring easy access for users and librarians alike. Through this system, users can search for available books, place borrowing requests, and manage their borrowed items. Librarians, on the other hand, oversee the addition, update, and removal of book records, and can approve or decline borrowing requests. The system also supports diverse user roles, from regular members to staff and administrators, each with distinct capabilities.
uk: Система Керування Бібліотекою є веб-застосуванням на базі Django, яке пропонує цифрову платформу для управління та взаємодії з колекцією бібліотеки. Вона оптимізує процеси надання книг, повернення та управління інвентарем, забезпечуючи легкий доступ як для користувачів, так і для бібліотекарів. За допомогою цієї системи користувачі можуть шукати доступні книги, робити запити на позику та керувати позиченими предметами. Бібліотекарі, з свого боку, контролюють додавання, оновлення та видалення записів книг та можуть схвалювати або відхиляти запити на позику. Система також підтримує різноманітні ролі користувачів, від звичайних членів до персоналу та адміністраторів, кожен з яких має відмінні можливості.

source: A well-structured user interface ensures that all functionalities are easily accessible, making the library management process seamless and efficient. This project aims to merge traditional library functions with modern technological innovations, promoting efficiency and an enhanced user experience.
uk: Добре структурований користувацький інтерфейс забезпечує легкий доступ до всіх функцій, роблячи процес управління бібліотекою безперешкодним та ефективним. Цей проект має на меті об'єднати традиційні бібліотечні функції з сучасними технологічними інноваціями, сприяючи підвищенню ефективності та покращенню користувацького досвіду.

source: User roles
uk: Ролі користувачів

source: It is essential for developers to consider security aspects when implementing these roles to ensure that users cannot perform actions outside their designated role's scope.
uk: Розробникам важливо враховувати аспекти безпеки при впровадженні цих ролей, щоб гарантувати, що користувачі не зможуть виконувати дії, які виходять за рамки призначеної їм ролі.

source: Admins
uk: Адміністратори

source: Superusers have full control over the entire system. They can access and manage all functionalities provided by the Django admin site.
uk: Адміністратори мають повний контроль над усією системою. Вони можуть отримати доступ до всіх функцій, що надаються адмін-сайтом Django, і керувати ними.

source: Admins can create, modify, or delete any record within the application.
uk: Адміністратори можуть створювати, змінювати або видаляти будь-які записи в додатку.

source: Capabilities
uk: Можливості

source: Access Django admin site
uk: Доступ до адміністративного сайту Django

source: Librarians
uk: Бібліотекарі

source: Staff personnel are in charge of day-to-day operations within the library. They can add new books to the library's collection, manage existing books' details, and accept or decline borrow requests from regular users.
uk: Працівники бібліотеки відповідають за повсякденну роботу в бібліотеці. Вони можуть додавати нові книги до бібліотечної колекції, керувати даними про наявні книги, а також приймати або відхиляти запити від постійних користувачів.

source: Management of the library catalogue
uk: Управління бібліотечним каталогом

source: Add, modify or delete authors
uk: Додавати, змінювати або видаляти авторів

source: Add, modify or delete genres
uk: Додавати, змінювати або видаляти жанри

source: Add, modify or delete books' details
uk: Додавати, змінювати або видаляти дані про книги

source: Review borrow requests from regular users
uk: Переглядати запити на позичення від користувачів

source: Accept or decline borrow requests
uk: Приймати або відхиляти запити на позичення

source: Register returned books and update their status
uk: Реєструвати повернені книги та оновлювати їх статус

source: Regular
uk: Звичайний

source: Regular registered users are the members of the library. They can search books, request to borrow them, and are responsible for returning borrowed books on time.
uk: Постійні зареєстровані користувачі є членами бібліотеки. Вони можуть шукати книги, запитувати їх, а також несуть відповідальність за своєчасне повернення позичених книг.

source: Browse the books' catalogue
uk: Переглядати каталог книг

source: View details of a book
uk: Переглядати деталі книги

source: Search books
uk: Шукати книги

source: Request to borrow available books
uk: Робити запит на позичення доступних книжок

source: Check due date for returned books
uk: Перевіряти термін повернення запозичених книжок

source: Return borrowed books
uk: Повертати запозичені книги

source: Anonymous
uk: Анонімні

source: Anonymous users are visitors who haven't logged into the system.
uk: Анонімні користувачі - це відвідувачі, які не ввійшли в систему.

source: Access to the registration or login pages
uk: Доступ до сторінок реєстрації або входу

source: Models
uk: Моделі

source: Author model
uk: Модель авторів

source: The ``Author`` model captures the details of the person, or group responsible for creating the book.
uk: Модель ``Author`` фіксує інформацію про особу або групу осіб, відповідальних за створення книги.

source: Attributes
uk: Атрибути

source: The full name of the author. This should be limited to 255 characters.
uk: Повне ім'я автора. Не більше 255 символів.

source: A brief biography or description of the author.
uk: Коротка біографія або опис автора.

source: Genre model
uk: Модель жанра

source: The ``Genre`` model represents the category or type of content a book belongs to, such as "Fiction", "Non-fiction", "Science", "Romance" etc. Since a book can belong to more than one category at a time, it is implemented as a dedicated model.
uk: Модель ``Genre`` представляє категорію або тип контенту, до якого належить книга, наприклад, "Художня література", "Нехудожня література", "Наука", "Романтика" тощо. Оскільки книга може належати до кількох категорій одночасно, вона реалізована як окрема модель.

source: The name of the genre.
uk: Назва жанру.

source: Book model
uk: Модель книги

source: The ``Book`` model represents a physical book in the library's collection. Each book record captures essential bibliographic information, as well as details related to its current status in the library (e.g. available, borrowed etc.).
uk: Модель ``Book`` представляє фізичну книгу в бібліотечній колекції. Кожен запис про книгу містить основну бібліографічну інформацію, а також деталі, пов'язані з її поточним статусом у бібліотеці (наприклад, доступна, позичена тощо).

source: The name or title of the book (255 characters or fewer).
uk: Назва книги (255 символів або менше).

source: A brief description or synopsis of the book.
uk: Короткий опис або синопсис книги.

source: International Standard Book Number, a unique identifier for books.
uk: International Standard Book Number, унікальний ідентифікатор для книг..

source: Current available status of the book. Either ``True`` or ``False``. Books are available by default.
uk: Поточний статус доступності книги. Або ``True``, або ``False``. За замовчуванням книги доступні.

source: The date when the book was published.
uk: Дата, коли книга була опублікована.

source: The entity or company responsible for the production and distribution of the book.
uk: Організація або компанія, відповідальна за виробництво та розповсюдження книги.

source: The category or type of content the book falls under (e.g., Fiction, Non-Fiction, Science).
uk: Категорія або тип контенту, до якого належить книга (наприклад, художня література, нон-фікшн, наукова література).

source: The name of the person or group responsible for creating the content of the book.
uk: Ім'я особи або групи осіб, відповідальних за створення змісту книги.

source: The user who has currently borrowed the book, if applicable.
uk: Користувач, який наразі позичив книгу, якщо це можливо.

source: Borrow request model
uk: Модель запиту на позику

source: The ``BorrowRequest`` model captures the intent of a user to borrow a specific book. It tracks the status of the request, whether it's pending, approved, declined, or completed.
uk: Модель ``BorrowRequest`` фіксує намір користувача взяти конкретну книгу. Вона відстежує статус запиту: очікує, схвалений, відхилений чи завершений.

source: A reference to a book to be borrowed.
uk: Посилання на книгу, яку потрібно взяти.

source: A reference to a user who wants to borrow a book.
uk: Посилання на користувача, який хоче взяти книгу.

source: The current status of the request.
uk: Поточний статус заявки.

source: The status constants should be encapsulated within the ``BorrowRequest`` model.
uk: Константи стану повинні бути інкапсульовані в моделі ``BorrowRequest``.

source: A flag indicating if a borrow request was overdue.
uk: Прапорець, що вказує на те, чи був запит на позику прострочений.

source: The date the borrow request was made. This is required.
uk: Дата подання запиту на позику. Це обов'язкова інформація.

source: The date the request was approved, if applicable. Optional.
uk: Дата схвалення запиту, якщо це можливо. Необов'язково.

source: The date by which the book should be returned. Optional, should only be set if the request if approved.
uk: Дата, до якої книга має бути повернута. Необов'язкова, має бути вказана лише у разі схвалення запиту.

source: The date the book was returned and the borrowing request was completed. Optional, should only be set if the request has reached the "Complete" status.
uk: Дата повернення книги та завершення запиту на позику. Необов'язкова, має бути встановлена тільки якщо запит досяг статусу "Завершено".

source: Book to author
uk: Книга до автору

source: Each ``Author`` can be associated with multiple ``Books``, and each ``Book`` can have **one or more** ``authors``. This establishes a **many-to-many** relationship between the two entities.
uk: Кожен ``Автор`` може бути пов'язаний з декількома ``Книгами``, а кожна ``Книга`` може мати **одного або більше** ``авторів``. Це встановлює зв'язок **багато-до-багатьох** між цими двома сутностями.

source: Book to genre
uk: Книга до жанру
