Repository: edu-python-course/edu-python-course.github.io
Catalog: src/_locales/*/LC_MESSAGES/intro.po
Languages: uk

source: Contents
uk: Зміст

source: There are a whole bunch of common programming tasks that are easy in Python. For someone who is not yet a programmer, who wants to become a programmer, for those people Python is particularly easy to get. In Python, every symbol you type is essential.
uk: Існує ціла купа звичайних програмних завдань, які легко виконати на Python. Для тих, хто ще не програміст, хто хоче стати програмістом, для цих людей Python особливо легко отримати. У Python кожен символ, який ви вводите, є важливим.

source: |guido| Guido van Rossum
uk: |guido| Гвідо ван Россум

source: Introduction to Python
uk: Введення в Python

source: |python| **Python** is a high-level, interpreted scripting language. It was created in the early 1990s by Guido van Rossum at Stichting Mathematisch Centrum (CWI, see https://www.cwi.nl/) in the Netherlands as a successor of a language called ABC. Guido remains Python’s principal author, although it includes many contributions from others.
uk: |python| **Python** — це інтерпретована скриптова мова високого рівня. Її було створено на початку 1990-х років Гвідо ван Россумом у Stichting Mathematisch Centrum (CWI, див. https://www.cwi.nl/) у Нідерландах як наступника мови під назвою ABC. Гвідо залишається головним автором Python, хоча мова містить багато внесків від інших авторів.

source: Python 2.0 was released in 2000, and the 2.x versions were the prevalent releases until December 2008. At that time, the development team made the decision to release version 3.0, which contained a few relatively small but significant changes that were not backward compatible with the 2.x versions. Python 2 and 3 are very similar, and some features of Python 3 have been backported to Python 2. But in general, they remain not quite compatible.
uk: Python 2.0 був випущений у 2000 році, а версії 2.x були поширеними випусками до грудня 2008 року. У той час команда розробників прийняла рішення випустити версію 3.0, яка містила кілька відносно невеликих, але значних змін, які не були зворотно сумісними. з версіями 2.x. Python 2 і 3 дуже схожі, і деякі функції Python 3 були перенесені в Python 2. Але загалом вони залишаються не зовсім сумісними.

source: Both Python 2 and 3 have continued to be maintained and developed, with periodic release updates for both. However, an official End Of Life date of January 1, 2020 has been established for Python 2, after which time it will no longer be maintained.
uk: І Python 2, і 3 продовжували підтримуватися та розроблятися з періодичними оновленнями для обох. Однак для Python 2 було встановлено офіційну дату завершення життя 1 січня 2020 року, після якої він більше не підтримуватиметься.

source: Python is still maintained by a core development team at the Institute, and Guido is still in charge, having been given the title of BDFL (Benevolent Dictator For Life) by the Python community. The name Python, by the way, derives not from the snake, but from the British comedy troupe Monty Python’s Flying Circus, of which Guido was, and presumably still is, a fan. It is common to find references to Monty Python sketches and movies scattered throughout the Python documentation.
uk: Python все ще підтримується основною командою розробників в Інституті, і Гвідо все ще керує, отримавши звання BDFL (Доброзичливий диктатор на все життя) від спільноти Python. Назва Python, до речі, походить не від імені змії, а від британської комедійної трупи Monty Python’s Flying Circus, шанувальником якої був і, мабуть, залишається Гвідо. Посилання на ескізи та фільми Monty Python часто можна знайти в документації Python.

source: Here are some significant facts about Python.
uk: Ось кілька важливих фактів про Python.

source: Python is popular
uk: Python популярний

source: Python has been growing in popularity over the last few years. The 2018 Stack Overflow Developer Survey ranked Python as the 7th most popular and the number one most wanted technology of the year. By the end of Q-4 in 2022 Python is the **top** language on all GitHut metrics :cite:`github:stats`.
uk: Python набирає популярності протягом останніх кількох років. Опитування розробників Stack Overflow 2018 року поставило Python на сьоме місце за популярністю та на перше місце серед найпопулярніших технологій року. До кінця четвертого кварталу 2022 року Python є **найпопулярнішою** мовою за всіма показниками GitHut :cite:`github:stats`.

source: Here are some logos of unknown companies across the globe who uses Python:
uk: Ось кілька логотипів невідомих компаній по всьому світі, які використовують Python:

source: Python is interpreted
uk: Python інтерпретується

source: Many languages are compiled, meaning the source code you create needs to be translated into machine code, the language of your computer’s processor, before it can be run. Programs written in an interpreted language are passed straight to an interpreter that runs them directly.
uk: Багато мов компілюється, тобто вихідний код, який ви створюєте, має бути переведений у машинний код, мовою процесора вашого комп’ютера, перш ніж його можна буде запустити. Програми, написані на інтерпретованій мові, передаються прямо до інтерпретатора, який їх безпосередньо запускає.

source: This makes for a quicker development cycle because you just type in your code and run it, without the intermediate compilation step.
uk: Це забезпечує швидший цикл розробки, оскільки ви просто вводите код і запускаєте його без проміжного етапу компіляції.

source: Python is free
uk: Python безкоштовний

source: The Python interpreter is developed under an OSI-approved open-source license, making it free to install, use, and distribute, even for commercial purposes.
uk: Інтерпретатор Python розроблено відповідно до схваленої OSI ліцензії з відкритим вихідним кодом, що робить його безкоштовним для встановлення, використання та розповсюдження навіть у комерційних цілях.

source: Python is portable
uk: Python портативний

source: Because Python code is interpreted and not compiled into native machine instructions, code written for one platform will work on any other platform that has the Python interpreter installed. This is true of any interpreted language, not just Python.
uk: Оскільки код Python інтерпретується, а не компілюється у власні машинні інструкції, код, написаний для однієї платформи, працюватиме на будь-якій іншій платформі, де встановлено інтерпретатор Python. Це стосується будь-якої інтерпретованої мови, а не лише Python.

source: Python is simple
uk: Python простий

source: As programming languages go, Python is relatively uncluttered, and the developers have deliberately kept it that way. A rough estimate of the complexity of a language can be gleaned from the number of keywords or reserved words in the language. These are words that are reserved for special meaning by the compiler or interpreter because they designate specific built-in functionality of the language. There are only 35 :cite:`docs-python:keywords` in Python and they are:
uk: Що стосується мов програмування, Python є відносно незавантаженим, і розробники навмисно залишили його таким. Приблизну оцінку складності мови можна отримати з кількості ключових або зарезервованих слів у мові. Це слова, які зарезервовані для спеціального значення компілятором або інтерпретатором, оскільки вони позначають конкретні вбудовані функції мови. У Python лише 35 :cite:`docs-python:keywords`, і вони:

source: Python is general purpose
uk: Python є універсальним

source: Python is everywhere. Talking more specific common scopes for Python developers are :cite:`python-usage`:
uk: Python всюди. Говорячи про більш конкретні загальні області для розробників Python, це :cite:`python-usage`:

source: Web Scraping Applications
uk: Програми для сканування веб-сторінок

source: Data Science Solutions
uk: Рішення для Data Science

source: Machine Learning Applications
uk: Програми машинного навчання

source: Web Development
uk: Веб-розробка

source: Game Development
uk: Розробка ігор

source: Scientific and Numeric Applications
uk: Наукові та обчислювальні програми

source: Image Design and Graphic Design Applications
uk: Програми для обробки зображень та графіки

source: Finance Fintech Platform
uk: Банківські та фінансові сервіси

source: Operating Systems
uk: Операційні системи

source: Install Python
uk: Встановлення Python

source: The `Python wiki <https://wiki.python.org/moin/BeginnersGuide/Download>`_ briefly describes the installation process.
uk: `Вікі Python <https://wiki.python.org/moin/BeginnersGuide/Download>`_ коротко описує процес встановлення.

source: To become a **true** professional, you need a special software called :abbr:`IDE (Integrated Development Environment)` or at least a code editor supporting syntax highlight. Refer :doc:`/appx/code_edit` for more information.
uk: Щоб стати **справжнім** професіоналом, вам потрібне спеціальне програмне забезпечення під назвою :abbr:`IDE (Integrated Development Environment)` або принаймні редактор коду, який підтримує підсвічування синтаксису. Зверніться до :doc:`/appx/code_edit` для отримання додаткової інформації.

source: On most Linux distros Python comes pre-installed and/or all distro have it available in their package repository (I haven't seen the one which does have). The installation process depends on the distro, but here are some examples how you can install it:
uk: У більшості дистрибутивів Linux Python постачається попередньо встановленим і/або в усіх дистрибутивах він доступний у сховищі пакетів (я не бачив того, у якому є). Процес встановлення залежить від дистрибутива, але ось кілька прикладів того, як його можна встановити:

source: For newer versions of MacOS Python is no longer included by default and you will have to download and install it.
uk: Для нових версій MacOS Python більше не включено за замовчуванням, і вам доведеться завантажити та встановити його.

source: The process is described at: `Using Python on a Mac`_.
uk: Процес описано в: `Використання Python на Mac`_.

source: Briefly, you are invited to visit `downloads`_ and download the latest stable version of Python. A "universal binary" build of Python runs natively on Mac's new Intel and legacy PPC CPUs.
uk: Коротко, вас запрошують відвідати `завантаження`_ та завантажити останню стабільну версію Python. "Універсальна двійкова" збірка Python працює нативно на нових процесорах Intel і застарілих процесорах PPC від Mac.

source: After the installation you would get:
uk: Після встановлення ви отримаєте:

source: `Python 3.x` folder in `Applications` folder. Standard development environment (`IDLE`) and `PythonLauncher` included.
uk: Папка `Python 3.x` в папці `Програми`. Включено стандартне середовище розробки (`IDLE`) і `PythonLauncher`.

source: A framework `/Library/Frameworks/Python.framework` included libraries and executables.
uk: Фреймворк `/Library/Frameworks/Python.framework` що включає бібліотеки та виконувані файли.

source: Install from Homebrew
uk: Встановити з Homebrew

source: Python for MacOS is available via Homebrew. You are to search `formulae`_ for the latest available version. In general, it's as easy as:
uk: Python для MacOS доступний через Homebrew. Ви повинні шукати `формули`_ для останньої доступної версії. Загалом, це так само просто:

source: As for MacOS, here is the official documentation: `Using Python on Windows`_.
uk: Що стосується MacOS, ось офіційна документація: `Using Python on Windows`_.

source: For Windows' users the stable release is available from `downloads`_. Just download the installer and proceed to common steps to install software.
uk: Для користувачів Windows стабільний випуск доступний із `завантажень`_. Просто завантажте програму встановлення та перейдіть до стандартних кроків для встановлення програмного забезпечення.

source: It's recommended to **Add Python3.x to PATH**, this will avoid problems at the beginning of your journey with Python
uk: Рекомендовано **Додати Python3.x до PATH**, це дозволить уникнути проблем на початку вашого шляху з Python

source: Python installer first page
uk: Перша сторінка інсталятора Python

source: Going on with **Install Now**:
uk: Продовжуємо з **Встановити зараз**:

source: Python will be installed to your user directory
uk: Python буде встановлено у ваш каталог користувача

source: Python Launcher will be installed according to the option at the bottom of the page
uk: Python Launcher буде встановлено відповідно до опції внизу сторінки

source: Using **Customize installation** will perform an *all-users* installation.
uk: Використання **Налаштувати інсталяцію** виконає інсталяцію *для всіх користувачів*.

source: Removing the MAX_PATH Limitation
uk: Видалення обмеження MAX_PATH

source: Windows historically has limited path lengths to 260 characters. This meant that paths longer than this would not resolve and errors would result. In the latest versions of Windows, this limitation can be expanded to approximately 32,000 characters. This allows the open() function, the os module and most other path functionality to accept and return paths longer than 260 characters.
uk: Історично у Windows довжина шляху обмежена 260 символами. Це означало, що шляхи, довші за цей, не вирішуватимуться, і спричинятимуться помилки. В останніх версіях Windows це обмеження можна розширити приблизно до 32 000 символів. Це дозволяє функції open(), модулю os і більшості інших функцій шляху приймати та повертати шляхи, довші за 260 символів.

source: You will need PC administrator assistance to perform this action.
uk: Для виконання цієї дії вам знадобиться допомога адміністратора ПК.

source: Install from the Microsoft Store
uk: Встановити з Microsoft Store

source: You can install from the Microsoft Store in two steps:
uk: Ви можете встановити з Microsoft Store у два кроки:

source: Open the Microsoft Store app and search for ``Python`` The result should look like:
uk: Відкрийте програму Microsoft Store і знайдіть ``Python``. Результат має виглядати так:

source: Microsoft Store - search results for "Python"
uk: Microsoft Store - результати пошуку для "Python"

source: Select ``Python 3.9`` or the higher available version.
uk: Виберіть ``Python 3.9`` або вищу доступну версію.

source: Click **GET** and wait until the installer is downloaded. The installation process should run automatically. Follow the installer's instructions.
uk: Натисніть **GET** і дочекайтеся завантаження інсталятора. Процес встановлення має запуститися автоматично. Дотримуйтесь інструкцій інсталятора.

source: Online Interpreters
uk: Онлайн Інтерпретатори

source: Installing or updating Python on your computer is the first step to becoming a Python programmer :cite:`realpython:install-and-setup`.
uk: Встановлення або оновлення Python на вашому комп’ютері – це перший крок до того, щоб стати програмістом Python :cite:`realpython:install-and-setup`.

source: But if you cannot install Python at the moment for some reason, are can go with online interpreters. `repl.it <https://replit.com/>`_ provides the ability to create and store Python scripts (they are called *repl* here) for free.
uk: Але якщо ви не можете встановити Python на даний момент з якоїсь причини, можна скористатися онлайн-інтерпретаторами. `repl.it <https://replit.com/>`_ надає можливість безкоштовно створювати та зберігати сценарії Python (тут вони називаються *repl*).

source: Interacting with Python Interpreter
uk: Взаємодія з інтерпретатором Python

source: It’s time to write some Python code!
uk: Настав час написати код на Python!

source: In short there are three major ways to do something with Python:
uk: Коротше кажучи, є три основні способи зробити щось з Python:

source: interactive Python console
uk: інтерактивна консоль Python

source: running code from file [#]_
uk: запуск коду з файлу [#]_

source: use online editors (like `repl.it <https://repl.it>`_)
uk: використовувати онлайн-редактори (наприклад, `repl.it <https://repl.it>`_)

source: Using Python interpreter interactively
uk: Використання інтерпретатора Python в інтерактивному режимі

source: Using :abbr:`REPL (Read-Eval-Print-Loop)` environment is the most straight forward way to start talking to Python. This simply means starting up the interpreter and typing commands to it directly :cite:`realpython:interact`. The interpreter:
uk: Використання середовища :abbr:`REPL (Read-Eval-Print-Loop)` є найпростішим способом почати спілкування з Python. Це просто означає запуск інтерпретатора та введення команд безпосередньо в нього :cite:`realpython:interact`. Перекладач:

source: Reads the command you enter
uk: Читає введену команду

source: Evaluates and executes it
uk: Оцінює та виконує її

source: Prints the output (if any) back to the console
uk: Друкує результат (якщо є) назад на консоль

source: Loops back and repeats
uk: Повертається назад та повторює

source: Starting the interpreter
uk: Запуск інтерпретатора

source: In :abbr:`GUI (Graphic User Interface)` environment, it's likely that the installer placed a shortcut on the desktop to launch the Python.
uk: У середовищі :abbr:`GUI (Graphic User Interface)`, імовірно, інсталятор розмістив ярлик на робочому столі для запуску Python.

source: For example in Windows the interpreter can be found in the **Start** menu labeled **Python 3.x**:
uk: Наприклад, у Windows інтерпретатор можна знайти в меню **Пуск** з позначкою **Python 3.x**:

source: Windows start menu Python group
uk: Меню Пуск Windows Група Python

source: In case you are getting error saying python is not installed, but you are sure that the interpreter **is installed** - this means you have no Python in your ``PATH``. Message may look like: ``'python' is not recognized as an internal or external command`` / ``python: command not found``
uk: Якщо ви отримуєте повідомлення про те, що python не встановлено, але ви впевнені, що інтерпретатор **встановлено**, це означає, що у вашому ``PATH`` немає Python. Повідомлення може виглядати так: ``'python' не розпізнається як внутрішня або зовнішня команда`` / ``python: команда не знайдена``

source: Refer :doc:`/appx/env_path` for problem solution.
uk: Зверніться до :doc:`/appx/env_path` для вирішення проблеми.

source: The alternative is to launch from a terminal window:
uk: Альтернативою є запуск із вікна терміналу:

source: **Command Prompt** in Windows
uk: **Командний рядок** у Windows

source: **Terminal** both in macOS and Linux
uk: **Термінал** в macOS і Linux

source: Start Python via Command Prompt
uk: Запуск Python через командний рядок

source: Start Python via Terminal
uk: Запуск Python через термінал

source: Running code
uk: Запускаємо код

source: Put the Python code in interactive console and press enter to execute it.
uk: Помістіть код Python в інтерактивну консоль і натисніть enter, щоб виконати його.

source: Ensure that the ``>>>`` prompt is displayed and the cursor is pointed after it
uk: Переконайтеся, що підказка ``>>>`` відображається, а курсор знаходиться після неї

source: Type the command ``print("Hello, World!")``
uk: Введіть команду ``print("Hello, World!")``

source: Press enter
uk: Натисніть enter

source: Your session should look like:
uk: Ваш сеанс має виглядати так:

source: If you've seen string "Hello, World!" printed back, congrats - you've run your first program in Python.
uk: Якщо ви бачили рядок "Hello, World!" надруковано, вітаємо - ви запустили свою першу програму на Python.

source: Exiting the interpreter
uk: Вихід з інтерпретатора

source: To exit the interactive console type "exit" and hit enter.
uk: Щоб вийти з інтерактивної консолі, введіть "exit" і натисніть Enter.

source: Running code from file
uk: Запуск коду з файлу

source: A Python script is a reusable set of code. It is essentially a Python program - a sequence of Python instructions - contained in a file. You can run the program by specifying the name of the script file to the interpreter.
uk: Сценарій Python — це багаторазовий набір коду. По суті, це програма на Python – послідовність інструкцій Python, які містяться у файлі. Ви можете запустити програму, вказавши інтерпретатору назву файлу сценарію.

source: Python scripts are just plain text, so you can edit them with any text editor. If you have a favorite programmer’s editor that operates on text files, it should be fine to use. Otherwise here are some options for the first time:
uk: Сценарії Python — це звичайний текст, тому ви можете редагувати їх у будь-якому текстовому редакторі. Якщо у вас є улюблений програмістський редактор, який працює з текстовими файлами, його цілком можна використовувати. Інакше ось кілька варіантів для першого разу:

source: Using whatever editor create a script file called ``hello.py`` and put the code in it:
uk: Використовуючи будь-який редактор, створіть файл сценарію під назвою ``hello.py`` і помістіть у нього код:

source: Save file keeping track on the directory you choose to save into. Now, open the terminal or command prompt in this directory.
uk: Збережіть файл, відстежуючи його в каталозі, який ви вибрали для збереження. Тепер відкрийте термінал або командний рядок у цьому каталозі.

source: In window you may open Command Prompt in the directory by typing "cmd" to the address bar in explorer.
uk: У вікні ви можете відкрити командний рядок у каталозі, ввівши "cmd" в адресний рядок провідника.

source: In the terminal (or command prompt) type:
uk: У терміналі (або командному рядку) введіть:

source: Python will print string "Hello, World!". Your session should look like:
uk: Python надрукує рядок "Hello, World!". Ваш сеанс має виглядати так:

source: Files containing Python code are called *modules*.
uk: Файли, що містять код Python, називаються *модулями*.
