Repository: edu-python-course/edu-python-course.github.io
Catalog: src/_locales/*/LC_MESSAGES/vcs.po
Languages: uk

source: *~/.gitconfig* or *~/.config/git/config* file: Values specific personally to you, the user. You can make Git read and write to this file specifically by passing the ``--global`` option, and this affects all of the repositories you work with on your system.
uk: *~/.gitconfig* або *~/.config/git/config* файл: Значення, характерні особисто для вас, користувача. Ви можете змусити Git'а читати і писати до цього файлу спеціально, передавши опцію ``--global``, і це вплине на всі сховища, з якими ви працюєте у вашій системі.

source: *config* file in the Git directory (that is, *.git/config*) of whatever repository you're currently using: Specific to that single repository. You can force Git to read from and write to this file with the ``--local`` option, but that is in fact the default. Unsurprisingly, you need to be located somewhere in a Git repository for this option to work properly.
uk: файл *config* у каталозі Git (тобто *.git/config*) того сховища, яке ви зараз використовуєте: Специфічний для цього окремого сховища. Ви можете змусити Git'а читати з цього файлу і писати до нього за допомогою опції ``--local``, але за замовчуванням так і є. Не дивно, що для правильної роботи цієї опції вам потрібно знаходитися десь у сховищі Git'а.

source: Each level overrides values in the previous level, so values in *.git/config* trump those in *[path]/etc/gitconfig*.
uk: Кожен рівень перевизначає значення попереднього рівня, тому значення у *.git/config* мають перевагу над значеннями у *[path]/etc/gitconfig*.

source: You can view all of your settings and where they are coming from using:
uk: Ви можете переглянути всі свої налаштування і те, звідки вони надходять, використовуючи:

source: Your identity
uk: Ваша особистість

source: The first thing you should do when you install Git is to set your user name and email address. This is important because every Git commit uses this information.
uk: Перше, що вам слід зробити під час встановлення Git'у, це вказати своє ім'я користувача та адресу електронної пошти. Це важливо, оскільки кожна фіксація Git'а використовує цю інформацію.

source: Tagging
uk: Тегування

source: Like most VCSs, Git has the ability to tag specific points in a repository's history as being important. Typically, people use this functionality to mark release points (``v1.0``, ``v2.0`` and so on).
uk: Як і більшість VCS, Git має можливість позначати певні моменти в історії сховища як важливі. Зазвичай люди використовують цю функцію для позначення точок релізу (``v1.0``, ``v2.0`` і так далі).

source: Listing tags
uk: Перелік тегів

source: Listing the existing tags in Git is straightforward. Just type ``git tag`` (with optional ``-l`` or ``--list``).
uk: Перерахувати існуючі теги у Git'і дуже просто. Просто введіть ``git tag`` (з необов'язковим ``-l`` або ``--list``).

source: This command lists the tags in alphabetical order, the order in which they are displayed has no real importance. You can also search for tags that match a particular pattern. The Git source repo, for instance contains more than 500 tags. If you're interested only in looking at the 1.8.4 series, you can run this:
uk: Ця команда перелічує мітки в алфавітному порядку, порядок їх відображення не має особливого значення. Ви також можете шукати теги, які відповідають певному шаблону. Наприклад, сховище коду Git містить понад 500 тегів. Якщо вас цікавить лише серія 1.8.4, ви можете виконати цю команду:

source: Creating tags
uk: Створення тегів

source: Git supports two types of tags: *lightweight* and *annotated*.
uk: Git підтримує два типи тегів: *легкі* та *анотовані*.

source: A lightweight tag is very much like a branch that doesn't change -- it's just a pointer to a specific commit.
uk: Полегшений тег дуже схожий на гілку, яка не змінюється -- це просто вказівник на конкретний комміт.

source: Annotated tags, however, are stored as full objects in the Git database. They're checksummed; contain the tagger name, email, and date; have a tagging message; and can be signed and verified with GBU Privacy Guard (GPG). It's generally recommended that you create annotated tags so you can have all this information; but if you want a temporary tag or for some reason don't want to keep the other information, lightweight tags are available too.
uk: Анотовані мітки, однак, зберігаються як повноцінні об'єкти в базі даних Git. Вони мають контрольну суму, містять ім'я тегувальника, електронну пошту та дату, мають повідомлення про тегування, а також можуть бути підписані та перевірені за допомогою GBU Privacy Guard (GPG). Зазвичай рекомендується створювати анотовані мітки, щоб мати всю цю інформацію; але якщо вам потрібна тимчасова мітка або з якихось причин ви не хочете зберігати іншу інформацію, доступні також полегшені мітки.

source: Annotated tags
uk: Анотовані теги

source: Creating an annotated tag in Git is simple. The easiest way is to specify ``-a`` when you run the ``tag`` command:
uk: Створити анотовану мітку в Git'і дуже просто. Найпростіший спосіб - вказати ``-a`` при виконанні команди ``tag``:

source: Lightweight tags
uk: Легкі мітки

source: Another way to tag commits is with a lightweight tag. this is basically the commit checksum stored in a file -- no other information is kept. To create a lightweight tag, don't supply any of the ``-a``, ``-s``, or ``-m`` options, just provide a tag name:
uk: Інший спосіб позначення коммітів - використання полегшених тегів. Це, по суті, контрольна сума комміту, яка зберігається у файлі - ніяка інша інформація не зберігається. Щоб створити полегшену мітку, не вказуйте жодної з опцій ``-a``, ``-s`` або ``-m``, просто вкажіть назву мітки:

source: Tagging later
uk: Відмітити пізніше

source: You can also tag commits after you're moved past them.
uk: Ви також можете позначати коміти після того, як ви пройшли повз них.

source: Deleting tags
uk: Видалення тегів

source: To delete a tag on your local repository, you can use ``git tag -d <tagname>``.
uk: Щоб видалити тег у вашому локальному сховищі, ви можете скористатися ``git tag -d <tagname>``.

source: Checking out tags
uk: Перевірка тегів

source: If you want to view the versions of files a tag is pointing to, you can do a ``git checkout`` of that tag, although this puts your repository in "detached HEAD" state, which has some ill side effects:
uk: Якщо ви хочете переглянути версії файлів, на які вказує тег, ви можете виконати ``git checkout`` цього тегу, хоча це переводить ваше сховище у стан "відокремленої ГОЛОВИ", що має деякі погані побічні ефекти:

source: In "detached HEAD" state, if you make changes and then create a commit, the tag will stay the same, but your new commit won’t belong to any branch and will be unreachable, except by the exact commit hash. Thus, if you need to make changes -- say you’re fixing a bug on an older version, for instance -- you will generally want to create a branch:
uk: У стані "detached HEAD", якщо ви внесете зміни, а потім створите коміт, тег залишиться незмінним, але ваш новий коміт не належатиме до жодної гілки і буде недоступним, окрім як за точним хешем коміту. Таким чином, якщо вам потрібно внести зміни - скажімо, ви виправляєте ваду у старій версії - вам, як правило, краще створити гілку:
