Repository: edu-python-course/edu-python-course.github.io
Catalog: src/_locales/*/LC_MESSAGES/vcs.po
Languages: uk

source: The first thing you need to do is set up a free user account. Visit `GitHub`_ and press "Sign Up" button. The GitHub will lead you through the account creation process. Just follow the hints and provide an email address, username and a strong password.
uk: Перше, що вам потрібно зробити, це створити безкоштовний обліковий запис користувача. Відвідайте `GitHub`_ і натисніть кнопку "Зареєструватися". GitHub проведе вас через процес створення облікового запису. Просто дотримуйтесь підказок і вкажіть адресу електронної пошти, ім'я користувача та надійний пароль.

source: About authentication to GitHub
uk: Про автентифікацію на GitHub

source: Starting in March 2023 and through the end of 2023, GitHub gradually began to require all users who contribute code on GitHub to enable two-factor authentication (2FA).
uk: Починаючи з березня 2023 року і до кінця 2023 року, GitHub поступово почав вимагати від усіх користувачів, які публікують код на GitHub, увімкнути двофакторну автентифікацію (2FA).

source: Connect with SSH
uk: Підключення за допомогою SSH

source: You can access and write data in repositories on GitHub using :abbr:`SSH (Secure Shell Protocol)`. When you connect to via SSH, you authenticate using a private key file on your local machine.
uk: Ви можете отримати доступ до даних у репозиторіях на GitHub і писати їх за допомогою :abbr:`SSH (Secure Shell Protocol)`. При підключенні по SSH ви автентифікуєтесь за допомогою файлу приватного ключа на вашому локальному комп'ютері.

source: Generating a new SSH key
uk: Генерація нового SSH-ключа

source: You can generate a new SSH key on your local machine. After you do that, you can add the **public** key to your account on GitHub to enable authentication for Git operations over SSH.
uk: Ви можете згенерувати новий SSH-ключ на своїй локальній машині. Після цього ви можете додати **public** ключ до свого облікового запису на GitHub, щоб увімкнути автентифікацію для операцій з Git'ом через SSH.

source: Open terminal (git-bash will suite for Windows users)
uk: Відкритий термінал (для користувачів Windows підійде git-bash)

source: Run command:
uk: Виконати команду:

source: If you are using a legacy system that doesn't support the **Ed25519** algorithm, use:
uk: Якщо ви використовуєте застарілу систему, яка не підтримує алгоритм **Ed25519**, використовуйте його:

source: When you're prompted to "Enter a file in which to save the key", you can press **Enter** to accept the default file location.
uk: Коли з'явиться запит "Введіть файл для збереження ключа", ви можете натиснути **Enter**, щоб прийняти розташування файлу за замовчуванням.

source: Type a secure passphrase, if you want -- this is an extra layer of security.
uk: Введіть безпечну парольну фразу, якщо хочете -- це додатковий рівень безпеки.

source: This will create a new SSH key, using the provided email as label.
uk: Буде створено новий SSH-ключ, з використанням наданої адреси електронної пошти як мітки.

source: Navigate to ssh key location -- ".ssh" folder at your homedir by default and ensure there are two files generated:
uk: Перейдіть до розташування ключа ssh -- теки ".ssh" у вашому домашньому каталозі за замовчуванням і переконайтеся, що згенеровано два файли:

source: **id_ALGORITHM** (e.g. "id_rsa", "id_ed252519" etc.)
uk: **id_ALGORITHM** (наприклад, "id_rsa", "id_ed252519" тощо).

source: **id_ALGORITHM.pub** (e.g. "id_rsa.pub", "id_ed25519.pub" etc.)
uk: **id_ALGORITHM.pub** (наприклад, "id_rsa.pub", "id_ed25519.pub" тощо).

source: The private key (the one without ".pub") should be kept secure and private. You should never share this.
uk: Закритий ключ (той, що без ".pub") слід зберігати в безпеці і не розголошувати. Ви ніколи не повинні ділитися ним.

source: The public key is what you add to servers or services to which you want to authenticate using your private key.
uk: Відкритий ключ - це те, що ви додаєте до серверів або сервісів, на яких ви хочете пройти автентифікацію за допомогою вашого закритого ключа.

source: Adding your SSH key to the ssh-agent and GitHub
uk: Додавання SSH-ключа до ssh-агента та GitHub

source: Before adding a new SSH key to the ssh-agent to manage your keys, you should have checked for existing SSH keys and generated SSH keys.
uk: Перш ніж додавати новий SSH-ключ до ssh-агента для керування ключами, вам слід перевірити наявність наявних SSH-ключів і згенерувати SSH-ключі.

source: Ensure the ssh-agent is running. You can use the "Auto-launching" or start it manually:
uk: Переконайтеся, що ssh-агент запущено. Ви можете скористатися "Автозапуском" або запустити його вручну:

source: Add you SSH private key to the ssh-agent.
uk: Додайте ваш приватний ключ SSH до ssh-агента.

source: Add the SSH public key to your account on GitHub. Copy the SSH public key to your clipboard.
uk: Додайте публічний ключ SSH до свого облікового запису на GitHub. Скопіюйте відкритий ключ SSH до буфера обміну.

source: Alternatively, if ``clip`` isn't working, just type public key content to the terminal using ``cat``,
uk: Крім того, якщо ``clip`` не працює, просто введіть вміст відкритого ключа у терміналі за допомогою ``cat``,

source: or simply navigate to the file and open it with any text editor. At the end, you need to copy public key content.
uk: або просто перейдіть до файлу і відкрийте його за допомогою будь-якого текстового редактора. В кінці потрібно скопіювати вміст відкритого ключа.

source: On GitHub, in the upper-right corner of any page, click your profile photo, then click **Settings**.
uk: На GitHub у правому верхньому куті будь-якої сторінки натисніть на фотографію свого профілю, а потім натисніть **Налаштування**.

source: In the "Access" section of the sidebar, click **SSH and GPG keys** and press **New SSH key** button.
uk: У розділі "Доступ" бічної панелі натисніть **Ключі SSH і GPG** і натисніть кнопку **Новий ключ SSH**.

source: In the "Title" field, add a descriptive label for the new key.
uk: У полі "Назва" додайте описову мітку для нового ключа.

source: Select the type of key -- "Authentication key".
uk: Виберіть тип ключа - "Ключ автентифікації".

source: In the "Key" field, paste your public key.
uk: У полі "Ключ" вставте ваш відкритий ключ.

source: Click **Add SSH key**.
uk: Натисніть **Додати SSH-ключ**.

source: If prompted, confirm access to your account on GitHub.
uk: Якщо з'явиться відповідний запит, підтвердіть доступ до свого облікового запису на GitHub.

source: Version Control System
uk: Система контролю версій

source: About version control (Git)
uk: Про контроль версій (Git)

source: Version control is a system that records changes to a file or set of files over time so that you can recall specific versions later. It allows you to revert selected files back to a previous state, revert the entire project back to a previous state, compare changes over time, see who last modified something that might be causing a problem, who introduced an issue and when, and more.
uk: Контроль версій - це система, яка реєструє зміни у файлі або наборі файлів з плином часу, щоб ви могли пізніше згадати конкретні версії. Він дозволяє повернути вибрані файли до попереднього стану, повернути весь проект до попереднього стану, порівняти зміни в часі, побачити, хто востаннє змінював щось, що може спричинити проблему, хто і коли створив проблему, тощо.

source: In a :abbr:`DVCS (Distributed Version Control Systems)` clients don't just check out the latest snapshot of the files; rather, they fully mirror the repository, including its full history. Thus, if any server dies, and these systems were collaborating via that server, any of the client repositories can be copied back up to the server to restore it. Every clone is really a full backup of all the data.
uk: У :abbr:`DVCS (Distributed Version Control Systems)` клієнти не просто перевіряють останній знімок файлів, а повністю дзеркально копіюють сховище, включно з його повною історією. Таким чином, якщо якийсь сервер вийде з ладу, а ці системи працювали через нього, будь-який з клієнтських репозиторіїв можна скопіювати на сервер, щоб відновити його роботу. Кожен клон - це фактично повна резервна копія всіх даних.

source: Distributed version control diagram
uk: Розподілена схема управління версіями

source: What is Git?
uk: Що таке Git?

source: The major difference between Git and any other VCS is the way Git thinks about its data. Conceptually, most other systems store information as a list of file-based changes. Git doesn't think of or store its data this way. Instead, Git thinks of its data more like a series of snapshots of a miniature filesystem.
uk: Основна відмінність між Git'ом та будь-якою іншою VCS полягає в тому, як Git'ом мислить про свої дані. Концептуально, більшість інших систем зберігають інформацію у вигляді списку змін у файлах. Git не думає про свої дані і не зберігає їх таким чином. Натомість, Git думає про свої дані як про серію знімків мініатюрної файлової системи.

source: This is an important distinction between Git and nearly all other VCSs. It makes Git reconsider almost every aspect of version control that most other systems copied from the previous generation. This makes Git more like a mini filesystem with some incredibly powerful tools built on top of it, rather than simply a VCS.
uk: Це важлива відмінність між Git'ом та майже всіма іншими VCS. Вона змушує Git'а переосмислити майже кожен аспект контролю версій, який більшість інших систем скопіювали з попереднього покоління. Це робить Git більше схожим на міні-файлову систему з деякими неймовірно потужними інструментами, побудованими поверх неї, ніж на звичайну VCS.

source: Storing data as snapshots of the project over time
uk: Зберігання даних у вигляді знімків проекту з плином часу

source: Local operations
uk: Локальні операції

source: Most operations in Git need only local files and resources to operate -- generally no information is needed from another computer on your network. Because you have the entire history of the project right there on your local disk, most operations seem almost instantaneous.
uk: Для виконання більшості операцій у Git'і потрібні лише локальні файли та ресурси - зазвичай не потрібна інформація з іншого комп'ютера у вашій мережі. Оскільки вся історія проекту зберігається на вашому локальному диску, більшість операцій виконуються майже миттєво.

source: Integrity
uk: Цілісність

source: Everything in Git is checksummed before it is stored and is then referred to by that checksum. This means it's impossible to change the contents of any file or directory without Git knowing about it.
uk: Усе в Git'і має контрольну суму перед збереженням і потім посилається на цю контрольну суму. Це означає, що неможливо змінити вміст будь-якого файлу або каталогу без відома Git'а.

source: Repository files states
uk: Стани файлів сховища

source: Git has three main states that your files can reside in: **modified**, **staged**, and **committed**:
uk: Git має три основні стани, в яких можуть перебувати ваші файли: **модифіковані**, **на стадії розробки** та **зафіксовані**:

source: Modified means that you have changed the file but have not committed it to your database yet.
uk: Змінено означає, що ви змінили файл, але ще не зафіксували його у вашій базі даних.

source: Staged means that you have marked a modified file in its current version to go into your next commit snapshot.
uk: Поетапний означає, що ви позначили змінений файл у його поточній версії, щоб він потрапив до наступного знімка фіксації.

source: Committed means that the data is safely stored in your local database.
uk: Фіксація означає, що дані безпечно зберігаються у вашій локальній базі даних.

source: The basic Git workflow goes something like this:
uk: Базовий робочий процес Git'а виглядає приблизно так:

source: You modify files in your working tree.
uk: Ви змінюєте файли у вашому робочому дереві.

source: You selectively stage just those changes you want to be part of your next commit, which adds only those changes to the staging area.
uk: Ви вибірково стабілізуєте лише ті зміни, які ви хочете включити в наступний коміт, що додає тільки ці зміни в область стабілізації.

source: You do a commit, which takes the files as they are in the staging area and stores that snapshot permanently to your Git directory.
uk: Ви робите фіксацію, яка бере файли в тому вигляді, в якому вони знаходяться в області підготовки, і зберігає цей знімок назавжди у вашому каталозі Git'а.

source: Command line
uk: Командний рядок

source: There are a lot of different ways to use Git. There are the original command-line tools, and there are many graphical user interfaces of varying capabilities. For one, the command line is the only place you can run all Git commands -- most of the GUIs implement only a partial subset of Git functionality for simplicity. If you know how to run the command-line version, you can probably also figure out how to run the GUI version, while the opposite is not necessarily true. Also, while your choice of graphical client is a matter of personal taste, all users will have the command-line tools installed and available.
uk: Існує багато різних способів використання Git'у. Існують оригінальні інструменти командного рядка, а також багато графічних інтерфейсів користувача з різними можливостями. З одного боку, командний рядок є єдиним місцем, де ви можете виконувати всі команди Git'а - більшість графічних інтерфейсів реалізують лише часткову підмножину функціональності Git'а для спрощення. Якщо ви знаєте, як запустити версію з командного рядка, ви, ймовірно, також зможете з'ясувати, як запустити версію з графічним інтерфейсом, хоча зворотне не обов'язково вірно. Крім того, хоча ваш вибір графічного клієнта є справою особистого смаку, всі користувачі матимуть встановлені та доступні інструменти командного рядка.

source: Remotes
uk: Віддалені репозиторії

source: To be able to collaborate on any Git project, you need to know how to manage your remote repositories. Remote repositories are versions of your project that are hosted on the Internet or network somewhere. You can have several of them, each of which generally is either read-only or read/write for you. Managing remotes includes knowing how to add remote repositories, remove remote repositories that are no longer valid, manage various branches and define them as being tracked or not, and more.
uk: Щоб мати можливість співпрацювати над будь-яким Git-проектом, вам потрібно знати, як керувати вашими віддаленими сховищами. Віддалені сховища - це версії вашого проекту, розміщені десь в інтернеті або мережі. Ви можете мати декілька таких сховищ, кожне з яких, як правило, доступне лише для читання або читання/запису. Керування віддаленими сховищами включає в себе вміння додавати віддалені сховища, видаляти віддалені сховища, які більше не є дійсними, керувати різними гілками і визначати їх як такі, що відстежуються чи ні, і багато іншого.

source: Showing your remote
uk: Перелік віддалених репозиторіїв

source: To see which remote servers you have configured, you can run the ``git remote`` command. It lists the shortnames of each remote handle you're specified. If you've cloned your repository, you should at least see ``origin`` - that is default name Git gives to the server you clone from:
uk: Щоб побачити, які віддалені сервери ви налаштували, ви можете виконати команду ``git remote``. Вона покаже короткі імена кожного вказаного вами віддаленого дескриптора. Якщо ви клонували свій репозиторій, ви маєте побачити принаймні ``origin`` - ім'я за замовчуванням, яке Git дає серверу, з якого ви клонуєте:

source: This means we can pull contributions from any of these users pretty easily. We may additionally have permission to push to one or more of these.
uk: Це означає, що ми можемо досить легко отримувати внески від будь-якого з цих користувачів. Крім того, ми можемо мати дозвіл на проштовхування до одного або декількох з них.

source: Adding remote repositories
uk: Додавання віддалених репозиторіїв

source: To add a new remote Git repository as a shortname you can reference easily, run ``git remote add <shortname> <url>``:
uk: Щоб додати новий віддалений репозиторій Git'у у вигляді короткого імені, на яке можна легко посилатися, виконайте ``git remote add <назва> <адреса>``:

source: Now you can use the string "personal" on the command line in lieu of the whole URL. ``master`` branch of "https://github.com/shorodilov/python-course" is now accessible as ``personal/master``, while shortname to the same branch in origin will be -- ``origin/master``.
uk: Тепер ви можете використовувати рядок "personal" в командному рядку замість повної URL-адреси. Гілка ``master`` в "https://github.com/shorodilov/python-course" тепер доступна як ``personal/master``, тоді як скорочена назва тієї ж гілки в origin буде -- ``origin/master``.

source: Fetching and pulling from remotes
uk: Отримання та витягування з віддаленого репозиторію

source: To get data from remote project, you can run ``git fetch`` command. The command goes out to that remote project and pulls down all the information from that remote project that you don't have yet. After you do this, you should have references to all the branches from that remote, which you can merge in or inspect at any time.
uk: Щоб отримати дані з віддаленого проекту, ви можете виконати команду ``git fetch``. Команда звернеться до цього віддаленого проекту і витягне всю інформацію з нього, якої ви ще не маєте. Після цього ви матимете посилання на всі гілки з цього віддаленого проекту, які ви можете об'єднати або переглянути у будь-який час.

source: If your current branch is set up to track a remote branch, you can use ``git pull`` command to automatically fetch and then merge that remote branch into your current branch. By default, the ``git clone`` command automatically sets up your local ``master`` branch to track the remote ``master`` branch (or whatever default remote branch).
uk: Якщо вашу поточну гілку налаштовано на відстеження віддаленої гілки, ви можете скористатися командою ``git pull`` для автоматичного отримання і подальшого об'єднання цієї віддаленої гілки у вашу поточну гілку. За замовчуванням, команда ``git clone`` автоматично налаштовує вашу локальну гілку ``master`` на відстеження віддаленої гілки ``master`` (або будь-якої іншої віддаленої гілки за замовчуванням).

source: From Git version 2.27 onward, ``git pull`` will give a warning if the ``pull.rebase`` variable is not set. Git will keep warning you until you set the variable.
uk: Починаючи з версії 2.27, ``git pull`` видаватиме попередження, якщо змінну ``pull.rebase`` не встановлено. Git продовжуватиме видавати попередження, доки ви не встановите змінну.

source: If you want the default behavior of Git (fast-forward if possible, else create a merge commit): ``git config --global pull.rebase "false"``.
uk: Якщо ви хочете отримати поведінку Git'а за замовчуванням (перемотування вперед, якщо можливо, інакше створіть комміт злиття): ``git config --global pull.rebase "false"``.

source: If you want to rebase when pulling: ``git config --global pull.rebase "true"``.
uk: Якщо ви хочете перебазувати базу при витягуванні: ``git config --global pull.rebase "true"``.

source: Pushing to remotes
uk: Відправка до віддаленого репозиторію

source: When you have your project at a point that you want to share, you have to push it upstream. The command for this is simple: ``git push <remote> <branch>``.
uk: Коли ваш проект знаходиться на етапі, яким ви хочете поділитися, вам потрібно перемістити його вгору за течією. Команда для цього проста: ``git push <віддалений> <гілка>``.

source: This command works only if you cloned from a server to which you have write access and if nobody has pushed in the meantime. If you and someone else clone at the same time and they push upstream and then you push upstream, you push will rightly be rejected. You'll have to fetch their work first and incorporate it into yours before you'll be allowed to push.
uk: Ця команда працює тільки якщо ви клонували з сервера, до якого у вас є доступ на запис, і якщо в цей час ніхто не робив поштовх. Якщо ви клонуєте одночасно з кимось іншим, і він зробить поштовх вище за течією, а потім ви, ваш поштовх буде справедливо відхилено. Вам доведеться спочатку отримати їхню роботу і включити її до своєї, перш ніж вам дозволять проштовхувати.

source: Pushing a new branch to remote
uk: Переміщення нової гілки до віддаленого репозиторію

source: In case you have created a local branch for some specific needs and you want to share this branch, you need to set up track for this branch. This can be done by using: ``git push --set-upstream origin <remote_branch>``. This will create a new remote branch and set up track to your current local branch. There is a shortcut for this command: ``git push -u origin <remote_branch>``.
uk: Якщо ви створили локальну гілку для якихось конкретних потреб і хочете надати до неї доступ, вам потрібно налаштувати трек для цієї гілки. Це можна зробити за допомогою ``git push --set-upstream origin <віддалена_гілка>``. Це створить нову віддалену гілку і налаштує трек до вашої поточної локальної гілки. Для цієї команди існує комбінація клавіш: ``git push -u origin <віддалена_гілка>``.

source: Inspecting a remote
uk: Перевірка віддаленого репозиторію

source: If you want to see more information about a particular remote, you can use the ``git remote show <remote`` command.
uk: Якщо ви хочете побачити більше інформації про певний віддалений сервер, скористайтеся командою ``git remote show <remote``.

source: It lists the URL for the remote repository as wll as the tracking branch information. The command helpfully tells you that if you're on the ``master`` branch amd you run ``git pull``, it will automatically merge the remote's ``master`` branch into the local one after it has been fetched. It also lists all the remote references it has pulled down.
uk: Вона показує URL-адресу віддаленого сховища, а також інформацію про відстежувану гілку. Команда корисно повідомляє, що якщо ви перебуваєте на гілці ``master`` і виконаєте ``git pull``, вона автоматично об'єднає гілку ``master`` віддаленого сховища з локальною гілкою після того, як її буде витягнуто. Також буде показано список усіх віддалених посилань, які було витягнуто.

source: Git Setup
uk: Налаштування Git'а

source: Now that you have Git on your system, you'll want to do a few things to customize your Git environment. Git comes with a tool called ``git config`` that lets you get and set configuration variables that control all aspects of how Git looks and operates. These variables can be stored in three different places:
uk: Тепер, коли у вашій системі встановлено Git, ви захочете зробити кілька речей, щоб налаштувати середовище Git'а. Git постачається з інструментом під назвою ``git config``, який дозволяє вам отримувати та встановлювати конфігураційні змінні, що контролюють всі аспекти вигляду та роботи Git'у. Ці змінні можна зберігати у трьох різних місцях:

source: *[path]/etc/gitconfig* file: Contains values applied to every user on the system and all their repositories. If you pass the option ``--system`` to git config, it reads and writes from this file specifically. Because this is a system configuration file, you would need administrative or superuser privilege to make changes to it.
uk: Файл *[path]/etc/gitconfig*: Містить значення, що застосовуються до кожного користувача у системі та всіх його сховищ. Якщо ви передасте git config параметр ``--system``, він буде читати і писати саме з цього файлу. Оскільки це файл конфігурації системи, вам знадобляться адміністративні привілеї або привілеї суперкористувача, щоб вносити до нього зміни.
