Repository: edu-python-course/edu-python-course.github.io
Catalog: src/_locales/*/LC_MESSAGES/vcs.po
Languages: uk

source: Version control system
uk: Система контролю версій

source: Git Basics
uk: Основи Git

source: Getting a Git repository
uk: Отримання Git-репозиторію

source: You typically obtain a Git repository in one of two ways:
uk: Зазвичай ви отримуєте Git-репозиторій одним з двох способів:

source: You can take a local directory that is currently not under version control, and turn it into a Git repository.
uk: Ви можете взяти локальний каталог, який наразі не перебуває під контролем версій, і перетворити його на Git-репозиторій.

source: You can clone an existing Git repository from elsewhere.
uk: Ви можете клонувати існуюче сховище Git'а з іншого місця.

source: In either case, you end up with a Git repository on your local machine, ready for work.
uk: У будь-якому випадку, ви отримаєте Git-репозиторій на вашій локальній машині, готовий до роботи.

source: Initializing repo in an existing directory
uk: Ініціалізація репо в існуючому каталозі

source: If you have a project directory that is currently not under version control and you want to start controlling it with Git, you first need to go to that project's directory. If you've never done this, it looks a little different depending on which system you're running:
uk: Якщо у вас є каталог проекту, який наразі не перебуває під контролем версій, і ви хочете почати контролювати його за допомогою Git'а, спершу вам потрібно перейти до каталогу цього проекту. Якщо ви ніколи цього не робили, це виглядає трохи інакше, залежно від того, якою системою ви користуєтеся:

source: Change directory in bash (Linux)
uk: Зміна каталогу в bash (Linux)

source: Change directory in bash (MacOS)
uk: Зміна каталогу в bash (MacOS)

source: Change directory in PowerShell (Windows)
uk: Зміна каталогу в PowerShell (Windows)

source: In the project's directory initialize a new Git repository.
uk: У каталозі проекту ініціалізуйте новий Git-репозиторій.

source: This creates a new subdirectory named .git that contains all of your necessary repository files -- a Git repository skeleton.
uk: Це створить новий підкаталог з ім'ям .git, який міститиме всі необхідні файли сховища - скелет сховища Git.

source: Cloning an existing repo
uk: Клонування існуючого репо

source: If you want to get a copy of an existing Git repository -- for example, a project you'd like to contribute to -- the command you need is ``git clone``.
uk: Якщо ви хочете отримати копію існуючого сховища Git'а - наприклад, проекту, до якого ви хочете долучитися, - вам потрібна команда ``git clone``.

source: That creates a directory named *edu-python-course.github.io*, initializes a *.git* directory inside it, pulls down all the data for that repository, and checks out a working copy of the latest version.
uk: Він створює каталог з назвою *edu-python-course.github.io*, ініціалізує каталог *.git* всередині нього, витягує всі дані для цього сховища і перевіряє робочу копію останньої версії.

source: That command does the same thing as the previous one, but the target directory is called *python-course*.
uk: Ця команда робить те саме, що й попередня, але цільовий каталог називається *python-course*.

source: Git has a number of different transfer protocols you can use. The previous example uses the ``https://`` protocol, but you may also see ``git://`` or ``user@server:path/to/repo.git``, which uses the SSH transfer protocol.
uk: Git має декілька різних протоколів передачі даних, які ви можете використовувати. У попередньому прикладі використовується протокол ``https://``, але ви також можете побачити ``git://`` або ``user@server:path/to/repo.git``, який використовує протокол передачі SSH.

source: Making changes to the repo
uk: Внесення змін до репозиторію

source: At this point, you should have a *bona fide* Git repository on your local machine, and a checkout or *working copy* of all of its files in front of you. Typically, you'll want to start making changes and committing snapshots of those changes into your repository each time the project reaches a state you want to record.
uk: На цьому етапі у вас має бути *справжній* Git-репозиторій на локальному комп'ютері, а також контрольна або *робоча копія* всіх його файлів перед вами. Зазвичай, ви захочете почати вносити зміни і фіксувати знімки цих змін у вашому сховищі кожного разу, коли проект досягне стану, який ви хочете зафіксувати.

source: Remember that each file in your working directory can be in one of two states: **tracked** or **untracked**.
uk: Пам'ятайте, що кожен файл у вашому робочому каталозі може перебувати в одному з двох станів: **відстежується** або **невідстежується**.

source: Tracked files are files that were in the last snapshot, as well as any newly staged files; they can be unmodified, modified, or staged. In short, tracked files are files that Git knows about.
uk: Відстежувані файли - це файли, які були в останньому знімку, а також будь-які нещодавно покладені файли; вони можуть бути незміненими, зміненими або покладеними. Коротше кажучи, відстежувані файли - це файли, про які відомо Git'у.

source: Untracked files are everything else -- any files in your working directory that were not in your last snapshot and are not in your staging area. Untracked basically means that Git sees a file you didn't have in a previous snapshot (commit), and which hasn't been yet staged.
uk: Невідстежені файли - це все інше - будь-які файли у вашому робочому каталозі, яких не було у вашому останньому знімку і які не перебувають у вашій області сховища. По суті, це означає, що Git бачить файл, якого не було у попередньому знімку (комміті), і який ще не було покладено у сховище.

source: Checking out status of the file(s)
uk: Перевірка стану файлу(ів)

source: The main tool you use to determine which files are in which state is the ``git status`` command.
uk: Основним інструментом для визначення стану файлів є команда ``git status``.

source: Newly added *README.md* file is untracked, because it's under "Untracked files" heading the status output.
uk: Щойно доданий файл *README.md* не відстежується, оскільки він знаходиться у розділі "Файли, що не відстежуються" у виведенні статусу.

source: Tracking new files
uk: Відстеження нових файлів

source: In order to begin tracking a new file, you use the ``git add`` command.
uk: Для того, щоб почати відстеження нового файлу, скористайтеся командою ``git add``.

source: From now *README.md* file is **added** to the stage area and ready to be committed (is under "Changes to be committed" heading).
uk: Відтепер файл *README.md* **додано** до області сцени і він готовий до фіксації (знаходиться під заголовком "Зміни, що підлягають фіксації").

source: You can use wildcards, to stage multiple files at once. The most common use cases is to add **all** modified files, or files inside of a specific directory.
uk: Ви можете використовувати підстановочні знаки, щоб вносити зміни до кількох файлів одночасно. Найпоширенішим випадком використання є додавання **усіх** змінених файлів або файлів у певному каталозі.

source: Staging modified files
uk: Зберігання змінених файлів

source: If a staged (or already committed) file has been changed, it will be moved under "Modified" heading. These changes wouldn't be committed unless they are staged.
uk: Якщо файл, що перебуває на етапі (або вже зафіксований), було змінено, його буде переміщено у рубрику "Змінено". Ці зміни не будуть зафіксовані, якщо вони не були поетапними.

source: Changes may be added to the stage area by repeating ``git add`` command.
uk: Зміни можна додати до області сцени, повторивши команду ``git add``.

source: Changes may be discard by ``git restore <file>`` command. This action will restore file to its **staged** version.
uk: Зміни можна відкинути командою ``git restore <file>``. Ця дія відновить файл до його **попередньої** версії.

source: Committing changes
uk: Фіксація змін

source: Now that the stage area is set up the way required, it's time to commit changes. Remember that anything that is still unstaged -- any files you have created or modified that you haven't run git add on since you edited them -- won't go into this commit.
uk: Тепер, коли область змін налаштована належним чином, настав час зафіксувати зміни. Пам'ятайте, що все, що ще не є стадією - будь-які файли, які ви створили або змінили, але не запустили git-додаток з моменту редагування, - не потраплять до цього коміту.

source: The simplest way to commit is to type ``git commit``:
uk: Найпростіший спосіб фіксації - ввести ``git commit``:

source: Doing so launches your editor of choice.
uk: Після цього запуститься обраний вами редактор.

source: This is set by your shell's EDITOR environment variable -- usually vim or emacs, although you can configure it with whatever you want using the ``git config --global core.editor``
uk: Це задається змінною оточення EDITOR вашої оболонки - зазвичай vim або emacs, хоча ви можете налаштувати її як завгодно за допомогою ``git config --global core.editor``

source: Alternatively, you can type your commit message inline with the ``commit`` command by specifying it after a ``-m`` flag, like this:
uk: Крім того, ви можете ввести повідомлення про фіксацію у рядку з командою ``commit``, вказавши його після прапорця ``-m``, як показано нижче:

source: Although it can be amazingly useful for crafting commits exactly how you want them, the staging area is sometimes a bit more complex than you need in your workflow. If you want to skip the staging area, Git provides a simple shortcut. Adding the ``-a`` option to the ``git commit`` command makes Git automatically stage every file that is already tracked before doing the commit, letting you skip the git add part:
uk: Хоча вона може бути надзвичайно корисною для створення коммітів саме так, як вам потрібно, область підготовки іноді буває трохи складнішою, ніж вам потрібно у вашому робочому процесі. Якщо ви хочете пропустити область підготовки, Git надає простий ярлик. Додавання опції ``-a`` до команди ``git commit`` змушує Git автоматично стадіювати кожен файл, який вже відстежується, перед виконанням комміту, дозволяючи вам пропустити частину git add:

source: Ignoring files
uk: Ігнорування файлів

source: Often, there is a class of files, that should not be a part of a repo. You want these files to be prevent from being automatically added or even shown as being untracked. These are generally files produced by loggers or a build system, or some local settings for the project that shouldn't be shared across other developers or maintainers. In such cases you can create a *.gitignore* file. Here is the content of *.gitignore* used in current repository:
uk: Часто існує клас файлів, які не повинні бути частиною репозиторію. Ви хочете, щоб ці файли не додавалися автоматично або навіть показувалися як такі, що не відстежуються. Зазвичай це файли, створені логгерами або системою збірки, або деякі локальні налаштування проекту, які не повинні бути доступними для інших розробників або супровідників. У таких випадках ви можете створити файл *.gitignore*. Ось вміст *.gitignore*, який використовується у поточному сховищі:

source: These lines mean:
uk: Ці рядки означають:

source: Content within directories named ".venv", ".env", "venv" or "env" will be ignored completely.
uk: Вміст каталогів з іменами ".venv", ".env", "venv" або "env" буде повністю проігноровано.

source: Content within "node_modules" directory will be ignored completely.
uk: Вміст каталогу "node_modules" буде повністю проігноровано.

source: Any files within directories named ".vscode" or ".idea" will be ignored completely.
uk: Будь-які файли в каталогах з іменами ".vscode" або ".idea" будуть повністю проігноровані.

source: Any file with name starting with hash (#) will be ignored.
uk: Будь-який файл з іменем, що починається з хешу (#), буде проігноровано.

source: Any file with name ending with tilda (~) will be ignored.
uk: Будь-який файл, ім'я якого закінчується на тильду (~), буде проігноровано.

source: Content within directories named "temp" or "tmp" will be ignored completely.
uk: Вміст каталогів з іменами "temp" або "tmp" буде повністю проігноровано.

source: Content within directories named "_builds", "_build", "builds" or "build" will be ignored completely.
uk: Вміст каталогів з іменами "_builds", "_build", "builds" або "build" буде повністю проігноровано.

source: Any file with name ending with ".pot" will be ignored.
uk: Будь-який файл з іменем, що закінчується на ".pot", буде проігноровано.

source: Any file with name ending with ".mo" will be ignored.
uk: Будь-який файл з іменем, що закінчується на ".mo", буде проігноровано.

source: Setting up a *.gitignore* file for your new repository before you get going is generally a good idea so you don't accidentally commit files that you really don't want in your Git repository.
uk: Створення файлу *.gitignore* для вашого нового сховища перед початком роботи, як правило, є гарною ідеєю, щоб випадково не зафіксувати файли, які вам насправді не потрібні у вашому Git-репозиторії.

source: The rules for the patterns you can put in the *.gitignore* file are as follows:
uk: Правила для шаблонів, які ви можете помістити у *.gitignore* файл, такі:

source: Blank lines or lines starting with # are ignored.
uk: Порожні рядки або рядки, що починаються з #, ігноруються.

source: Standard glob patterns work, and will be applied recursively throughout the entire working tree.
uk: Працюють стандартні шаблони глобусів, які будуть застосовуватися рекурсивно по всьому робочому дереву.

source: You can start patterns with a forward slash (/) to avoid recursive inclusion.
uk: Щоб уникнути рекурсивного включення, ви можете починати шаблони з прямої похилої риски (/).

source: You can end patterns with a forward slash (/) to specify a directory.
uk: Ви можете закінчувати шаблони прямою похилою рискою (/), щоб вказати каталог.

source: You can negate a pattern by starting it with an exclamation point (!).
uk: Ви можете заперечити шаблон, почавши його зі знаку оклику (!).

source: Glob patterns are like simplified regular expressions that shells use. An asterisk (\*) matches zero or more characters; [ab] matches any character inside the brackets (in this case a or b); a question mark (?) matches a single character; and brackets enclosing characters separated by a hyphen ([0-9]) matches any character between them (in this case 0 through 9). You can also use two asterisks to match nested directories; a/\*\*/z would match *a/z*, *a/b/z*, *a/b/c/z*, and so on.
uk: Шаблони глобусів подібні до спрощених регулярних виразів, які використовують оболонки. Зірочка (\*) відповідає нулю або більше символів; [ab] відповідає будь-якому символу всередині дужок (у цьому випадку a або b); знак питання (?) відповідає одному символу; а дужки, що містять символи, розділені дефісом ([0-9]), відповідають будь-якому символу між ними (у цьому випадку від 0 до 9). Ви також можете використовувати дві зірочки для вкладених каталогів; a/\*\*/z буде відповідати *a/z*, *a/b/z*, *a/b/c/z* і так далі.

source: Viewing the commit history
uk: Перегляд історії коммітів

source: After you have created several commits, or if you have cloned a repository with an existing commit history, you'll probably want to look back to see what has happened. The most basic and powerful tool to do this is the ``git log`` command.
uk: Після того, як ви створили кілька коммітів, або якщо ви клонували сховище з існуючою історією коммітів, ви, ймовірно, захочете озирнутися назад, щоб побачити, що сталося. Найпростішим і найпотужнішим інструментом для цього є команда ``git log``.

source: By default, with no arguments, ``git log`` lists the commits made in that repository in reverse chronological order; that is, the most recent commits show up first. As you can see, this command lists each commit with its SHA-1 checksum, the author's name and email, the date written, and the commit message.
uk: За замовчуванням, без аргументів, ``git log`` виводить список коммітів, зроблених у цьому сховищі, у зворотному хронологічному порядку; тобто, найновіші комміти показуються першими. Як ви можете бачити, ця команда показує кожне внесення з його контрольною сумою SHA-1, ім'ям та електронною адресою автора, датою створення та повідомленням про внесення.

source: One of the more helpful options is ``-p`` or ``--patch``, which shows the difference (the *patch* output) introduced in each commit. You can also limit the number of log entries displayed, such as using ``-<number>`` to show only desired number of latest entries.
uk: Однією з найбільш корисних опцій є ``-p`` або ``--patch``, яка показує відмінності (виведення *patch*), внесені у кожну фіксацію. Ви також можете обмежити кількість відображуваних записів, наприклад, за допомогою ``-<number>``, щоб показати лише потрібну кількість останніх записів.

source: This option display the same information but with a diff directly following each entry. This is very helpful for code review or to quickly browse what happened during a series of commits that a collaborator has added. You can also use a series of summarizing options with ``git log``.
uk: Цей параметр показує ту саму інформацію, але з різницею безпосередньо після кожного запису. Це дуже корисно для перегляду коду або для швидкого перегляду того, що сталося під час серії коммітів, доданих співавторами. Ви також можете скористатися низкою параметрів підсумовування за допомогою ``git log``.

source: If you want to see some abbreviated stats for each commit, you can use the ``--stat`` option:
uk: Якщо ви хочете побачити скорочену статистику для кожного коміту, ви можете скористатися опцією ``--stat``:

source: Another really useful option is ``--pretty``. This option changes the log output to formats other that the default. A few prebuilt option values are available for you to use. The ``oneline`` value for this option prints each commit on a single line, which is useful if you're look a lot of commits. In addition, the ``short``, ``full``, and ``fuller`` values show the output in roughly the same format but with less or more information.
uk: Ще одним дійсно корисним параметром є ``--pretty``. Цей параметр змінює формат виведення журналу на формат, відмінний від стандартного. Ви можете скористатися кількома готовими значеннями цього параметра. Значення ``oneline`` для цього параметра виводить кожну фіксацію в одному рядку, що є корисним, якщо ви переглядаєте багато фіксацій. Крім того, значення ``short``, ``full`` і ``fuller`` показують виведення у приблизно однаковому форматі, але з меншою або більшою кількістю інформації.

source: Specifier
uk: Специфікатор

source: Description of Output
uk: Опис Результатів

source: Commit hash
uk: Хеш комміту

source: Abbreviated commit hash
uk: Скорочений хеш коміту

source: Tree hash
uk: Дерево хешу

source: Abbreviated tree hash
uk: Скорочений хеш дерева

source: Parent hashes
uk: Батьківські хеші

source: Abbreviated parent hashes
uk: Скорочені батьківські хеші

source: Author name
uk: Ім'я автора

source: Author email
uk: Електронна пошта автора

source: Author date (format respects the --date=option)
uk: Дата автора (формат відповідає параметру --date=option)

source: Author date, relative
uk: Дата автора, відносна

source: Committer name
uk: Ім'я коммітера

source: Committer email
uk: Електронна пошта коммітера

source: Committer date
uk: Дата коммітера

source: Committer date, relative
uk: Дата коммітера, відносна

source: Subject
uk: Тема

source: The ``oneline`` and ``format`` option values are particularly useful with another ``log`` option called ``--graph``. This option adds a nice little ASCII graph showing your branch and merge history:
uk: Значення параметрів ``online`` і ``format`` особливо корисні з іншим параметром ``log``, який називається ``--graph``. Цей параметр додає невеликий гарний графік у форматі ASCII, який показує історію ваших гілок і злиття:

source: There are many more output-formatting options to ``git log``. Common options to ``git log`` are:
uk: Існує набагато більше варіантів форматування виводу для ``git log``. Загальними параметрами ``git log`` є наступні:

source: Option
uk: Опція

source: Description
uk: Опис

source: Show the patch introduced with each commit.
uk: Показувати виправлення, внесені з кожним коммітом.

source: Show statistics for files modified in each commit.
uk: Показувати статистику для файлів, змінених у кожному коміті.

source: Display only the changed/insertions/deletions line from the --stat command.
uk: Відображати лише змінений/вставлений/видалений рядок з команди --stat.

source: Show the list of files modified after the commit information.
uk: Показати список файлів, змінених після фіксації інформації.

source: Show the list of files affected with added/modified/deleted information as well.
uk: Також покажіть список файлів, яких торкнулася додана/змінена/видалена інформація.

source: Show only the first few characters of the SHA-1 checksum instead of all 40.
uk: Показувати лише перші кілька символів контрольної суми SHA-1 замість усіх 40.

source: Display the date in a relative format (for example, "2 weeks ago") instead of using the full date format.
uk: Відображати дату у відносному форматі (наприклад, "2 тижні тому") замість повного формату дати.

source: Display an ASCII graph of the branch and merge history beside the log output.
uk: Відобразити ASCII-графік гілки та історію злиття поряд з виведенням журналу.

source: Show commits in an alternate format. Option values include oneline, short, full, fuller, and format (where you specify your own format).
uk: Показувати комміти в альтернативному форматі. Значення опції включають: online, short, full, fuller і format (де ви можете вказати свій власний формат).

source: Shorthand for --pretty=oneline --abbrev-commit used together.
uk: Скорочення для --pretty=online --abbrev-commit, що використовується разом.

source: Limiting log output
uk: Обмеження виводу журналу

source: In addition to output-formatting options, ``git log`` takes a number of useful limiting options; that is options that let you show only a subset of commits. You've seen one such option already -- the ``-<number>`` (e.g. ``-2`` or ``-10``) option, which displays only the given number of latest commits.
uk: На додаток до параметрів форматування виводу, ``git log`` приймає ряд корисних обмежувальних параметрів, тобто параметрів, які дозволяють вам показувати лише підмножину коммітів. Ви вже бачили одну з таких опцій - ``-<число>`` (наприклад, ``-2`` або ``-10``), яка показує лише вказану кількість останніх коммітів.

source: However, the time-limiting options such as ``--since`` and ``--until`` are very useful. For example, the command to get the list of commits made in the last two weeks:
uk: Однак, дуже корисними є опції, що обмежують час, такі як ``--since`` і ``--until``. Наприклад, команда для отримання списку коммітів, зроблених за останні два тижні:

source: This command works with lots of formats - you can specify a specific date like ``"2022-02-24"``, or relative date such as ``"2 years 1 days 3 minutes ago"``.
uk: Ця команда працює з багатьма форматами - ви можете вказати конкретну дату, наприклад, ``"2022-02-24"``, або відносну дату, наприклад, ``"2 роки 1 день 3 хвилини тому"``.
