Repository: edu-python-course/edu-python-course.github.io
Catalog: src/_locales/*/LC_MESSAGES/rdbms/ddl.po
Languages: uk

source: Data definition language, DDL
uk: Мова визначення даних, DDL

source: Data Definition Language
uk: Мова Визначення Даних

source: :abbr:`DDL (Data Definition Language)` is a subset of SQL used for defining and modifying the database structure. Understanding DDL is fundamental to working with RDBMS. It allows you to define the structure of your data and make necessary changes as your requirements evolve.
uk: :abbr:`DDL (Data Definition Language)` - це підмножина мови SQL, яка використовується для визначення та модифікації структури бази даних. Розуміння DDL є фундаментальним для роботи з СКБД. Це дозволяє вам визначати структуру ваших даних і вносити необхідні зміни в міру розвитку ваших вимог.

source: ``CREATE`` used to create new objects within a RDBMS
uk: ``CREATE`` використовується для створення нових об'єктів у СКБД

source: ``ALTER`` used to modify existing objects
uk: ``ALTER`` використовується для зміни існуючих об'єктів

source: ``DROP`` used to delete database objects
uk: ``DROP`` використовується для видалення об'єктів бази даних

source: ``TRUNCATE`` used to remove all records from a table
uk: ``TRUNCATE`` використовується для видалення всіх записів з таблиці

source: Create objects
uk: Створення об'єктів

source: Creating database roles
uk: Створення ролей бази даних

source: SQLite is a small database in a single file and it doesn't implement role based access to data. Any user who have access to DB file will have access to data within the database as well.
uk: SQLite - це невелика база даних в одному файлі, і вона не реалізує рольовий доступ до даних. Будь-який користувач, який має доступ до файлу бази даних, також має доступ до даних всередині бази даних.

source: In RDBMS, roles are used to manage database permissions. They are an essential part of database security and user management.
uk: У СКБД ролі використовуються для керування правами доступу до бази даних. Вони є невід'ємною частиною безпеки бази даних та управління користувачами.

source: In PostgreSQL a **role** is an entity that can own database objects and have database privileges; a role can be considered a *user*, a *group*, or both depending on how it is used.
uk: У PostgreSQL **роль** - це сутність, яка може володіти об'єктами бази даних і мати привілеї до бази даних; роль може розглядатися як *користувач*, *група* або і те, і інше, залежно від того, як вона використовується.

source: ``CREATE ROLE`` statement defines a new database role.
uk: Оператор ``CREATE ROLE`` визначає нову роль бази даних.

source: This statement also can have options:
uk: Це твердження також може мати варіанти:

source: Options clarify if a role can login to the database server, connect to specific databases, create other roles etc. The full list of options is available in the official postgres documentation.
uk: Опції пояснюють, чи може роль входити на сервер бази даних, підключатися до певних баз даних, створювати інші ролі тощо. Повний список опцій доступний в офіційній документації postgres.

source: Creating databases
uk: Створення баз даних

source: ``CREATE DATABASE`` statement creates a new PostgreSQL database. To create a database, you must be a superuser or have ``CREATEDB`` privilege.
uk: Оператор ``CREATE DATABASE`` створює нову базу даних PostgreSQL. Для створення бази даних ви повинні бути супер-користувачем або мати привілей ``CREATEDB``.

source: Databases within a PostgreSQL server have owners. By default a user who creates a database is assigned as its owner. To specify another user as a database owner options may be used:
uk: Бази даних на сервері PostgreSQL мають власників. За замовчуванням власником бази даних призначається користувач, який її створив. Щоб вказати іншого користувача як власника бази даних, можна скористатися опціями:

source: There are lots of options for this statement available in the official postgres documentation.
uk: В офіційній документації postgres є багато варіантів цього твердження, доступних в офіційній документації postgres.

source: Creating tables
uk: Створення таблиць

source: To create a table, you use the aptly names ``CREATE TABLE`` command. In this command you specify at least a name for the new table, the names of the columns and the data type of each column.
uk: Для створення таблиці використовується команда ``CREATE TABLE``, яка має влучну назву. У цій команді ви вказуєте принаймні назву нової таблиці, назви стовпців і тип даних для кожного стовпця.

source: Default value
uk: Значення за замовчуванням

source: Constraints also can be applied for columns while creating a table. In this section, only most notable constraints will be described.
uk: Обмеження також можуть бути застосовані до стовпців під час створення таблиці. У цьому розділі буде описано лише найпоширеніші обмеження.

source: A column can be assigned a default value. When a new row is created and no values are specified for some of the columns, those columns will be filled with their respective default values. If no default value is declared explicitly, the default value is the ``NULL`` value. This usually makes sense because a null value can be considered to represent unknown data.
uk: Стовпчику можна призначити значення за замовчуванням. Коли створюється новий рядок і для деяких стовпців не вказано жодних значень, ці стовпці буде заповнено відповідними значеннями за замовчуванням. Якщо значення за замовчуванням не вказано явно, значенням за замовчуванням буде значення ``NULL``. Зазвичай це має сенс, оскільки нульове значення можна вважати таким, що представляє невідомі дані.

source: In a table definition the default values are listed after the data type.
uk: У визначенні таблиці значення за замовчуванням перераховані після типу даних.

source: The default value can be an expression, which will be evaluated whenever the default value is inserted (**not when the table is created**). A common example are timestamps columns representing the time a record was created and a "serial number" generator.
uk: Значення за замовчуванням може бути виразом, який буде обчислюватися щоразу, коли вставляється значення за замовчуванням (**не під час створення таблиці**). Типовим прикладом є стовпці з позначками часу, що відображають час створення запису, та генератор "серійних номерів".

source: There is a shorthand to generate serial numbers:
uk: Існує скорочення для генерації серійних номерів:

source: Generated Columns
uk: Згенеровані стовпці

source: In case you need to calculate some column value based on other columns, you may use generated columns. A generated column is a special column that is always computed from other columns. Thus, it is for columns what a view is for tables. There are two kinds of generated columns: stored and virtual.
uk: Якщо вам потрібно обчислити значення якогось стовпця на основі інших стовпців, ви можете використовувати згенеровані стовпці. Згенерований стовпець - це спеціальний стовпець, який завжди обчислюється на основі інших стовпців. Таким чином, для стовпців це те саме, що подання для таблиць. Існує два типи згенерованих стовпців: збережені та віртуальні.

source: A stored generated column is computed when it is written (inserted or updated) and occupies storage as if it were a normal column. A virtual generated column occupies no storage and is computed when it is read.
uk: Збережений згенерований стовпець обчислюється, коли він записується (вставляється або оновлюється) і займає пам'ять, як звичайний стовпець. Віртуальний згенерований стовпець не займає місця в пам'яті і обчислюється під час читання.

source: There are several restrictions applied to the definitions of generated columns and tables involving generated columns (not all listed):
uk: Існує кілька обмежень, що застосовуються до визначень згенерованих стовпців і таблиць, що містять згенеровані стовпці (не всі з них перераховані):

source: The generation expression can only use immutable functions and cannot use sub-queries or reference anything other than the current row.
uk: Вираз генерації може використовувати лише незмінні функції і не може використовувати підзапити або посилатися на щось, крім поточного рядка.

source: The generation expression cannot reference another generated column.
uk: Вираз генерації не може посилатися на інший згенерований стовпець.

source: A generated column cannot have column default.
uk: Створений стовпець не може мати стовпець за замовчуванням.

source: Constraints
uk: Обмеження

source: A check constraint is the most generic constraint type. It allows you to specify that the value in a certain column must satisfy a Boolean (truth-value) expression.
uk: Обмеження перевірки є найбільш загальним типом обмежень. Воно дозволяє вказати, що значення в певному стовпчику має задовольняти булевому (істинно-неістинному) виразу.

source: A not-null constraint simply specifies that a column must not assume the null value.
uk: Обмеження не-нуль просто вказує, що стовпець не повинен приймати нульове значення.

source: Unique constraints ensure that the data contained in a column, or a group of columns, is unique among all the rows in the table.
uk: Унікальні обмеження гарантують, що дані, які містяться у стовпчику або групі стовпчиків, є унікальними серед усіх рядків таблиці.

source: System columns
uk: Системні колонки

source: Every table has several system columns that are implicitly defined by the system. Therefore, these names cannot be used as names of user-defined columns. These columns cannot be used in the generated columns (except ``tableoid``). Columns are:
uk: Кожна таблиця має декілька системних стовпців, які неявно визначені системою. Тому ці назви не можуть бути використані як назви стовпців, визначених користувачем. Ці стовпці не можуть бути використані у створених стовпцях (крім ``tableoid``). Стовпці можна:

source: Modify objects
uk: Модифікація об'єктів

source: When you create a table and you realize that you made a mistake, or the requirements of the application change, you can drop the table and create it again. But this is not a convenient option if the table is already filled with data, or if the table is referenced by other database objects.
uk: Коли ви створюєте таблицю і розумієте, що зробили помилку, або вимоги програми змінюються, ви можете видалити таблицю і створити її заново. Але це не дуже зручний варіант, якщо таблиця вже заповнена даними або якщо на неї посилаються інші об'єкти бази даних.

source: PostgreSQL provides a family of commands to make modifications to existing tables. You can:
uk: PostgreSQL надає сімейство команд для внесення змін до існуючих таблиць. Ви можете це робити:

source: add columns
uk: додати стовпці

source: remove columns
uk: видалити стовпці

source: add constraints
uk: додати обмеження

source: remove constraints
uk: зняти обмеження

source: change default values
uk: змінити значення за замовчуванням

source: change column data types
uk: змінити типи даних стовпців

source: rename columns
uk: перейменувати стовпці

source: rename tables
uk: перейменовувати таблиці

source: All these actions are performed using the ``ALTER TABLE`` command.
uk: Всі ці дії виконуються за допомогою команди ``ALTER TABLE``.

source: Adding a column
uk: Додавання стовпця

source: To add a column, use a command like:
uk: Щоб додати стовпець, використовуйте команду накшатл:

source: Constraints can be also defined on the column at the same time, using general syntax.
uk: Обмеження можуть бути визначені для стовпця одночасно, використовуючи загальний синтаксис.

source: In fact all the options that can be applied to a column description in ``CREATE TABLE`` can be used here. Keep in mind however that the default value must satisfy the given constraints, or the ``ADD`` will fail.
uk: Фактично, тут можна використовувати всі опції, які можна застосувати до опису стовпця у ``CREATE TABLE``. Однак майте на увазі, що значення за замовчуванням має задовольняти заданим обмеженням, інакше команда ``ADD`` не спрацює.

source: Adding a constraint
uk: Додавання обмеження

source: To add a constraint, the table constraint syntax is used.
uk: Для додавання обмеження використовується синтаксис обмеження таблиці.

source: Other examples:
uk: Інші приклади:

source: To add a non-null constraint, which cannot be written as a table constraint, use this syntax:
uk: Щоб додати ненульове обмеження, яке не можна записати як обмеження таблиці, використовуйте цей синтаксис:

source: Changing a column's default value
uk: Зміна значення стовпця за замовчуванням

source: To set a new default for a column, use command like this:
uk: Щоб встановити нове значення за замовчуванням для стовпця, скористайтеся такою командою:

source: To remove any default value, use:
uk: Щоб видалити будь-яке значення за замовчуванням, використовуйте:

source: This is effectively the same as settings the default to ``NULL``.
uk: Це фактично те саме, що встановити значення за замовчуванням ``NULL``.

source: Changing a column's data type
uk: Зміна типу даних стовпця

source: To convert a column to a different data type, use a command like this:
uk: Щоб перетворити стовпець в інший тип даних, скористайтеся такою командою:

source: This will succeed only if each existing entry in the column can be converted to the new type by an implicit cast. If a more complex conversion is needed, you can add a ``USING`` clause that specifies how to compute the new values from old ones.
uk: Це вдасться лише у тому випадку, якщо кожен існуючий запис у стовпчику може бути перетворено до нового типу неявним приведенням. Якщо потрібне більш складне перетворення, ви можете додати речення ``ВИКОРИСТАННЯ``, яке вказує, як обчислювати нові значення зі старих.

source: PostgreSQL will attempt to convert the column's default value (if any) to the new type, as well as any constraint that involve the column. But these conversions might fail, or might produce surprising results. It's often best to drop any constraints on the column before altering its type, and then add back suitably modified constraints afterwards.
uk: PostgreSQL спробує перетворити значення стовпця за замовчуванням (якщо таке є) до нового типу, а також будь-які обмеження, пов'язані зі стовпцем. Але ці перетворення можуть виявитися невдалими або призвести до несподіваних результатів. Часто краще зняти будь-які обмеження зі стовпця перед зміною його типу, а потім додати назад відповідним чином змінені обмеження.

source: Renaming objects
uk: Перейменування об'єктів

source: To rename objects use ``RENAME`` command, like this:
uk: Для перейменування об'єктів використовуйте команду ``RENAME``, наприклад, так:

source: To rename a table:
uk: Перейменувати таблицю:

source: Remove objects
uk: Видалення об'єктів

source: Removing tables
uk: Видалення столів

source: ``DROP`` command is used to remove objects.
uk: Команда ``DROP`` використовується для видалення об'єктів.

source: Remember, attempting to remove a table that does not exist is an error. Nevertheless, it is common in SQL script files to unconditionally try to drop each table before creating it, ignoring any error message, so that the script works whether or not the table exists. ``IF EXISTS`` variant can be used to avoid the error message, but this is not standard SQL.
uk: Пам'ятайте, що спроба видалити неіснуючу таблицю є помилкою. Тим не менш, у файлах скриптів SQL часто зустрічається безумовна спроба видалити кожну таблицю перед її створенням, ігноруючи будь-які повідомлення про помилки, щоб скрипт працював незалежно від того, чи існує таблиця чи ні. варіант ``ЯКЩО ІСНУЄ`` можна використовувати для уникнення повідомлення про помилку, але це не є стандартним для SQL.

source: In case there are other objects referencing the object to drop ``CASCADE`` may be used to also remove any referencing objects.
uk: Якщо є інші об'єкти, що посилаються на об'єкт, який потрібно вилучити, ``CASCADE`` може бути використано для вилучення всіх об'єктів, що посилаються на об'єкт, який потрібно вилучити.

source: Removing a column
uk: Видалення стовпця

source: To remove a column, use ``DROP`` command like this:
uk: Щоб видалити стовпець, використовуйте команду ``DROP`` ось так:

source: Whatever data was in the column disappears. Table constraints involving the column are dropped, too. However, if the column is referenced by a foreign key constraint of another table, PostgreSQL will not silently drop that constraint. You can authorize dropping everything that depends on the column by adding ``CASCADE``:
uk: Усі дані, що були у стовпчику, зникають. Обмеження таблиці, що стосуються стовпця, також зникають. Однак, якщо на стовпець посилається обмеження зовнішнього ключа іншої таблиці, PostgreSQL не буде мовчки вилучати це обмеження. Ви можете дозволити вилучення всього, що залежить від стовпця, додавши ``CASCADE``:

source: Removing a constraint
uk: Зняття обмеження

source: To remove a constraint you need to know its name. The **psql** command ``\d table_name`` can be helpful to get the detailed information on a specific table, including all constraints' names assigned to it.
uk: Щоб видалити обмеження, вам потрібно знати його ім'я. Команда **psql** ``\d table_name`` може бути корисною для отримання детальної інформації про конкретну таблицю, включно з іменами всіх обмежень, призначених для неї.
