Repository: edu-python-course/edu-python-course.github.io
Catalog: src/_locales/*/LC_MESSAGES/rdbms/dml.po
Languages: uk

source: Data manipulation language, DML
uk: Мова маніпулювання даними, DML

source: Data Manipulation Language
uk: Мова Маніпулювання Даними

source: :abbr:`DML (Data Manipulation Language)` is a subset of SQL used for adding, updating, and deleting data within database tables.
uk: :abbr:`DML (Data Manipulation Language)` - це підмножина мови SQL, яка використовується для додавання, оновлення та видалення даних у таблицях бази даних.

source: ``SELECT`` used to query data from the database
uk: ``SELECT`` використовується для запиту даних з бази даних

source: ``INSERT`` used to insert new data into a table
uk: ``INSERT`` використовується для вставки нових даних у таблицю

source: ``UPDATE`` used to modify existing data
uk: ''UPDATE'' використовується для зміни існуючих даних

source: ``DELETE`` used to remove data from a table
uk: ``DELETE`` використовується для видалення даних з таблиці

source: Creating new records
uk: Створення нових записів

source: When a table is created, it contains no data. Inserting data will populate a table with values. Data is inserted one row at a time. You can also insert multiple rows with a single command. But it impossible to insert something that is not a complete row.
uk: Коли таблицю створено, вона не містить даних. Вставлення даних заповнить таблицю значеннями. Дані вставляються по одному рядку за раз. Ви також можете вставити кілька рядків за допомогою однієї команди. Але неможливо вставити щось, що не є повним рядком.

source: To create a new row use ``INSERT`` command.
uk: Для створення нового рядка використовується команда ``INSERT``.

source: The data values are listed in the order in which the columns appear in the table, separated by commas. This syntax has the drawback that you need to know the order of the columns in the table. To avoid this you can also list the columns explicitly. If you don't have values for all the columns, you can omit some of them. In that case, the columns will be filled with their default values.
uk: Значення даних перераховані в порядку, в якому стовпці з'являються в таблиці, розділені комами. Цей синтаксис має той недолік, що вам потрібно знати порядок стовпців у таблиці. Щоб уникнути цього, ви також можете перерахувати стовпці явно. Якщо ви не маєте значень для всіх стовпців, ви можете опустити деякі з них. У цьому випадку стовпці будуть заповнені значеннями за замовчуванням.

source: Create publisher table
uk: Створення таблиці видавців

source: Insert data to publisher table
uk: Вставка даних до таблиці видавця

source: You can insert multiple rows in a single command.
uk: Ви можете вставити кілька рядків однією командою.

source: Create author table
uk: Створення таблиці авторів

source: Inserting multiple values at a time
uk: Додавання декількох значень одночасно

source: There is a reference to the "publisher" table present below. Think of it like placing the publisher information directly into "book" table for now.
uk: Нижче є посилання на таблицю "видавництво". Подумайте про це, як про розміщення інформації про видавця безпосередньо в таблиці "книга".

source: Create book table
uk: Створити таблицю книг

source: Inserting records from file
uk: Вставка записів з файлу

source: Modifying records
uk: Змінення записів

source: The modification of data that is already in the database is referred as updating. To update the existing rows, use the ``UPDATE`` command. This requires three pieces of information:
uk: Зміна даних, які вже є в базі даних, називається оновленням. Щоб оновити існуючі рядки, скористайтеся командою ``UPDATE``. Для цього потрібні три частини інформації:

source: The name of the table and column(s) to update
uk: Назва таблиці та стовпця(ів) для оновлення

source: The new value of the column(s)
uk: Нове значення стовпця(ів)

source: Which row(s) to update
uk: Який(і) рядок(и) оновити

source: This might cause zero, one, or many rows to be updated. The update syntax is pretty straightforward. First the key word ``UPDATE`` followed by the table name. Next is the key word ``SET`` followed by the column name, an equal sign, and the new column value. The new column value can be any scalar expression, not just a constant. More than one column can be updated at a time by listing more than one assignment in the ``SET`` clause.
uk: Це може призвести до оновлення нульового, одного або багатьох рядків. Синтаксис оновлення досить простий. Спочатку ключове слово ``UPDATE``, за яким слідує назва таблиці. Далі йде ключове слово ``SET``, за яким слідує назва стовпця, знак рівності і нове значення стовпця. Нове значення стовпця може бути будь-яким скалярним виразом, а не лише константою. Більш ніж один стовпчик можна оновити за один раз, вказавши більше ніж одне присвоєння у реченні ``SET``.

source: ``WHERE`` clause is optional, but it limits the rows affected by ``UPDATE`` command. If there is no limitations all the records within a table will be updated with new values.
uk: ``WHERE`` є необов'язковим, але воно обмежує рядки, на які впливає команда ``UPDATE``. Якщо обмежень не вказано, то всі записи в таблиці буде оновлено новими значеннями.

source: Removing data
uk: Видалення даних

source: So far we have explained how to add data to tables and how to change data. What remains to discuss how to remove data that is no longer needed. Just as adding data is only possible in whole rows, you can only remove entire rows from a table.
uk: Досі ми пояснювали, як додавати дані до таблиць і як їх змінювати. Залишилося обговорити, як видалити дані, які більше не потрібні. Так само, як додавання даних можливе лише цілими рядками, ви можете видаляти дані з таблиці лише цілими рядками.

source: You use ``DELETE`` command to remove rows; the syntax is very similar to the ``UPDATE`` command.
uk: Для видалення рядків використовується команда ``DELETE``, синтаксис якої дуже схожий на команду ``UPDATE``.

source: If you simply write:
uk: Якщо просто писати:

source: then all rows in the table will be deleted!
uk: то всі рядки в таблиці будуть видалені!

source: Returning data from modified rows
uk: Повернення даних зі змінених рядків

source: Sometimes it is useful to obtain data from modified rows while they are being manipulated. The ``INSERT``, ``UPDATE`` and ``DELETE`` commands all have an optional ``RETURNING`` clause that supports this. Use of ``RETURNING`` avoids performing an extra database query to collect the data, and is especially valuable when it would otherwise be difficult to identify the modified rows reliably.
uk: Іноді буває корисно отримати дані зі змінених рядків під час маніпуляцій з ними. Команди ``INSERT``, ``UPDATE`` і ``DELETE`` мають необов'язковий параметр ``RETURNING``, який підтримує цю можливість. Використання ``RETURNING`` дозволяє уникнути виконання додаткового запиту до бази даних для збору даних і є особливо цінним, коли інакше було б важко достовірно ідентифікувати змінені рядки.

source: For example the query above provides the identifiers to new rows.
uk: Наприклад, наведений вище запит надає ідентифікатори для нових рядків.
