Repository: edu-python-course/edu-python-course.github.io
Catalog: src/_locales/*/LC_MESSAGES/rdbms/index.po
Languages: uk_ua

source: Relational databases
uk_ua: Реляційні бази даних

source: Relational Database
uk_ua: Реляційні бази даних

source: :abbr:`RDBMS (Relational Database Management System)` is a type of software that helps users to create, update, manage, and access relational databases. Relational databases organize data into tables, which consist of rows and columns. Each column represents a specific attribute of the data, while each row represents a specific instance of that data.
uk_ua: :abbr:`RDBMS (Relational Database Management System)` - це тип програмного забезпечення, яке допомагає користувачам створювати, оновлювати, керувати та отримувати доступ до реляційних баз даних. Реляційні бази даних організовують дані в таблиці, які складаються з рядків і стовпців. Кожен стовпець представляє певний атрибут даних, тоді як кожен рядок представляє конкретний екземпляр цих даних.

source: RDBMS allow users to interact with the database using :abbr:`SQL (Structured Query Language)`, which is a standard language for managing and manipulating relational databases. SQL allows users to perform a variety of operations on the database, including adding, updating, and deleting data, as well as retrieving data based on specific criteria.
uk_ua: СУБД дозволяє користувачам взаємодіяти з базою даних за допомогою :abbr:`SQL (Structured Query Language)`, яка є стандартною мовою для керування і маніпулювання реляційними базами даних. SQL дозволяє користувачам виконувати різноманітність операцій з базою даних, включаючи додавання, оновлення та видалення даних, а також отримання даних на основі певних критеріїв.

source: RDBMS also provide a range of features to ensure data integrity, such as enforcing data constraints, supporting transactions, and providing backup and recovery capabilities. Additionally, RDBMS systems often provide tools for managing the database, such as user interfaces for creating and modifying tables and views, and monitoring tools for optimizing database performance.
uk_ua: СУБД також надає низку функцій для забезпечення цілісності даних, таких як дотримання обмежень даних, підтримка транзакцій та забезпечення можливостей резервного копіюванняі відновлення. Крім того, системи РСУБД часто надають інструменти для керування базою даних, такі як інтерфейси користувача для створення та модифікації таблиць і представлень, а також інструменти моніторингу для оптимізації продуктивності бази даних.

source: Security is a paramount aspect of managing databases. Even at the introductory level, it's crucial to be aware of the basic security measures:
uk_ua: Безпека - найважливіший аспект управління базами даних. Навіть на початковому рівні важливо знати основні заходи безпеки:

source: **Authentication and Authorization**: Ensuring that only authorized users have access to the database.
uk_ua: **Аутентифікація та авторизація**: Забезпечення доступу до бази даних лише авторизованим користувачам.

source: **Role-Based Access Control**: Assigning permissions based on roles within the organization.
uk_ua: **Контроль доступу на основі ролей**: Призначення дозволів на основі ролей в організації.

source: **Data Encryption**: Protecting sensitive data both at rest and in transit.
uk_ua: **Шифрування даних**: Захист конфіденційних даних як у стані спокою, так і під час передачі.

source: There are dozens of RDBMS, used in nowadays projects. But most widespread are:
uk_ua: Існують десятки СУБД, які використовуються в сучасних проектах. Але найпоширенішими є наступні:

source: |postgres| **PostgreSQL**: A Powerful, open source object-relational database system.
uk_ua: |postgres| **PostgreSQL**: Потужна об'єктно-реляційна система баз даних з відкритим вихідним кодом.

source: |sqlite| **SQLite**: A C-library that implements a small, full featured SQL database engine.
uk_ua: |sqlite| **SQLite**: C-бібліотека, яка реалізує невеликий, проте повнофункціональний рушій баз даних SQL.

source: |mysql| **MySQL**: A fast, multithread, multi-user, and robust SQL database server.
uk_ua: |mysql| **MySQL**: Швидкий, багатопотоковий, багатокористувацький і надійний сервер баз даних SQL.
