Repository: edu-python-course/edu-python-course.github.io
Catalog: src/_locales/*/LC_MESSAGES/rdbms/relations.po
Languages: uk

source: This document describes the database relationships
uk: Цей документ описує відносини в базах даних

source: sql, db, database, relationship, primary key, foreign key, pk, fk, one-to-one, one-to-many, many-to-many, 1-1, 1-n, n-m
uk: sql, db, база даних, відношення, первинний ключ, зовнішній ключ, pk, fk, один-до-одного, один-до-багатьох, багато-до-багатьох, 1-1, 1-n, n-m

source: Data Relationships
uk: Зв'язки даних

source: Before dive into relationships, there is a need explain core concepts on how data are referenced between different tables.
uk: Перш ніж зануритися у взаємозв'язки, необхідно пояснити основні поняття про те, як дані посилаються між різними таблицями.

source: Primary key
uk: Первинний ключ (Primary key)

source: A primary key constraint indicates that a column, or group of columns, can be used as a unique identifier for rows in the table. This requires that values be both unique and not null. So, the following two table definitions accept the same data:
uk: Первинний ключ вказує на те, що стовпець або група стовпців може використовуватися як унікальний ідентифікатор для рядків у таблиці. Це вимагає, щоб значення були і унікальними, і не нульовими. Отже, наступні два визначення таблиці приймають однакові дані:

source: Primary keys can span more than one column; the syntax is similar to unique constraint:
uk: Первинні ключі можуть охоплювати більше одного стовпця; синтаксис подібний до унікального обмеження:

source: Adding a primary key will automatically create a unique B-tree index on the column or group of columns listed in the primary key, and will force the column(s) to be marked ``NOT NULL``.
uk: Додавання первинного ключа автоматично створить унікальний індекс B-дерева для стовпця або групи стовпців, перелічених у первинному ключі, і примусить стовпець(и) позначити ``NOT NULL``.

source: A table can have at most one primary key.
uk: Таблиця може мати не більше одного первинного ключа.

source: There can be any number of unique and not-null constraints, which are functionally almost the same thing, but only one can be identified as the primary key.
uk: Обмежень може бути будь-яка кількість унікальних і не нульових, які функціонально майже однакові, але тільки одне з них може бути ідентифіковане як первинний ключ.

source: Foreign key (FK)
uk: Зовнішній ключ (FK)

source: A foreign key constraint specifies that the value in a column (or a group of columns) must match the values appearing in some row of another table. We say this maintains the *referential integrity* between two tables.
uk: Зовнішній ключ визначає, що значення у стовпчику (або групі стовпчиків) має збігатися зі значеннями, що з'являються у деякому рядку іншої таблиці. Ми говоримо, що це підтримує *посилальну цілісність* між двома таблицями.

source: A table can have more than one foreign key constraint. Foreign key can also overlaps with the primary key.
uk: Таблиця може мати більше одного обмеження зовнішнього ключа. Зовнішній ключ також може перекриватися з первинним ключем.

source: To define a FK constraint:
uk: Щоб визначити FK:

source: In this situation the ``book`` table is the *referencing* table, and the ``publisher`` table is the *referenced* table. Similarly there are referencing and referenced columns.
uk: У цій ситуації таблиця ``book`` є таблицею *посилання*, а таблиця ``publisher`` є таблицею *посилання*. Аналогічно існують стовпці, на які є посилання, і стовпці, на які є посилання.

source: In case the referenced column is not explicitly defined, the primary key of the referenced table will be used as the referenced column.
uk: Якщо стовпець, на який є посилання, не визначено явно, буде використано первинний ключ таблиці, на яку посилаються.

source: It is not possible to create a row with non-null foreign key, that does not appear in the referenced table.
uk: Неможливо створити рядок з ненульовим зовнішнім ключем, який не з'являється в таблиці, на яку посилається.

source: Self-referential foreign key
uk: Самореферентний зовнішній ключ

source: Sometimes it is useful to the referenced table to be the same table as referencing. This makes possible to create a tree-structures with nodes, there a top-level node would have ``NULL`` ``parent_id``.
uk: Іноді корисно, щоб таблиця, на яку посилаються, збігалася з таблицею, на яку посилаються. Це дозволяє створювати деревоподібні структури з вузлами, де вузол верхнього рівня матиме ``NULL`` ``parent_id``.

source: Deleting referenced rows
uk: Видалення рядків з посиланнями

source: So far we know that the foreign keys disallows creation of rows that do not relate to any row inside the referenced table. But what if a referenced row needs to be removed? Intuitively, there are few options:
uk: Досі ми знали, що зовнішні ключі не дозволяють створювати рядки, які не пов'язані з жодним рядком всередині таблиці, на яку посилаються. Але що робити, якщо рядок, на який є посилання, потрібно видалити? Інтуїтивно зрозуміло, що варіантів небагато:

source: disallow deletion
uk: заборонити видалення

source: delete referencing rows as well
uk: також видалити рядки посилань

source: something else...
uk: щось інше...

source: Restricting and cascading deletes are the two most common options. ``RESTRICT`` prevents deletion of a referenced row. ``CASCADE`` will also delete all referencing rows as well as the referenced one.
uk: Обмеження та каскадне видалення є двома найпоширенішими варіантами. ``ОБМЕЖЕННЯ`` запобігає видаленню рядка, на який є посилання. ``CASCADE`` також видаляє всі рядки, на які є посилання, а також рядок, на який є посилання.

source: There are others options.
uk: Є й інші варіанти.

source: ``NO ACTION`` means that if any referencing rows still exist when the constraint is checked, an error is raised; this is the default behavior.
uk: ``NO ACTION`` означає, що якщо будь-які рядки посилань все ще існують, коли перевіряється обмеження, буде видано помилку; це поведінка за замовчуванням.

source: ``SET NULL`` will replace all referencing rows foreign key values with ``NULL`` values.
uk: ``SET NULL`` замінить значення зовнішнього ключа у всіх рядках, що посилаються, на значення ``NULL``.

source: ``SET DEFAULT`` will replace all referencing rows foreign key values with default values.
uk: ``SET DEFAULT`` замінить значення зовнішніх ключів усіх посилальних рядків значеннями за замовчуванням.

source: Relationships
uk: Відносини

source: From the point of view of the RDBMS there are no other relationships between two tables except the **foreign key**. But the way the foreign keys are designed brings us three concepts of the data relations.
uk: З точки зору СУБД, між двома таблицями не існує інших зв'язків, окрім **зовнішнього ключа**. Але те, як спроектовані зовнішні ключі, надає три концепції зв'язків між даними.

source: One-to-many
uk: ``article`` та ``comment`` мають відношення *один-до-багатьох*. Стаття може бути контейнером для багатьох коментарів, але коментар пов'язаний лише з однією статтею.

source: In a relational database, two tables have a one-to-many relationship if each row in one table references multiple rows of the other table. For example ``publisher`` can publish many books, but a single ``book`` is published by some specific publisher.
uk: У реляційній базі даних дві таблиці мають зв'язок "один до багатьох", якщо кожен рядок однієї таблиці посилається на декілька рядків іншої таблиці. Наприклад, ``видавець`` може видавати багато книжок, але кожна окрема ``книжка`` видається певним видавництвом.

source: One-to-one
uk: Один-до-одного

source: You can think of one-to-one relationship as a limited version of *one-to-many*.
uk: Ви можете думати про відносини один-на-один як про обмежену версію "один-до-багатьох".

source: In a relational database, two tables have a one-to-one relationship if each row in one table links to exactly one row in the other table, and vice versa. For example a table of ``members`` and a table of ``contacts`` might have a one-to-one relationship.
uk: У реляційній базі даних дві таблиці мають зв'язок "один до одного", якщо кожен рядок в одній таблиці посилається на точно такий самий рядок в іншій таблиці, і навпаки. Наприклад, таблиця ``members`` і таблиця ``contacts`` можуть мати зв'язок "один до одного".

source: Many-to-many
uk: Багато до багатьох

source: In relational database, two table have many-to-many relationship if each row in one table can reference multiple rows in another table, and vice versa. For example table ``book`` may contain records for books authored by many ``authors``. On the other hand author can write multiple books. Implementing a many-to-many relationship requires creation of an intermediate table, that applies one-to-many relationship with both original tables.
uk: У реляційній базі даних дві таблиці мають зв'язок "багато до багатьох", якщо кожен рядок в одній таблиці може посилатися на декілька рядків в іншій таблиці, і навпаки. Наприклад, таблиця ``book`` може містити записи про книги, написані багатьма ``authors``. З іншого боку, автор може написати декілька книг. Реалізація зв'язку "багато-до-багатьох" вимагає створення проміжної таблиці, яка застосовує зв'язок "один-до-багатьох" до обох вихідних таблиць.
