Repository: edu-python-course/edu-python-course.github.io
Catalog: src/_locales/*/LC_MESSAGES/vcs/pullrequest.po
Languages: uk

source: Version Control System - Pull Requests
uk: Система контролю версій - Запити на Злиття (Pull Requests)

source: Pull Request
uk: Запит на Злиття (Pull Request)

source: Pull request let you tell others about changes you've pushed to a branch in a repository on GitHub. Once a pull request is opened, you can discuss and review the potential changes with collaborators and add follow-up commits before your changes are merged into the base branch:cite:`github:about-pr`.
uk: Pull-запит дозволяє вам повідомити інших про зміни, які ви перенесли до гілки в репозиторії на GitHub. Після того, як запит відкрито, ви можете обговорити і переглянути потенційні зміни з колегами і додати подальші коміти, перш ніж ваші зміни будуть злиті в базову гілку branch:cite:`github:about-pr`.

source: Draft pull requests
uk: Чернетки pull requests

source: Draft pull requests are available in public repositories on GitHub. When you create a pull request, you can choose to a create a pull request that is ready for review or a draft pull request. Draft pull requests cannot be merged. When you're ready to get feedback on your pull request, you can mark your draft pull request as ready for review.
uk: Чернетки pull-запитів доступні в публічних репозиторіях на GitHub. Коли ви створюєте пул-запит, ви можете вибрати між створенням готового до розгляду пул-запиту та чернетки пул-запиту. Чернетки пул-запитів не можна об'єднувати. Коли ви будете готові отримати відгук на свій запит, ви можете позначити свій чернетковий запит як готовий до розгляду.

source: Difference between commits on compare and pull request pages
uk: Різниця між коммітами на сторінках порівняння та pull-запитів

source: The compare and pull request pages use different methods to calculate the diff for changed files:
uk: Сторінки запитів порівняння і витягування використовують різні методи для обчислення різниці для змінених файлів:

source: Compare pages show the diff between the tip of the head ref and the current common ancestor (that is, the merge base) of the head and base ref.
uk: На сторінках порівняння показано різницю між кінчиком головного референта і поточним спільним предком (тобто, основою злиття) головного і основного референта.

source: Pull request pages show the diff between the tip of the head ref and the common ancestor of the head and base ref at the time when the pull request was created. Consequently, the merge base used for the comparison might be different.
uk: Сторінки запитів на злиття показують різницю між вершиною головного рефа і спільним предком головного і базового рефів на момент створення запиту на злиття. Отже, база злиття, яка використовується для порівняння, може відрізнятися.

source: About comparing branches
uk: Про порівняння гілок

source: Pull requests display diffs to compare the changes you made in your topic branch against the base branch that you want to merge your changes into.
uk: Витягніть запити на відображення відмінностей, щоб порівняти зміни, зроблені у вашій гілці теми, з базовою гілкою, до якої ви хочете об'єднати ваші зміни.

source: Rather that viewing the commits themselves, you can view the proposed changes as they'll appear in the files once the pull request is merged. The files appear in alphabetical order within the Files changed tab. Additions to the files appear in green and are prefaced by a ``+`` sign while content that has been removed appears in red and is prefaced by a ``-`` sign :cite:`github:compare-pr`.
uk: Замість того, щоб переглядати самі комміти, ви можете переглянути запропоновані зміни, які з'являться у файлах після об'єднання запиту на витягування. Файли відображаються в алфавітному порядку на вкладці Змінені файли. Доповнення до файлів відображаються зеленим кольором зі знаком ``+``, тоді як вміст, який було вилучено, відображається червоним кольором зі знаком ``-`` :cite:`github:compare-pr`.

source: Creating a pull request
uk: Створення pull-запиту

source: Create a pull request to propose and collaborate on changes to a repository. These changes are proposed in a *branch*, which ensures that the default branch only contains finished and approved work:cite:`github:create-pr`.
uk: Створіть pull request, щоб пропонувати зміни до сховища та співпрацювати над ними. Ці зміни пропонуються у *гілці*, що гарантує, що гілка за замовчуванням містить лише завершені та затверджені роботи:cite:`github:create-pr`.

source: About branches
uk: Про гілки

source: Use a branch to isolate development work without affecting other branches in the repository. Each repository has one default branch, and can have multiple other branches. You can merge a branch into another branch using a pull request.
uk: Використовуйте гілку, щоб ізолювати роботу над розробкою, не впливаючи на інші гілки у сховищі. Кожне сховище має одну гілку за замовчуванням і може мати декілька інших гілок. Ви можете об'єднати гілку з іншою гілкою за допомогою pull-запиту.

source: Branches allow you to develop features, fix bugs, or safely experiment with new ideas in a contained area of your repository.
uk: Гілки дозволяють розробляти функції, виправляти помилки або безпечно експериментувати з новими ідеями в обмеженій області вашого сховища.

source: You always create a branch from an existing branch. Typically, you might create a new branch from the default branch of your repository.
uk: Ви завжди створюєте гілку з існуючої гілки. Зазвичай, ви можете створити нову гілку з гілки за замовчуванням вашого сховища.

source: On GitHub, navigate to the main page of the repository.
uk: На GitHub перейдіть на головну сторінку репозиторію.

source: Switch to "Pull requests" tab.
uk: Перейдіть на вкладку "Pull requests".

source: Press "New pull request" button.
uk: Натисніть кнопку "New pull request".

source: Select base and source branches.
uk: Виберіть базову і вихідну гілки.

source: Press "Create pull request" button.
uk: Натисніть кнопку "Create pull request".

source: Provide a meaningful title and description.
uk: Надайте змістовну назву та опис.

source: Draft or create a pull request.
uk: Створіть pull request або його чорнетку.

source: To create pull request that is ready for review, click **Create Pull Request**.
uk: Щоб створити запит, готовий до перегляду, натисніть **Create Pull Request**.

source: To create a draft pull request, use the drop-down and select **Create Draft Pull Request**, then click **Draft Pull Request**.
uk: Щоб створити чернетку запиту на вилучення, скористайтеся випадаючим списком і виберіть **Create Draft Pull Request**, а потім натисніть **Draft Pull Request**.
