Repository: edu-python-course/edu-python-course.github.io
Catalog: src/_locales/*/LC_MESSAGES/basics/bool_logic.po
Languages: uk

source: this document covers usage of logic and comparison operators in Python
uk: цей документ охоплює використання логіки та операторів порівняння в Python

source: Boolean Logic
uk: Булева Логіка

source: `George Boole`_ put together what is now known as `Boolean algebra`_, which relies on **true** and **false** values and define a set of boolean operations: **not**, **and**, and **or**.
uk: `George Boole`_ об'єднав те, що тепер відомо як `булева алгебра`_, яка спирається на значення **true** і **false** і визначає набір логічних операцій: **not**, **and** і **or**.

source: These Boolean values and operators are helpful in programming because they help you decide the course of action in your programs.
uk: Ці булеві значення та оператори корисні в програмуванні, оскільки вони допомагають визначити курс дій у ваших програмах.

source: The **Python boolean** type is one of Python's built-in data types. It's used to represent the truth value of an expression. For example, the expression ``1 < 2`` is ``True``, while the expression ``0 == 1`` is ``False``. Understanding how Python Boolean values behave is important to programming well in Python.
uk: Тип **Python boolean** є одним із вбудованих типів даних Python. Він використовується для представлення істиності значення виразу. Наприклад, вираз ``1 < 2`` є ``True``, тоді як вираз ``0 == 1`` є ``False``. Розуміння того, як поводяться логічні значення Python, є важливим для якісного програмування на Python.

source: Understanding Boolean
uk: Розбираємось з Логічним типом даних

source: The Boolean type has only two possible values:
uk: Логічний тип має лише два можливих значення:

source: No other value will have ``bool`` as it type.
uk: Жодне інше значення не матиме тип ``bool``.

source: The type ``bool`` is **built-in**, meaning it's always available in Python. ``True`` and ``False`` are keywords in Python and can't be used as variable names. but ``bool`` type isn't and it's possible assign to the name ``bool``, however this is considered bad style.
uk: Тип ``bool`` є **вбудованим**, тобто він завжди доступний у Python. ``True`` і ``False`` є ключовими словами в Python і не можуть використовуватися як імена змінних, але тип ``bool`` не є таким, і імені ``bool`` призначити інше значення, однак це вважається поганим стилем.

source: Boolean as numbers
uk: Boolean як число

source: Booleans are a subtype of **numeric** type in Python. This means they're numbers for all intents and purposes. In other words, you can apply arithmetic operations to Boolean, and you can also compare them to numbers. ``True`` value is treated to be 1, and ``False`` value is treated to be 0.
uk: Логічні значення є підтипом **числового** типу в Python. Це означає, що вони є числами для всіх намірів і цілей. Іншими словами, ви можете застосовувати арифметичні операції до логічних значень, а також порівнювати їх із числами. Значення ``True`` розглядається як 1, а значення ``False`` розглядається як 0.

source: There aren't many uses of the numerical nature of Boolean values.
uk: Числовій природі логічних значень можна знайти не так багато застосунків.

source: Truth value testing
uk: Перевірка істинності

source: Any object can be tested for truth value. By default an object considered ``True``, unless its class defines either. Here are most of built-in objects considered ``False``:
uk: Будь-який об'єкт можна перевірити на істинність. За замовчуванням об'єкт вважається ``True``, якщо його клас не визначає іншого. Ось більшість вбудованих об'єктів, які вважаються ``False``:

source: constant values: ``None`` and ``False``
uk: константи: ``None`` та ``False``

source: zero of any numeric type: ``0``, ``0.0``, ``0j``, ``Decimal(0)``, ``Fraction(0, 1)``
uk: нуль будь-якого числового типу: ``0``, ``0.0``, ``0j``, ``Decimal(0)``, ``Fraction(0, 1)``

source: empty sequences and collections: ``''``, ``[]``, ``()``, ``{}``, ``set()``, ``range(0)``.
uk: порожні послідовності та колекції: ``''``, ``[]``, ``()``, ``{}``, ``set()``, ``range(0)``.

source: If ``len(something)`` is equal to 0, than ``something`` is cast to ``bool`` as ``False``.
uk: Якщо ``len(something)`` дорівнює 0, тоді ``something`` буде приведено до ``bool`` як ``False``.

source: Boolean comparison
uk: Логічне Порівняння

source: Python provides 3 logical operators:
uk: Python надає 3 логічних оператори:

source: Operator
uk: Оператор

source: Logic operator
uk: Логічний оператор

source: Negation
uk: Заперечення

source: Conjunction
uk: Кон'юнкція

source: Disjunction
uk: Диз'юнкція

source: With these operators, you can build expressions by connecting Boolean expressions with each other. These operators are **keywords** of the language, so you cannot use them as identifiers without causing a *SyntaxError*.
uk: За допомогою цих операторів можна будувати вирази, поєднуючі логічні вирази один з одним. Ці оператори є **ключовими словами** мови, тому ви не можете використовувати їх як ідентифікатори, не викликаючи *SyntaxError*.

source: Getting started with ``not`` operator
uk: Початок роботи з оператором ``not``

source: The ``not`` operator is the Boolean or logic operator that implements negation in Python. It's **unary**, which means that it takes only one **operand**. The operand can be a Boolean expression or any Python object. The task of ``not`` is to reverse the truth value of its operand.
uk: Оператор ``not`` є логічним або логічним оператором, який реалізує заперечення в Python. Це **унарний**, що означає, що він приймає лише один **операнд**. Операндом може бути логічний вираз або будь-який об'єкт Python. Завдання ``not`` полягає в тому, щоб змінити значення істинності свого операнда.

source: not operator truth table
uk: таблиця істинності оператора not

source: This functionality makes it worthwhile in several situations:
uk: Ця функція доцільна в кількох ситуаціях:

source: Checking **unmet conditions** in the context of ``if`` statements and ``while`` loops
uk: Перевірка **невиконаних умов** у контексті операторів ``if`` і циклів ``while``

source: **Inverting the truth value** of an object or expression
uk: **Інвертування значення істинності** об'єкта чи виразу

source: Checking if a **value is not in a given container**
uk: Перевірка того, що **значення не міститься в заданому контейнері**

source: Checking for an **object's identity**
uk: Перевірка **ідентичності об'єкта**

source: Getting started with ``and`` operator
uk: Початок роботи з оператором ``and``

source: Python's ``and`` operator is **binary**, which means it takes two **operands**. The operands in an ``and`` expression are commonly known as *conditions*. The result of the operator depends on the truth values of its operands. It'll be ``True`` if **both** are true.
uk: Оператор Python ``and`` є **бінарним**, що означає, що він приймає два **операнди**. Операнди у виразі ``and`` зазвичай відомі як *умови*. Результат оператора залежить від істинних значень його операндів. Це буде ``True``, якщо **обидва** є істинними.

source: and operator truth table
uk: таблиця істинності оператора and

source: ``and`` operator works not only with operands of Boolean type. It's behavior:
uk: Оператор ``and`` працює не тільки з операндами логічного типу. Його поведінка:

source: evaluate 1st operand; return it, if it's ``False`` and finish
uk: обчислити 1-й операнд; повернути його, якщо він ``False`` та завершити

source: evaluate 2nd operand; return it, if it's ``False`` and finish
uk: обчислити 2-й операнд; повернути його, якщо він ``False`` та завершити

source: return 2nd operand
uk: повернути 2-й операнд

source: Getting started with ``or`` operator
uk: Початок роботи з оператором ``or``

source: With Boolean ``or`` operator, you can connect two Boolean expressions into one compound expression. This makes ``or`` the **binary** operator. At least one subexpression must be ``True`` for the compound expression to be considered ``True``, and it doesn't matter which. If both subexpressions are ``False``, then the expression is ``False``.
uk: За допомогою логічного оператора ``or`` ви можете з'єднати два логічні вирази в один складений вираз. Це робить ``or`` **бінарним** оператором. Принаймні один підвираз має бути ``True``, щоб складений вираз вважався ``True``, і не має значення який. Якщо обидва підвирази мають значення ``False``, тоді вираз є ``False``.

source: or operator truth table
uk: таблиця істинності оператора or

source: ``or`` operator works not only with operands of Boolean type. It's behavior:
uk: Оператор ``or`` працює не тільки з операндами логічного типу. Його поведінка:

source: evaluate 1st operand; return it, if it's ``True`` and finish
uk: обчислити 1-й операнд; повернути його, якщо він ``True`` та завершити

source: evaluate 2nd operand; return it, if it's ``True`` and finish
uk: обчислити 2-й операнд; повернути його, якщо він ``True`` та завершити

source: Comparison
uk: Порівняння

source: There are eight comparison operations in Python. They all have the same priority (which is higher than that of the Boolean operations).
uk: У Python є вісім операцій порівняння. Усі вони мають однаковий пріоритет (вищий, ніж у логічних операцій).

source: Comparison operators
uk: Оператори порівняння

source: Meaning
uk: Значення

source: strictly less than
uk: строго менше ніж

source: less than or equal
uk: менше або дорівнює

source: strictly greater than
uk: строго більше ніж

source: greater or equal
uk: більше або дорівнює

source: equal (aka *equality* comparison)
uk: дорівнює (також відоме як порівняння *equality*)

source: not equal
uk: не дорівнює

source: object identity
uk: ідентичність об'єкта

source: negated object identity
uk: заперечена ідентичність об'єкта

source: Each of these comparison operators return a Boolean value, it's always ``True`` or ``False``.
uk: Кожен із цих операторів порівняння повертає логічне значення, воно завжди ``True`` або ``False``.

source: You can chain comparison operators together: ``x < y < z`` is equal to ``x < y and y < z``.
uk: Ви можете об'єднати оператори порівняння: ``x < y < z`` дорівнює ``x < y і y < z``.

source: Equality vs Identity
uk: Рівність та Ідентичність

source: It's easier to understand the difference between those by asking the question each answers to.
uk: Легше зрозуміти різницю між ними, поставивши запитання, на яке кожен відповідає.

source: The question for ``==`` (*equality*) is:
uk: Питання для ``==`` (*equality*) таке:

source: Is object on the left **equal** to the object on the right
uk: Об'єкт ліворуч **дорівнює** об'єкту праворуч

source: The question for ``is`` (*identity*) is:
uk: Питання для ``is`` (*identity*) таке:

source: Is object on the left **the same** as the object on the right
uk: Об'єкт ліворуч **те саме**, що й об'єкт праворуч

source: For example, if there are two cars of the same model, same color etc. in front of you - these cars are equal, but they aren't ident to each other. But if you are shown two pictures of the same car, you understand that the cars on those pictures are the same object.
uk: Наприклад, якщо перед вами дві машини однієї моделі, одного кольору і т. д. - ці машини рівні, але не ідентичні одна одній. Але якщо вам покажуть дві фотографії однієї машини, ви зрозумієте, що машини на цих фотографіях є одним і тим же об'єктом.
