Repository: edu-python-course/edu-python-course.github.io
Catalog: src/_locales/*/LC_MESSAGES/basics/controlflow.po
Languages: uk

source: Control flow in Python
uk: Контроль потоку в Python

source: Control Flow
uk: Керування виконанням

source: ``if`` statement
uk: Вираз ``if``

source: Perhaps the most well-known statement type is ``if`` statement. For example:
uk: Мабуть, найвідомішим типом оператора є оператор ``if``. Наприклад:

source: if statement base example
uk: базовий приклад оператора if

source: But let's dive into ``if`` statement with more simple examples.
uk: Але давайте зануримося в інструкцію ``if`` з більш простими прикладами.

source: How it works
uk: Як це працює

source: **if** statement is defined with a keyword ``if`` followed by a Boolean expression or any object and finished with colon. The statement requires a *body*: other statements to execute, also called an *if block*. The body is indented at the same distance from the left (in Python we use 4 spaces to indent a single block of code).
uk: Оператор **if** визначається ключовим словом ``if``, за яким слідує логічний вираз або будь-який об'єкт і завершується двокрапкою. Оператор потребує *тіло*: інші оператори для виконання, які також називають блоком *if*. Тіло має відступ на однаковій відстані зліва (у Python ми використовуємо 4 пробіли для відступу одного блоку коду).

source: The body's statements will be executed only in case **if** expression is ``True``.
uk: Оператори тіла виконуватимуться лише у випадку, якщо вираз **if** має значення ``True``.

source: The ``print`` statement on line #6 will be executed only for even value of ``number`` variable.
uk: Оператор ``print`` у рядку #6 буде виконано лише для парного значення змінної ``number``.

source: ``else`` block
uk: Блок ``else``

source: ``if`` can be used by its own, it can extend its behavior with ``else`` block. The general syntax for ``else`` body is the same: at least one indented statement. But ``else`` doesn't take any expression after it. This block of code will be executed only that the ``if`` statement truth check fails.
uk: ``if`` може використовуватися самостійно, він може розширити свою поведінку за допомогою блоку ``else``. Загальний синтаксис для тіла ``else`` той самий: принаймні один оператор із відступом. Але ``else`` не приймає жодного виразу після нього. Цей блок коду буде виконано лише тоді, коли перевірка істинності оператора ``if`` буде невдалою.

source: You can attach **only one** else block to **if statement**. And you cannot use ``else`` statement on its own - this will cause *SyntaxError*.
uk: Ви можете приєднати **лише один** блок else до **інструкції if**. І ви не можете використовувати оператор ``else`` сам по собі - це спричинить *SyntaxError*.

source: ``elif`` block(s)
uk: Блок(и) ``elif``

source: ``elif`` (*else if*) statement may be considered as semi-statement between ``if`` and ``else`` statements. In case your program has more than two dedicated choices you are able to extends control flow by appending ``elif`` blocks after ``if`` statement. The syntax is pretty similar to ``if`` statement. Each ``elif`` has its own boolean expression or an object to test for the truth value.
uk: Оператор ``elif`` (*else if*) можна розглядати як напівоператор між ``if`` та ``else``. Якщо у вашій програмі є більше двох виділених варіантів, ви можете розширити потік керування, додавши блоки ``elif`` після оператора ``if``. Синтаксис дуже схожий на оператор if. Кожен ``elif`` має свій власний логічний вираз або об'єкт для перевірки значення істинності.

source: You can attach as many ``elif`` statements as it needed. But you cannot use ``elif`` without ``if`` statement.
uk: Ви можете додати скільки завгодно операторів ``elif``. Але ви не можете використовувати ``elif`` без оператора ``if``.

source: Python will test conditions in ``if`` and ``elif`` statements from top to bottom. The first one, which considered to be ``True`` will be executed. All others will be skipped.
uk: Python перевірить умови в операторах ``if`` та ``elif`` зверху вниз. Буде виконано перший, який вважається ``True``. Усі інші будуть проігноровано.

source: If there were no truth conditions ``else`` block will be executed (if exists).
uk: Якщо не було істиних умов, буде виконано блок ``else`` (якщо існує).

source: The order conditions appears matter. The truth test goes from top to bottom and stops at first expression which is ``True``.
uk: Порядок у якому визначено умови має значення. Перевірка істинності йде зверху вниз і зупиняється на першому виразі, який є ``True``.

source: Usage
uk: Використання

source: ``if/elif/else`` statements help you to control which portion of your code is executed based on conditions from outer scope.
uk: Оператори ``if/elif/else`` допомагають вам контролювати, яка частина вашого коду виконується на основі умов ззовні.
