Repository: edu-python-course/edu-python-course.github.io
Catalog: src/_locales/*/LC_MESSAGES/spec/giver/index.po
Languages: uk

source: Anonymous Giver Site
uk: Сайт Анонімних Дарульвальників

source: The project is inspired by "Secret Santa" (aka "Secret Nicholas") Christmas tradition, but it does not focus on specific celebrations or events. The primary objective is to create a place on the internet where people can gather together in groups and anonymously give gifts to each other.
uk: Проект натхненний різдвяною традицією "Таємного Санти" (також відомого як "Таємний Миколай"), але він не фокусується на конкретних святкуваннях чи подіях. Основна мета - створити в інтернеті місце, де люди можуть збиратися в групи і анонімно дарувати один одному подарунки.

source: Key features
uk: Ключові особливості

source: Wish lists
uk: Списки побажань

source: Any registered user can create and modify their own wish lists. The wish list is generally private and is not visible to other users, unless they are assigned as a gift-giver to the wish list owner.
uk: Будь-який зареєстрований користувач може створювати і змінювати власні списки бажань. Список бажань, як правило, є приватним і не видимим для інших користувачів, якщо тільки вони не призначені дарувальником для власника списку.

source: Many gift-giving campaigns
uk: Багаточисельні кампанії з роздачі подарунків

source: Users can join multiple gift-giving campaigns without any limit.
uk: Користувачі можуть долучатися до кількох кампаній без обмежень.

source: Personal reminders
uk: Персональні нагадування

source: Users with empty wish lists will be prompted to place something there. Similarly, dormant users will be prompted to join an existing gift-giving campaign.
uk: Користувачам з порожніми списками бажань буде запропоновано додати туди щось. Так само неактивним користувачам буде запропоновано приєднатися до вже існуючої кампанії з дарування подарунків.

source: Administration can't interfere
uk: Адміністрація не може втручатися

source: Site admins provide moderation for wish lists and support gift-giving campaigns. But they cannot create their own campaigns, or modify or remove existing campaigns created by other users.
uk: Адміністратори сайту модерують списки бажань і підтримують кампанії з дарування подарунків. Але вони не можуть створювати власні кампанії, змінювати або видаляти існуючі кампанії, створені іншими користувачами.

source: Registration and authentication
uk: Реєстрація та аутентифікація користувачів

source: Anonymous users may access any publicly available page.
uk: Анонімні користувачі можуть отримати доступ до будь-якої загальнодоступної сторінки.

source: Anonymous users can register by providing a username, fullname, and password.
uk: Анонімні користувачі можуть зареєструватися, вказавши ім'я користувача, повне ім'я та пароль.

source: Anonymous users can log in to their existing account.
uk: Анонімні користувачі можуть увійти до свого облікового запису.

source: Authenticated users can log out at any time.
uk: Авторизовані користувачі можуть вийти з системи в будь-який час.

source: Wish lists are personal collections of desired gifts.
uk: Список бажань - це особиста колекція бажаних подарунків.

source: A wish list is created for any registered user, except admins.
uk: Список побажань створюється для будь-якого зареєстрованого користувача, окрім адміністраторів.

source: Users must add at least one item to their wish list before using the site.
uk: Перед тим, як користуватися сайтом, користувачі повинні додати принаймні один пункт до свого списку бажань.

source: A wish list is available only to its owner and site admins.
uk: Список побажань доступний лише його власнику та адміністраторам сайту.

source: A wish list is temporary available to other users assigned as a gift-giver to its owner.
uk: Список бажань тимчасово доступний іншим користувачам, призначеним дарувальником його власнику.

source: Owners can add, modify, or remove entries in their wish lists.
uk: Власники можуть додавати, змінювати або видаляти записи у своїх списках бажань.

source: Admins can mark any wish list item as restricted, which makes it act as a deleted one.
uk: Адміністратори можуть позначити будь-яку позицію списку бажань як обмежену, і тоді вона буде діяти як видалена.

source: Gift-giving campaigns
uk: Кампанії з роздачі подарунків

source: Non-admin users can create their own gift-giving campaigns.
uk: Користувачі, які не є адміністраторами, можуть створювати власні кампанії з дарування подарунків.

source: Each campaign should have name, description and members list.
uk: Кожна кампанія повинна мати назву, опис та список учасників.

source: The campaign creator is automatically a member and cannot be excluded.
uk: Творець кампанії автоматично стає учасником і не може бути виключений.

source: Campaigns status can be draft, public, private, or completed.
uk: Статус кампанії може бути чернетка, публічна, приватна або завершена.

source: Admins or the campaign creator can run the campaign if it has at least 3 members.
uk: Адміни або творець кампанії можуть запустити кампанію, якщо в ній є щонайменше 3 учасники.

source: Campaigns cannot be joined once they have started.
uk: Приєднатися до кампанії після її початку неможливо.

source: Any user, except the creator, can leave the campaign if it hasn't started.
uk: Будь-який користувач, окрім автора, може вийти з кампанії, якщо вона не розпочалася.

source: The creator can remove non-running campaigns regardless of members list, creation time, or status.
uk: Творець може видалити неактивні кампанії незалежно від списку учасників, часу створення або статусу.

source: Admins can remove the campaigns with 3 or fewer members that hasn't started within a specified time.
uk: Адміністратори можуть видаляти кампанії з 3 або менше учасниками, які не розпочалися протягом певного часу.

source: Admins can remove draft campaigns that haven't been published within a specified time.
uk: Адміністратори можуть видаляти чернетки кампаній, які не були опубліковані протягом певного часу.

source: The number of campaigns a user can be member of is limited by the number of items in their wish list.
uk: Кількість кампаній, в яких може брати участь користувач, обмежена кількістю пунктів у його списку бажань.

source: Draft campaigns
uk: Проекти (чернетки) кампаній

source: No user can join a draft campaign.
uk: Жоден користувач не може приєднатися до неопублікованної кампанії.

source: Campaigns can are marked as drafts by default at creation.
uk: Кампанії за замовчуванням позначаються як чернетки під час створення.

source: The creator can publish the campaign by making campaign private or public.
uk: Автор може опублікувати кампанію, зробивши її приватною або публічною.

source: Draft campaigns cannot be initiated.
uk: Чернетки кампанії не можуть бути ініційовані.

source: Public campaigns
uk: Публічні кампанії

source: Public campaigns are accessible to both anonymous and authenticated users.
uk: Публічні кампанії доступні як анонімним, так і авторизованим користувачам.

source: Authenticated users can join any public campaign, unless it hasn't started.
uk: Авторизовані користувачі можуть приєднатися до будь-якої публічної кампанії, якщо вона ще не розпочалася.

source: Private campaigns
uk: Приватні кампанії

source: Private campaign are available only to their members.
uk: Приватні кампанії доступні тільки їх учасникам.

source: The campaign creator can share a join link with other users.
uk: Творець кампанії може поділитися посиланням для приєднання з іншими користувачами.

source: Once joined, the campaign becomes visible in the user's campaigns list.
uk: Після приєднання кампанія стає видимою у списку кампаній користувача.

source: Completed campaigns
uk: Завершені кампанії

source: Actually this means the campaign has been completed and archived. Admins can remove archived campaigns at any time (campaigns clean-up). Running campaigns cannot be manually moved to completed status. This is done automatically.
uk: Насправді це означає, що кампанія завершена і заархівована. Адміністратори можуть видалити заархівовані кампанії в будь-який час (очищення кампаній). Кампанії, що тривають, не можна вручну перевести в статус завершених. Це відбувається автоматично.

source: Campaign life-cycle
uk: Життєвий цикл кампанії

source: Running the gift-giving campaign
uk: Проведення кампанії з роздачі подарунків

source: The option to start campaigns is available to their creators or admins.
uk: Можливість запускати кампанії доступна їхнім творцям або адміністраторам.

source: Once the campaign has started, no one can join or leave it.
uk: Після початку кампанії ніхто не може приєднатися до неї або вийти з неї.

source: Each campaign member is assigned to give a gift to a randomly chosen person within the same campaign members list.
uk: Кожному учаснику кампанії доручено подарувати подарунок випадково обраній людині з того ж списку учасників кампанії.

source: Giver access for wish list
uk: Доступ до списку бажань для дарувальника

source: The wish list of the assigned person becomes visible to the gift giver.
uk: Список побажань призначеної особи стає видимим для дарувальника.

source: The giver can mark any single item within this list as a given gift.
uk: Дарувальник може позначити будь-яку позицію з цього списку як подарунок.

source: After the gift is given, wish list returns to normal.
uk: Після вручення подарунка список бажань повертається до нормального стану.

source: Wish list entry marked as given, cannot be changed by other givers.
uk: Пункт списку бажань, позначений як подарований, не може бути змінений іншими дарувальниками.

source: Multiple gifts
uk: Кілька подарунків

source: Generally, gift-giving campaigns allow for one gift at a time. However, if a user is assigned twice to the same giver from different campaigns, the giver can mark as many entries as the number of assignments.
uk: Зазвичай, кампанії дозволяють дарувати один подарунок за раз. Однак, якщо користувач двічі призначений одному і тому ж дарувальнику з різних кампаній, дарувальник може позначити стільки записів, скільки має призначень.

source: Autocomplete
uk: Автозавершення

source: Once all the assignments within a campaign are completed, the campaign itself is considered to be completed.
uk: Як тільки всі завдання в рамках кампанії виконані, сама кампанія вважається завершеною.

source: **All site functions** will be implemented within REST API.
uk: **Всі функції сайту** будуть реалізовані за допомогою REST API.
